
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CinematicCamera
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: Pal7
/// dependency: Sequence

/// Class /Game/Effects/Skill/Boss/Boss_XiQv/BP/BP_EX_PP_Bingdong_XiQv.BP_EX_PP_Bingdong_XiQv_C
/// Size: 0x0000 (0x000760 - 0x000760)
class UBP_EX_PP_Bingdong_XiQv_C : public UPaladinPostProcess
{ 
public:
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_Yewai_WaterFall_06.BP_EX_PXC_Yewai_WaterFall_06_C
/// Size: 0x0038 (0x000220 - 0x000258)
class ABP_EX_PXC_Yewai_WaterFall_06_C : public AActor
{ 
public:
	class UStaticMeshComponent*                        SM_EX_Water_Fall_005;                                       // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Under_002;                            // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Under_001;                            // 0x0230   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_004;                                       // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0248   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0250   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_MSM_WaterFall_01.BP_EX_PXC_MSM_WaterFall_01_C
/// Size: 0x0040 (0x000220 - 0x000260)
class ABP_EX_PXC_MSM_WaterFall_01_C : public AActor
{ 
public:
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0238   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0248   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0250   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0258   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_MSM_WaterFall_02.BP_EX_PXC_MSM_WaterFall_02_C
/// Size: 0x0038 (0x000220 - 0x000258)
class ABP_EX_PXC_MSM_WaterFall_02_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0248   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0250   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_MSM_WaterFall_03.BP_EX_PXC_MSM_WaterFall_03_C
/// Size: 0x0038 (0x000220 - 0x000258)
class ABP_EX_PXC_MSM_WaterFall_03_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0248   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0250   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_WaterFall_01.BP_EX_PXC_WaterFall_01_C
/// Size: 0x0038 (0x000220 - 0x000258)
class ABP_EX_PXC_WaterFall_01_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0248   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0250   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_WaterFall_02.BP_EX_PXC_WaterFall_02_C
/// Size: 0x0060 (0x000220 - 0x000280)
class ABP_EX_PXC_WaterFall_02_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_006;                              // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_004;                                       // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_005;                              // 0x0238   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0240   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0248   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0250   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0258   (0x0008)  
	class UDecalComponent*                             DECAL;                                                      // 0x0260   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0268   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0270   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0278   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_WaterFall_03.BP_EX_PXC_WaterFall_03_C
/// Size: 0x0058 (0x000220 - 0x000278)
class ABP_EX_PXC_WaterFall_03_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_007;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_006;                              // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_005;                              // 0x0238   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0248   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0250   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0258   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0260   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0268   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0270   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_WaterFall_04.BP_EX_PXC_WaterFall_04_C
/// Size: 0x0040 (0x000220 - 0x000260)
class ABP_EX_PXC_WaterFall_04_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_005;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0238   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0248   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0250   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0258   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_WaterFall_05.BP_EX_PXC_WaterFall_05_C
/// Size: 0x0048 (0x000220 - 0x000268)
class ABP_EX_PXC_WaterFall_05_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_005;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0238   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0248   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0250   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0258   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0260   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_WaterFall_06.BP_EX_PXC_WaterFall_06_C
/// Size: 0x0020 (0x000220 - 0x000240)
class ABP_EX_PXC_WaterFall_06_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0230   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0238   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_Yewai_WaterFall_02.BP_EX_PXC_Yewai_WaterFall_02_C
/// Size: 0x0028 (0x000220 - 0x000248)
class ABP_EX_PXC_Yewai_WaterFall_02_C : public AActor
{ 
public:
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Under_001;                            // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0230   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0238   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0240   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_Yewai_WaterFall_04.BP_EX_PXC_Yewai_WaterFall_04_C
/// Size: 0x0048 (0x000220 - 0x000268)
class ABP_EX_PXC_Yewai_WaterFall_04_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_005;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Under_002;                            // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0248   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0250   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0258   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0260   (0x0008)  
};

/// Class /Game/Effects/Env/LevelScene/PingXiCun/Fall/Blue/BP_EX_PXC_Yewai_WaterFall_05.BP_EX_PXC_Yewai_WaterFall_05_C
/// Size: 0x0050 (0x000220 - 0x000270)
class ABP_EX_PXC_Yewai_WaterFall_05_C : public AActor
{ 
public:
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_004;                              // 0x0220   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_003;                              // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_002;                              // 0x0230   (0x0008)  
	class UParticleSystemComponent*                    P_Env_PXC_Fall_Splash_Top_001;                              // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_005;                                       // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_004;                                       // 0x0248   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_003;                                       // 0x0250   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_002;                                       // 0x0258   (0x0008)  
	class UStaticMeshComponent*                        SM_EX_Water_Fall_001;                                       // 0x0260   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0268   (0x0008)  
};

/// Class /Game/Effects/System/Minigame/CardGame/Blue/B_EX_Card_CS_Small.B_EX_Card_CS_Small_C
/// Size: 0x0000 (0x000160 - 0x000160)
class UB_EX_Card_CS_Small_C : public UCameraShake
{ 
public:
};

/// Class /Game/Effects/Skill/Player/ZhaoHuanShou/JiuShen/BP/BP_EX_PP_Skill_01_MZ_RadialBlur_Jiushen.BP_EX_PP_Skill_01_MZ_RadialBlur_Jiushen_C
/// Size: 0x0000 (0x000760 - 0x000760)
class UBP_EX_PP_Skill_01_MZ_RadialBlur_Jiushen_C : public UPaladinPostProcess
{ 
public:
};

/// Class /Game/Effects/Skill/Player/ZhaoHuanShou/Common/SQ/Zhaohuanshou_Camera.Zhaohuanshou_Camera_C
/// Size: 0x0000 (0x000920 - 0x000920)
class AZhaohuanshou_Camera_C : public AFullScreenCineCameraActor_C
{ 
public:
};

/// Class /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_XW1.BP_EX_GhostMeshActor_XW1_C
/// Size: 0x0028 (0x000230 - 0x000258)
class ABP_EX_GhostMeshActor_XW1_C : public AGhostMeshActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0230   (0x0008)  
	float                                              ____0_EmissiveIntensity_59C4367449D7E7D5A74F0AA5D4EBAF34;   // 0x0238   (0x0004)  
	float                                              ____0_Ref_59C4367449D7E7D5A74F0AA5D4EBAF34;                 // 0x023C   (0x0004)  
	float                                              ____0_Erosion_59C4367449D7E7D5A74F0AA5D4EBAF34;             // 0x0240   (0x0004)  
	float                                              ____0_Intensity_59C4367449D7E7D5A74F0AA5D4EBAF34;           // 0x0244   (0x0004)  
	SDK_UNDEFINED(1,2888) /* TEnumAsByte<ETimelineDirection> */ __um(____0__Direction_59C4367449D7E7D5A74F0AA5D4EBAF34); // 0x0248   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0249   (0x0007)  MISSED
	class UTimelineComponent*                          _e_;                                                        // 0x0250   (0x0008)  


	/// Functions
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_XW1.BP_EX_GhostMeshActor_XW1_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_XW1.BP_EX_GhostMeshActor_XW1_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_XW1.BP_EX_GhostMeshActor_XW1_C.PostInitGhostMeshComp
	// void PostInitGhostMeshComp();                                                                                         // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_XW1.BP_EX_GhostMeshActor_XW1_C.ExecuteUbergraph_BP_EX_GhostMeshActor_XW1
	// void ExecuteUbergraph_BP_EX_GhostMeshActor_XW1(int32_t EntryPoint);                                                   // [0x15dd8c0] Final                
};

/// Class /Game/Effects/Env/Interact/Water_Screen/BP/BP_EX_Lens_ShuiDi.BP_EX_Lens_ShuiDi_C
/// Size: 0x0000 (0x0002E0 - 0x0002E0)
class ABP_EX_Lens_ShuiDi_C : public AEmitterCameraLensEffectBase
{ 
public:
};

/// Class /Game/Effects/Env/Interact/TestDecal/A_SnowDecal.A_SnowDecal_C
/// Size: 0x003C (0x000220 - 0x00025C)
class AA_SnowDecal_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UDecalComponent*                             DECAL;                                                      // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	float                                              ____0_Opacity_A2896C674273CDC16E6F49B0227E69CA;             // 0x0238   (0x0004)  
	SDK_UNDEFINED(1,2889) /* TEnumAsByte<ETimelineDirection> */ __um(____0__Direction_A2896C674273CDC16E6F49B0227E69CA); // 0x023C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x023D   (0x0003)  MISSED
	class UTimelineComponent*                          _e_;                                                        // 0x0240   (0x0008)  
	class UMaterialInterface*                          FootprintDecalMaterial;                                     // 0x0248   (0x0008)  
	int32_t                                            FootprintSortOrder;                                         // 0x0250   (0x0004)  
	float                                              FootprintOriginalOpacity;                                   // 0x0254   (0x0004)  
	float                                              TimeDelay;                                                  // 0x0258   (0x0004)  


	/// Functions
	// Function /Game/Effects/Env/Interact/TestDecal/A_SnowDecal.A_SnowDecal_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/Env/Interact/TestDecal/A_SnowDecal.A_SnowDecal_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/Env/Interact/TestDecal/A_SnowDecal.A_SnowDecal_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Effects/Env/Interact/TestDecal/A_SnowDecal.A_SnowDecal_C.ExecuteUbergraph_A_SnowDecal
	// void ExecuteUbergraph_A_SnowDecal(int32_t EntryPoint);                                                                // [0x15dd8c0] Final                
};

/// Class /Game/Effects/Skill/Player/Common/BP/B_EX_CS_XW_Attack_Medium.B_EX_CS_XW_Attack_Medium_C
/// Size: 0x0000 (0x000160 - 0x000160)
class UB_EX_CS_XW_Attack_Medium_C : public UCameraShake
{ 
public:
};

/// Class /Game/Effects/Skill/Player/Common/BP/B_EX_CS_YYY_Attack_Small.B_EX_CS_YYY_Attack_Small_C
/// Size: 0x0000 (0x000160 - 0x000160)
class UB_EX_CS_YYY_Attack_Small_C : public UCameraShake
{ 
public:
};

/// Class /Game/Effects/Skill/Player/Common/BP/B_EX_CS_XW_Attack_Small.B_EX_CS_XW_Attack_Small_C
/// Size: 0x0000 (0x000160 - 0x000160)
class UB_EX_CS_XW_Attack_Small_C : public UCameraShake
{ 
public:
};

/// Class /Game/Effects/Skill/Player/Common/BP/B_EX_CS_YYY_Attack_Medium.B_EX_CS_YYY_Attack_Medium_C
/// Size: 0x0000 (0x000160 - 0x000160)
class UB_EX_CS_YYY_Attack_Medium_C : public UCameraShake
{ 
public:
};

/// Class /Game/Effects/BP_FX/PPV/BP_EX_PP_Hit_RadialBlur.BP_EX_PP_Hit_RadialBlur_C
/// Size: 0x0000 (0x000760 - 0x000760)
class UBP_EX_PP_Hit_RadialBlur_C : public UPaladinPostProcess
{ 
public:
};

/// Class /Game/Effects/BP_FX/PPV/RadialBlur/BP_EX_PP_Skill_RadialBlur_Small.BP_EX_PP_Skill_RadialBlur_Small_C
/// Size: 0x0000 (0x000760 - 0x000760)
class UBP_EX_PP_Skill_RadialBlur_Small_C : public UPaladinPostProcess
{ 
public:
};

/// Class /Game/Effects/BP_FX/PPV/RadialBlur/BP_EX_PP_Skill_RadialBlur_Mudium.BP_EX_PP_Skill_RadialBlur_Mudium_C
/// Size: 0x0000 (0x000760 - 0x000760)
class UBP_EX_PP_Skill_RadialBlur_Mudium_C : public UPaladinPostProcess
{ 
public:
};

/// Class /Game/Effects/BP_FX/PPV/Backup/Backup_BP_EX_PP_Hit_RadialBlur.Backup_BP_EX_PP_Hit_RadialBlur_C
/// Size: 0x0000 (0x000760 - 0x000760)
class UBackup_BP_EX_PP_Hit_RadialBlur_C : public UPaladinPostProcess
{ 
public:
};

/// Class /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_YYY.BP_EX_GhostMeshActor_YYY_C
/// Size: 0x0028 (0x000230 - 0x000258)
class ABP_EX_GhostMeshActor_YYY_C : public AGhostMeshActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0230   (0x0008)  
	float                                              ____0_EmissiveIntensity_4138F74340AC66B22D651DB13ECC0747;   // 0x0238   (0x0004)  
	float                                              ____0_Ref_4138F74340AC66B22D651DB13ECC0747;                 // 0x023C   (0x0004)  
	float                                              ____0_Erosion_4138F74340AC66B22D651DB13ECC0747;             // 0x0240   (0x0004)  
	float                                              ____0_Intensity_4138F74340AC66B22D651DB13ECC0747;           // 0x0244   (0x0004)  
	SDK_UNDEFINED(1,2890) /* TEnumAsByte<ETimelineDirection> */ __um(____0__Direction_4138F74340AC66B22D651DB13ECC0747); // 0x0248   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0249   (0x0007)  MISSED
	class UTimelineComponent*                          _e_;                                                        // 0x0250   (0x0008)  


	/// Functions
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_YYY.BP_EX_GhostMeshActor_YYY_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_YYY.BP_EX_GhostMeshActor_YYY_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_YYY.BP_EX_GhostMeshActor_YYY_C.PostInitGhostMeshComp
	// void PostInitGhostMeshComp();                                                                                         // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor_YYY.BP_EX_GhostMeshActor_YYY_C.ExecuteUbergraph_BP_EX_GhostMeshActor_YYY
	// void ExecuteUbergraph_BP_EX_GhostMeshActor_YYY(int32_t EntryPoint);                                                   // [0x15dd8c0] Final                
};

/// Class /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor.BP_EX_GhostMeshActor_C
/// Size: 0x0028 (0x000230 - 0x000258)
class ABP_EX_GhostMeshActor_C : public AGhostMeshActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0230   (0x0008)  
	float                                              ____0_EmissiveIntensity_B97193F648E4836DC3A895A59154B469;   // 0x0238   (0x0004)  
	float                                              ____0_Ref_B97193F648E4836DC3A895A59154B469;                 // 0x023C   (0x0004)  
	float                                              ____0_Erosion_B97193F648E4836DC3A895A59154B469;             // 0x0240   (0x0004)  
	float                                              ____0_Intensity_B97193F648E4836DC3A895A59154B469;           // 0x0244   (0x0004)  
	SDK_UNDEFINED(1,2891) /* TEnumAsByte<ETimelineDirection> */ __um(____0__Direction_B97193F648E4836DC3A895A59154B469); // 0x0248   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0249   (0x0007)  MISSED
	class UTimelineComponent*                          _e_;                                                        // 0x0250   (0x0008)  


	/// Functions
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor.BP_EX_GhostMeshActor_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor.BP_EX_GhostMeshActor_C.ˆeÙïtè_
	// void ˆeÙïtè_();                                                                                                       // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Effects/BP_FX/GhostMesh/BP_EX_GhostMeshActor.BP_EX_GhostMeshActor_C.PostInitGhostMeshComp
	// void PostInitGhostMeshComp();                                                                                         // [0x15dd8c0] Event|Public|BlueprintEvent 
