
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: ActorSequence
/// dependency: AIModule
/// dependency: AnimGraphRuntime
/// dependency: CoreUObject
/// dependency: CriWareRuntime
/// dependency: Engine
/// dependency: GameplayAbilities
/// dependency: GameplayTags
/// dependency: InputCore
/// dependency: KantanChartsUMG
/// dependency: LevelSequence
/// dependency: NavigationSystem
/// dependency: Pal7
/// dependency: Paper2D
/// dependency: PathFollow
/// dependency: SlateCore
/// dependency: UMG

/// Enum /Game/Blueprint/BP_RTX/Enum_RT_Quality_Preset.Enum_RT_Quality_Preset
/// Size: 0x09
enum class Enum_RT_Quality_Preset : uint8_t
{
	Enum_RT_Quality_Preset__NewEnumerator1                                           = 0,
	Enum_RT_Quality_Preset__NewEnumerator0                                           = 1,
	Enum_RT_Quality_Preset__NewEnumerator6                                           = 2,
	Enum_RT_Quality_Preset__NewEnumerator4                                           = 3,
	Enum_RT_Quality_Preset__NewEnumerator7                                           = 4,
	Enum_RT_Quality_Preset__NewEnumerator2                                           = 5,
	Enum_RT_Quality_Preset__NewEnumerator5                                           = 6,
	Enum_RT_Quality_Preset__NewEnumerator3                                           = 7,
	Enum_RT_Quality_Preset__Enum_RT_Quality_MAX                                      = 8
};

/// Enum /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BuoyancyShape.BuoyancyShape
/// Size: 0x04
enum class BuoyancyShape : uint8_t
{
	BuoyancyShape__NewEnumerator0                                                    = 0,
	BuoyancyShape__NewEnumerator1                                                    = 1,
	BuoyancyShape__NewEnumerator2                                                    = 2,
	BuoyancyShape__BuoyancyShape_MAX                                                 = 3
};

/// Enum /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/E_CharacterName.E_CharacterName
/// Size: 0x05
enum class E_CharacterName : uint8_t
{
	E_CharacterName__NewEnumerator1                                                  = 0,
	E_CharacterName__NewEnumerator0                                                  = 1,
	E_CharacterName__NewEnumerator3                                                  = 2,
	E_CharacterName__NewEnumerator2                                                  = 3,
	E_CharacterName__E_MAX                                                           = 4
};

/// Enum /Game/PreViewContent/Camera/EPaladinPlayerState.EPaladinPlayerState
/// Size: 0x04
enum class EPaladinPlayerState : uint8_t
{
	EPaladinPlayerState__NewEnumerator0                                              = 0,
	EPaladinPlayerState__NewEnumerator1                                              = 1,
	EPaladinPlayerState__NewEnumerator2                                              = 2,
	EPaladinPlayerState__EPaladinPlayerState_MAX                                     = 3
};

/// Enum /Game/PreViewContent/AIPartner/AI/PartnerState.PartnerState
/// Size: 0x05
enum class PartnerState : uint8_t
{
	PartnerState__NewEnumerator1                                                     = 0,
	PartnerState__NewEnumerator2                                                     = 1,
	PartnerState__NewEnumerator3                                                     = 2,
	PartnerState__NewEnumerator7                                                     = 3,
	PartnerState__PartnerState_MAX                                                   = 4
};

/// Enum /Game/PreViewContent/Monster/AI/NormalMonsterAI/NormalEnemyState.NormalEnemyState
/// Size: 0x07
enum class NormalEnemyState : uint8_t
{
	NormalEnemyState__NewEnumerator0                                                 = 0,
	NormalEnemyState__NewEnumerator1                                                 = 1,
	NormalEnemyState__NewEnumerator2                                                 = 2,
	NormalEnemyState__NewEnumerator4                                                 = 3,
	NormalEnemyState__NewEnumerator3                                                 = 4,
	NormalEnemyState__NewEnumerator5                                                 = 5,
	NormalEnemyState__NormalEnemyState_MAX                                           = 6
};

/// Enum /Game/PreViewContent/BasicRules/Blueprint/MovementState.MovementState
/// Size: 0x04
enum class MovementState : uint8_t
{
	MovementState__NewEnumerator0                                                    = 0,
	MovementState__NewEnumerator1                                                    = 1,
	MovementState__NewEnumerator2                                                    = 2,
	MovementState__MovementState_MAX                                                 = 3
};

/// Enum /Game/PreViewContent/QuestTest/NPC/Enum/Enum_NPC_ActionModeReason.Enum_NPC_ActionModeReason
/// Size: 0x05
enum class Enum_NPC_ActionModeReason : uint8_t
{
	Enum_NPC_ActionModeReason__NewEnumerator0                                        = 0,
	Enum_NPC_ActionModeReason__NewEnumerator1                                        = 1,
	Enum_NPC_ActionModeReason__NewEnumerator2                                        = 2,
	Enum_NPC_ActionModeReason__NewEnumerator3                                        = 3,
	Enum_NPC_ActionModeReason__Enum_NPC_MAX                                          = 4
};

/// Enum /Game/PreViewContent/Monster/Common/PatrolNode/PatrolActionType.PatrolActionType
/// Size: 0x06
enum class PatrolActionType : uint8_t
{
	PatrolActionType__NewEnumerator0                                                 = 0,
	PatrolActionType__NewEnumerator1                                                 = 1,
	PatrolActionType__NewEnumerator2                                                 = 2,
	PatrolActionType__NewEnumerator3                                                 = 3,
	PatrolActionType__NewEnumerator4                                                 = 4,
	PatrolActionType__PatrolActionType_MAX                                           = 5
};

/// Enum /Game/PreViewContent/QuestTest/NPC/NPCStateEnum.NPCStateEnum
/// Size: 0x07
enum class NPCStateEnum : uint8_t
{
	NPCStateEnum__NewEnumerator0                                                     = 0,
	NPCStateEnum__NewEnumerator5                                                     = 1,
	NPCStateEnum__NewEnumerator1                                                     = 2,
	NPCStateEnum__NewEnumerator11                                                    = 3,
	NPCStateEnum__NewEnumerator3                                                     = 4,
	NPCStateEnum__NewEnumerator2                                                     = 5,
	NPCStateEnum__NPCStateEnum_MAX                                                   = 6
};

/// Enum /Game/UI/UMG/TradeType.TradeType
/// Size: 0x05
enum class TradeType : uint8_t
{
	TradeType__NewEnumerator0                                                        = 0,
	TradeType__NewEnumerator1                                                        = 1,
	TradeType__NewEnumerator2                                                        = 2,
	TradeType__NewEnumerator3                                                        = 3,
	TradeType__TradeType_MAX                                                         = 4
};

/// Enum /Game/UI/UMG/BigMap/Enum/Enum_BigMap_CursorState.Enum_BigMap_CursorState
/// Size: 0x04
enum class Enum_BigMap_CursorState : uint8_t
{
	Enum_BigMap_CursorState__NewEnumerator0                                          = 0,
	Enum_BigMap_CursorState__NewEnumerator1                                          = 1,
	Enum_BigMap_CursorState__NewEnumerator2                                          = 2,
	Enum_BigMap_CursorState__Enum_BigMap_MAX                                         = 3
};

/// Enum /Game/UI/UMG/Cook/FoodDishMaterial.FoodDishMaterial
/// Size: 0x06
enum class FoodDishMaterial : uint8_t
{
	FoodDishMaterial__NewEnumerator1                                                 = 0,
	FoodDishMaterial__NewEnumerator0                                                 = 1,
	FoodDishMaterial__NewEnumerator8                                                 = 2,
	FoodDishMaterial__NewEnumerator10                                                = 3,
	FoodDishMaterial__NewEnumerator11                                                = 4,
	FoodDishMaterial__FoodDishMaterial_MAX                                           = 5
};

/// Enum /Game/Designer/Tools/BattleFieldBlockWall/EBlockWallShape.EBlockWallShape
/// Size: 0x08
enum class EBlockWallShape : uint8_t
{
	EBlockWallShape__NewEnumerator0                                                  = 0,
	EBlockWallShape__NewEnumerator1                                                  = 1,
	EBlockWallShape__NewEnumerator3                                                  = 2,
	EBlockWallShape__NewEnumerator4                                                  = 3,
	EBlockWallShape__NewEnumerator5                                                  = 4,
	EBlockWallShape__NewEnumerator6                                                  = 5,
	EBlockWallShape__NewEnumerator7                                                  = 6,
	EBlockWallShape__EBlockWallShape_MAX                                             = 7
};

/// Class /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/seashore/BP_jiaoyin.BP_jiaoyin_C
/// Size: 0x0038 (0x000220 - 0x000258)
class ABP_jiaoyin_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UDecalComponent*                             DECAL;                                                      // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	float                                              Timeline_0_NewTrack_0_D85EA8444FFB60F09E5081B22CD51567;     // 0x0238   (0x0004)  
	SDK_UNDEFINED(1,2118) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_0__Direction_D85EA8444FFB60F09E5081B22CD51567); // 0x023C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x023D   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x0240   (0x0008)  
	bool                                               RL;                                                         // 0x0248   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0249   (0x0007)  MISSED
	class UMaterialInstanceDynamic*                    Material;                                                   // 0x0250   (0x0008)  


	/// Functions
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/seashore/BP_jiaoyin.BP_jiaoyin_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                      // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/seashore/BP_jiaoyin.BP_jiaoyin_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                        // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/seashore/BP_jiaoyin.BP_jiaoyin_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/seashore/BP_jiaoyin.BP_jiaoyin_C.ExecuteUbergraph_BP_jiaoyin
	// void ExecuteUbergraph_BP_jiaoyin(int32_t EntryPoint);                                                                 // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C
/// Size: 0x0078 (0x0000B0 - 0x000128)
class UBP_getFootPosition_1_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00B0   (0x0008)  
	FVector2D                                          OldPosition;                                                // 0x00B8   (0x0008)  
	class ABP_grassInteractive_1_C*                    BP_grassInteractive;                                        // 0x00C0   (0x0008)  
	FName                                              footSocket01;                                               // 0x00C8   (0x0008)  
	FName                                              footSocket02;                                               // 0x00D0   (0x0008)  
	bool                                               isLeaderConnect;                                            // 0x00D8   (0x0001)  
	bool                                               stopClearRT;                                                // 0x00D9   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x00DA   (0x0006)  MISSED
	FTimerHandle                                       timerFindSocket;                                            // 0x00E0   (0x0008)  
	FTimerHandle                                       getFootTimeHandle;                                          // 0x00E8   (0x0008)  
	bool                                               BindFootDown;                                               // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00F1   (0x0003)  MISSED
	float                                              feetScale;                                                  // 0x00F4   (0x0004)  
	bool                                               BindFootDownspary;                                          // 0x00F8   (0x0001)  
	bool                                               isDieConnect;                                               // 0x00F9   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x00FA   (0x0006)  MISSED
	SDK_UNDEFINED(40,2119) /* TWeakObjectPtr<UParticleSystem*> */ __um(SprayChar);                                 // 0x0100   (0x0028)  


	/// Functions
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.GetAllGrassInstances
	// void GetAllGrassInstances();                                                                                          // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.OnLoaded_1AF4DE3E46C821422FBA2BBDEC4BE468
	// void OnLoaded_1AF4DE3E46C821422FBA2BBDEC4BE468(class UObject* Loaded);                                                // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.OnLoaded_55354F924A0E0044A516A5B417CADEC4
	// void OnLoaded_55354F924A0E0044A516A5B417CADEC4(class UObject* Loaded);                                                // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.OnLevelLoadingDone_Event
	// void OnLevelLoadingDone_Event(FName LevelID);                                                                         // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.FindSocket
	// void FindSocket();                                                                                                    // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.getGrassInteractive
	// void getGrassInteractive();                                                                                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.OnSwitchHeroBPDelegate_Event
	// void OnSwitchHeroBPDelegate_Event(class APaladinHero* SwitchFromHero, class APaladinHero* SwitchToHero);              // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.getFoot
	// void getFoot();                                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.heroRes
	// void heroRes();                                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.heroDie
	// void heroDie();                                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                       // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.sandfoot
	// void sandfoot(FHitResult LineHitResult, EFoot FootRotator);                                                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.spray
	// void spray(FHitResult LineHitResult, EFoot FootRotator);                                                              // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.teamChange
	// void teamChange();                                                                                                    // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.OnTeamQueueChange_Event
	// void OnTeamQueueChange_Event();                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.getFootPostion
	// void getFootPostion();                                                                                                // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_getFootPosition.BP_getFootPosition_1_C.ExecuteUbergraph_BP_getFootPosition
	// void ExecuteUbergraph_BP_getFootPosition(int32_t EntryPoint);                                                         // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C
/// Size: 0x00E8 (0x000220 - 0x000308)
class ABP_grassInteractive_1_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        capture02;                                                  // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        capture01;                                                  // 0x0230   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0238   (0x0008)  
	float                                              StopMovingdrawRT_NewTrack_0_73AD2BBD47883874325EDAB717B8D392; // 0x0240   (0x0004)  
	SDK_UNDEFINED(1,2120) /* TEnumAsByte<ETimelineDirection> */ __um(StopMovingdrawRT__Direction_73AD2BBD47883874325EDAB717B8D392); // 0x0244   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0245   (0x0003)  MISSED
	class UTimelineComponent*                          StopMovingdrawRT;                                           // 0x0248   (0x0008)  
	int32_t                                            capturePositionIndex;                                       // 0x0250   (0x0004)  
	bool                                               openSetCaptureNewPosition;                                  // 0x0254   (0x0001)  
	bool                                               beginDrawRT02;                                              // 0x0255   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0256   (0x0002)  MISSED
	float                                              moveDistanceBranch;                                         // 0x0258   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x025C   (0x0004)  MISSED
	class UMaterialInstanceDynamic*                    M_drawRT;                                                   // 0x0260   (0x0008)  
	SDK_UNDEFINED(16,2121) /* TArray<FString> */       __um(gassInterative_element);                               // 0x0268   (0x0010)  
	float                                              initAppearIntensity;                                        // 0x0278   (0x0004)  
	bool                                               Stand_Mask;                                                 // 0x027C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x027D   (0x0003)  MISSED
	float                                              Stand_AppearSpeed;                                          // 0x0280   (0x0004)  
	float                                              DisappearSpeed;                                             // 0x0284   (0x0004)  
	float                                              DisappearStopMoveTimeLength;                                // 0x0288   (0x0004)  
	float                                              footEffectRange;                                            // 0x028C   (0x0004)  
	float                                              grassDropDepth;                                             // 0x0290   (0x0004)  
	bool                                               printFoliageName;                                           // 0x0294   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0295   (0x0003)  MISSED
	FVector                                            samplingTargetPosition;                                     // 0x0298   (0x000C)  
	bool                                               useSequceneActorPosition;                                   // 0x02A4   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x02A5   (0x0003)  MISSED
	TArray<FVector>                                    FootTrail;                                                  // 0x02A8   (0x0010)  
	class UStaticMeshComponent*                        currentCapture;                                             // 0x02B8   (0x0008)  
	bool                                               clearAllRT;                                                 // 0x02C0   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x02C1   (0x0007)  MISSED
	FTimerHandle                                       findHeroLeader;                                             // 0x02C8   (0x0008)  
	float                                              footEffectRange_sequence;                                   // 0x02D0   (0x0004)  
	float                                              initAppearIntensity_sequence;                               // 0x02D4   (0x0004)  
	SDK_UNDEFINED(16,2122) /* TArray<FString> */       __um(seaShoreInterative);                                   // 0x02D8   (0x0010)  
	SDK_UNDEFINED(16,2123) /* TArray<FString> */       __um(physicalMaterialInterative);                           // 0x02E8   (0x0010)  
	SDK_UNDEFINED(16,2124) /* TArray<FString> */       __um(sprayInterative);                                      // 0x02F8   (0x0010)  


	/// Functions
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.StopMovingdrawRT__FinishedFunc
	// void StopMovingdrawRT__FinishedFunc();                                                                                // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.StopMovingdrawRT__UpdateFunc
	// void StopMovingdrawRT__UpdateFunc();                                                                                  // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.CustomTick
	// void CustomTick();                                                                                                    // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.OnLevelLoadingDone_Event
	// void OnLevelLoadingDone_Event(FName LevelID);                                                                         // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.sequenceEffectRange
	// void sequenceEffectRange(float initAppearIntensity_sequence, float footEffectRange_sequence, bool useSequceneActorPosition); // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                       // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GrassInteraction_01/BP_grassInteractive.BP_grassInteractive_1_C.ExecuteUbergraph_BP_grassInteractive
	// void ExecuteUbergraph_BP_grassInteractive(int32_t EntryPoint);                                                        // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/DestructableItem/IDestructable.IDestructable_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UIDestructable_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Blueprint/DestructableItem/IDestructable.IDestructable_C.IsBroken
	// void IsBroken(bool& Broken?);                                                                                         // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/DestructableItem/IDestructable.IDestructable_C.BrokeDestructable
	// void BrokeDestructable(FVector HitLoc, FVector HitNormal, float Strength, class AActor* Instigator);                  // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/AO_Parameters.AO_Parameters
/// Size: 0x0050 (0x000000 - 0x000050)
struct FAO_Parameters
{ 
	SDK_UNDEFINED(16,2125) /* FString */               __um(EnableAO_4_402B20584E745E3C12F1B7AF7AA87854);          // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2126) /* FString */               __um(AOEnableMaterial_5_CC7E87EA478E0E374391B688FD73F056);  // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2127) /* FString */               __um(AOEnableTwoSideGeometry_6_C6D7C81641885C9241D31F8F7FDB1BFD); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2128) /* FString */               __um(AOSPP_10_2666C0F2490AC980438465B1B37CDDDC);            // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2129) /* FString */               __um(AODenoiserHistoryConvolutionSampleCount_13_50EF88A94EC31AFC5F939FA82C735B40); // 0x0040   (0x0010)  
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/Debug_Parameters.Debug_Parameters
/// Size: 0x0138 (0x000000 - 0x000138)
struct FDebug_Parameters
{ 
	SDK_UNDEFINED(16,2130) /* FString */               __um(NormalBias_15_8A32C7694BB9E814F5B79080A92D92FF);       // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2131) /* FString */               __um(DebugForceOpaque_16_C804BF5D4DD6036507DFF789796FA3D2); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2132) /* FString */               __um(DebugForceFullBuild_17_6FDE0EFC4C1DDE4558BFADAFC250953A); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2133) /* FString */               __um(DebugDisableTriangleCull_18_F6A8E355470D11CB81EAB8B19AC1C7A6); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2134) /* FString */               __um(DebugForceBuildMode_19_AB2BFAEB44E7BB8A8D5CCA99F330B428); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2135) /* FString */               __um(EnableReflectionDenoiser_20_12D307E54569217835508CB0D10A7977); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2136) /* FString */               __um(EnableShadowDenoiser_21_66089741487B775E6A06E499B3D14354); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2137) /* FString */               __um(EnableGIDenoiser_22_048015BE4ECE190E94DAC98FC43DBFBC); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2138) /* FString */               __um(ReflectionEnableMaterials_23_49932A5A461504BB59F75CB217B2162E); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2139) /* FString */               __um(EnableShaderCache_24_91CAA4D2402AA03FE3367E863E697898); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2140) /* FString */               __um(RTXSwitch_26_CF19681044E915DF3EE1B7A42E9CE572);        // 0x00A0   (0x0010)  
	float                                              UseShaderWPO_32_EF11C3E64B117CFB7C16B0BAA7F5A01D;           // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00B4   (0x0004)  MISSED
	SDK_UNDEFINED(16,2141) /* FString */               __um(RTParallelGather_41_DD9B821743F54A691D43C8A24A9BE556); // 0x00B8   (0x0010)  
	SDK_UNDEFINED(16,2142) /* FString */               __um(RTLateInit_44_BDEEC918403656B6270A94A80C0DE5DB);       // 0x00C8   (0x0010)  
	SDK_UNDEFINED(16,2143) /* FString */               __um(OcclusionCullDirection_45_2E85EA63429993A11953CE9E1F6774ED); // 0x00D8   (0x0010)  
	SDK_UNDEFINED(16,2144) /* FString */               __um(ParallelMeshBatchSetup_56_86CA6095450FFE588738FC85344DC2FD); // 0x00E8   (0x0010)  
	SDK_UNDEFINED(16,2145) /* FString */               __um(BatchMaterials_57_ED68CBEF4934516852BC45B44504F0C1);   // 0x00F8   (0x0010)  
	SDK_UNDEFINED(16,2146) /* FString */               __um(RemoveInvisibleBLAS_85_24D60A1644F4803427C4C892BBF012F8); // 0x0108   (0x0010)  
	SDK_UNDEFINED(16,2147) /* FString */               __um(GeometryMaxBuiltPrimitivesPerFrame_88_8E4211A54DC72EAB732F23B616DA82CD); // 0x0118   (0x0010)  
	bool                                               EnableTick_66_9766B551429C78A43A3FEA96490E23C7;             // 0x0128   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0129   (0x0003)  MISSED
	float                                              TickInterval_73_3FBE885244BABA90DB3F61BFA711388D;           // 0x012C   (0x0004)  
	float                                              PlayerCurrentVelocity_78_5990762343CF497EDEC37C987BF11F1B;  // 0x0130   (0x0004)  
	float                                              PlayerMaxVelocityThreshold_79_662354E44F40A0D6CEB322AF112A1F30; // 0x0134   (0x0004)  
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/GI_Parameters.GI_Parameters
/// Size: 0x01F0 (0x000000 - 0x0001F0)
struct FGI_Parameters
{ 
	SDK_UNDEFINED(16,2148) /* FString */               __um(GItype_13_FEFC00D7428DF3F2EA0F9097A9353822);           // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2149) /* FString */               __um(GIMaxBounce_14_9C271AFE40D4E53E4469F8A0B0726358);      // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2150) /* FString */               __um(GIMaxRayDistance_15_AD8A4E9844AE373D5012FB9DACC25082); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2151) /* FString */               __um(GISPP_16_1CA01D6E4CD423E3952E13A05D8EDCF5);            // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2152) /* FString */               __um(GIScreenPercentage_17_51DD44EE4074DBDCF36076B79D47F981); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2153) /* FString */               __um(GIUseRussianRoulette_18_03B4F71A41F8B1991B5C9093866E7C8D); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2154) /* FString */               __um(GIDiffuseThreshold_19_4C91F5304F3E0F86F2DE64BE0555EBFC); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2155) /* FString */               __um(GISortMaterials_21_FB1F0EBB431301AE76B7CEB2D0B466E8);  // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2156) /* FString */               __um(GIEnableTwoSidedGeometry_22_F38481B04AA8C5C6C1B93087D28F17CE); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2157) /* FString */               __um(FinalGatherDistance_23_06E7E9F0467A1E30FB9C0989EBD3E956); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2158) /* FString */               __um(GIMaxLightCount_26_5B5538634898D5C09E00E0B76188BF5D);  // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2159) /* FString */               __um(GIDenoiserType_32_B2E8F2D04E72BB68627D6EBCA107C472);   // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2160) /* FString */               __um(GIApplyAO_33_1BA016C145BE87B51CFBDDBEB7FBEE0D);        // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,2161) /* FString */               __um(GIDenoiserColorClamp_34_116D4CA9441D9B54F1CC09A4773FC856); // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,2162) /* FString */               __um(GIDenoiserNormalTolerance_35_B6026F734DEA82ADC79D678F82ED05EA); // 0x00E0   (0x0010)  
	SDK_UNDEFINED(16,2163) /* FString */               __um(GIDenoiseHistoryLength_41_6444C26341627DFA45693FBF3E6C18CF); // 0x00F0   (0x0010)  
	SDK_UNDEFINED(16,2164) /* FString */               __um(SpatialNormalTolerance_38_90A4369D46760D1D3D12B1B90AC93BB2); // 0x0100   (0x0010)  
	SDK_UNDEFINED(16,2165) /* FString */               __um(SpatialFilterIteration_44_43991F984232FCDF0F486A8122EC4EE5); // 0x0110   (0x0010)  
	SDK_UNDEFINED(16,2166) /* FString */               __um(GIDiffuseBoost_47_206FAADE4EB4EB482502AFBADB7283BC);   // 0x0120   (0x0010)  
	SDK_UNDEFINED(16,2167) /* FString */               __um(FinalGatherUseReservoirResampling_51_B645C5324122AF3297A88BA441BBF97D); // 0x0130   (0x0010)  
	SDK_UNDEFINED(16,2168) /* FString */               __um(GIMetalicSupport_54_E529B8F747A267DC767E098206DB5CC4); // 0x0140   (0x0010)  
	SDK_UNDEFINED(16,2169) /* FString */               __um(GIDenoiserSpatialFilterType_57_35EDA4DA4FDAE461034E11A329D5FCE1); // 0x0150   (0x0010)  
	SDK_UNDEFINED(16,2170) /* FString */               __um(GIDenoiserUseSH_62_6A8CFE524B495BB040710BA60BBD39E0);  // 0x0160   (0x0010)  
	SDK_UNDEFINED(16,2171) /* FString */               __um(GIDenoiserSHSharpness_61_E2DE071B4E3C5411289FF0AC4D8A8D41); // 0x0170   (0x0010)  
	SDK_UNDEFINED(16,2172) /* FString */               __um(ATrousDepthTolerance_65_1759F98545A1EAAC4D34079C5EF23FAB); // 0x0180   (0x0010)  
	SDK_UNDEFINED(16,2173) /* FString */               __um(GIDenoiseATrousFilterWidth_69_05A595CB4F95460F438B898F91240FAA); // 0x0190   (0x0010)  
	SDK_UNDEFINED(16,2174) /* FString */               __um(FinalGatherReservoirUpdateInterval_70_E85A49C34E6EB05F3F47148E2E0C20B6); // 0x01A0   (0x0010)  
	SDK_UNDEFINED(16,2175) /* FString */               __um(FinalGatherMaxReuseWeight_75_B2B1DAD349F38466714BB7A6FBBF3C94); // 0x01B0   (0x0010)  
	SDK_UNDEFINED(16,2176) /* FString */               __um(FinalGatherAggressiveReservoirReuse_76_4E3F0392461CB5DBFC70EDA6F3408A36); // 0x01C0   (0x0010)  
	SDK_UNDEFINED(16,2177) /* FString */               __um(FinalGatherNormalFromDepth_77_90A15BD64C60324A840D4998637CF62D); // 0x01D0   (0x0010)  
	SDK_UNDEFINED(16,2178) /* FString */               __um(MultiBounceInterval_81_C4133BFD4FAFC02AD572EBB452EE5FD4); // 0x01E0   (0x0010)  
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/LandscapeAndFoliage_Parameter.LandscapeAndFoliage_Parameter
/// Size: 0x00D8 (0x000000 - 0x0000D8)
struct FLandscapeAndFoliage_Parameter
{ 
	SDK_UNDEFINED(16,2179) /* FString */               __um(EnableLandscapeDetectTextureStreaming_8_34CD37624CF32D930CE49B8AE1EDF932); // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2180) /* FString */               __um(EnableLandscapeLODUpdateEveryFrame_9_5FA37320403A8777FE4A8FA2225C2F81); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2181) /* FString */               __um(EnableInstancedStaticMesh_10_F759681E42E05A6B2AC9FEA6EE2E717F); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2182) /* FString */               __um(EnableInstancedStaticMeshesCulling_11_DB7739364F5EED0508F78483F32D333D); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2183) /* FString */               __um(InstancedStaticMeshesCullingRadius_12_790EF6C34AB6F7B443A365B703D17049); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2184) /* FString */               __um(EnableLandscapeInRT_13_EB1398FC4CE59D76E6A49B9D289BA6A2); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2185) /* FString */               __um(InstancedStaticMeshesCullingAngle_16_6EB44C0E474474F85AD359B7B8A0B9BC); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2186) /* FString */               __um(InstancedStaticMeshesEvaluateWPO_22_3E0D1EF54BCDB5B2D1E1A48429415469); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2187) /* FString */               __um(InstancedStaticMeshesSimulationCount_23_3F44BC814B40CF9EB483F2A9D063BB0A); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2188) /* FString */               __um(ShadowUseBiasForSkipWPOEval_24_EE03629D4D672D9F32340FBB0ED1F0A9); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2189) /* FString */               __um(ShadowMaxBiasForInexactGeometry_25_50FA131B48D2AEE0BE24A1AAEBCC1205); // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2190) /* FString */               __um(AOUseBiasForSkipWPOEval_29_5636E2784981F95A67DD4DBB73FC4467); // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2191) /* FString */               __um(AOMaxBiasForInexactGeometry_30_DA538B3B4CD457335D45F693AA9F32CE); // 0x00C0   (0x0010)  
	bool                                               EnableAdaptiveISMRender_33_16D611EC4B36B0112DDD11B6FCE8D29C; // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00D1   (0x0007)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/Reflection_Parameters.Reflection_Parameters
/// Size: 0x0180 (0x000000 - 0x000180)
struct FReflection_Parameters
{ 
	SDK_UNDEFINED(16,2192) /* FString */               __um(EnableReflection_13_F507403D4F7A1CD01010E9A6F04587D1); // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2193) /* FString */               __um(EnableHeightFoginReflection_14_55A2CFFF4743A2FC0CC28AA5CADADFE3); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2194) /* FString */               __um(ReflectionSortMaterials_15_F69BD15C43B20A76600613BAD71A11DA); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2195) /* FString */               __um(EnableReflectionShadow_16_5CE4011344B44695A51F5DBB57926695); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2196) /* FString */               __um(ReflectionMaxRoughness_17_094F87434A4CA2EF78446385751DA11D); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2197) /* FString */               __um(ReflectionScreenPercentage_18_872B98A040695DB673733C87B039D4B0); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2198) /* FString */               __um(ReflectionMaxRayDistance_19_A0E3D15745EF03C12C73608BB897FCE5); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2199) /* FString */               __um(ReflectionMinRayDistance_20_6D12EE6E48A718B502DB929484EDBBD6); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2200) /* FString */               __um(ReflectionMaxBounces_21_81B8DA514D86E8694A43E79814041786); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2201) /* FString */               __um(RTEnableReflectionCapture_23_8F28E19F49F2BCB9FBAA08B7A899CAB2); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2202) /* FString */               __um(EnableReflectionTestRoughness_24_0883B4184EE12DA29A43128E2D24FB4F); // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2203) /* FString */               __um(ReflectionUseUnrollSampling_25_63342FE64D2759F0A072E992588DDE8D); // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2204) /* FString */               __um(ReflectionsRoughnessMultiplier_28_2DEC260341D957BF835DF89E8D4C715D); // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,2205) /* FString */               __um(HybridReflection_29_A64910B440FDB3B211D60DA855E15843); // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,2206) /* FString */               __um(ReflectedTranslucencyMode_34_E9B43ED24B20AF57BCCD4B82D4074935); // 0x00E0   (0x0010)  
	SDK_UNDEFINED(16,2207) /* FString */               __um(ReflectedTranslucencyMaxBounces_35_30526005497114ACA32D4CA9E09190A3); // 0x00F0   (0x0010)  
	SDK_UNDEFINED(16,2208) /* FString */               __um(ReflectedTranslucencyTransmissionThreshold_37_BBC1DF1646E5DD7F79B8F5B29C5CDBB3); // 0x0100   (0x0010)  
	SDK_UNDEFINED(16,2209) /* FString */               __um(MaxUnderCoatBounces_62_2FB4B6AA40635EF118D65FAA181EAE33); // 0x0110   (0x0010)  
	float                                              AdaptiveScreenResFactor_51_9DAA84584A4F1B5AD86D1096BF4F4C03; // 0x0120   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0124   (0x0004)  MISSED
	SDK_UNDEFINED(16,2210) /* FString */               __um(EnableGIinReflection_68_41EB535543E1AFD2E36B85A7BCFEB739); // 0x0128   (0x0010)  
	SDK_UNDEFINED(16,2211) /* FString */               __um(ReflectionGIDenoise_69_5F8C243E43BF0B5639CC639C28A363A5); // 0x0138   (0x0010)  
	SDK_UNDEFINED(16,2212) /* FString */               __um(ReflectionGIDenoisFilterWidth_70_4D4F1D4C47E134A28F3AF2A2822DD047); // 0x0148   (0x0010)  
	SDK_UNDEFINED(16,2213) /* FString */               __um(ReflectionRestirGI_71_E353A54440E814CF7DBA89B4EABFC74E); // 0x0158   (0x0010)  
	SDK_UNDEFINED(16,2214) /* FString */               __um(ReflectionGIScreenPercentage_73_76E4BE9B466BC717BC551D95AB055828); // 0x0168   (0x0010)  
	bool                                               EnableAdaptiveScreenResBasedonSceneUIRes_58_BC69F5D04C472C8B0B87409A161A8CF0; // 0x0178   (0x0001)  
	bool                                               EnableAdaptiveReflectionResBasedonspeed_57_566E5495490D1F20499022B5033ADC28; // 0x0179   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x017A   (0x0006)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/Shadow_Parameters.Shadow_Parameters
/// Size: 0x0170 (0x000000 - 0x000170)
struct FShadow_Parameters
{ 
	SDK_UNDEFINED(16,2215) /* FString */               __um(EnableShadow_16_42E314114DF52DDA1F746998967D0D69);     // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2216) /* FString */               __um(EvaluateMaterialsinShadow_17_728A35714A2D2CE2BB782C87F8EDF254); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2217) /* FString */               __um(ShadowEnableTwoSidedGeometry_18_E4F0F479419BF5462B8CA386C52019CC); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2218) /* FString */               __um(ShadowSPP_19_222F23EF4151A938C7D877B0D90F3255);        // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2219) /* FString */               __um(ShadowMaxBatchSize_20_09D0D43240AC1FBF762B93B6F820E785); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2220) /* FString */               __um(ShadowDenoiserMaxBatchSize_21_A4511D17403925B727BEE6BE72A868F8); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2221) /* FString */               __um(LightingMaxLights_42_643709A54544E52A183ECDAA837B3061); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2222) /* FString */               __um(LightingMaxShadowLights_44_75FCFFF242CF12D287843C9E5CDF62FC); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2223) /* FString */               __um(ShadowMaxLights_43_716E70A946B8BBDF783446AB9ABA3D59);  // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2224) /* FString */               __um(ShadowMaxDenoisedLights_45_4EDE192249341D55A1E221B3B183F92B); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2225) /* FString */               __um(LightingMissShader_41_36150C4340C63D4EA70CC59D59D625C1); // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2226) /* FString */               __um(ShadowScissor_27_569C8F954113622FFC40F5B0308485F2);    // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2227) /* FString */               __um(SupportLightFunction_28_D1DCAE474964239358DA70AD73C35624); // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,2228) /* FString */               __um(SharpShadowFallBack_29_532FB35B4DC6112D35D8B385FBB81C94); // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,2229) /* FString */               __um(LightChannelSupport_30_0503581A4B0BF0D27C6B678786D81196); // 0x00E0   (0x0010)  
	SDK_UNDEFINED(16,2230) /* FString */               __um(Per_LightShadowCasting_32_119CD88B437AD7F2A694BEBFF9DAFFF7); // 0x00F0   (0x0010)  
	SDK_UNDEFINED(16,2231) /* FString */               __um(EnableVolumetricShadow_35_DF3AEAC645A1EE6B1D68F1A045EB5ACF); // 0x0100   (0x0010)  
	SDK_UNDEFINED(16,2232) /* FString */               __um(ShadowCullTransmissives_40_C64F92114FE29497B9473794A6BA8BAA); // 0x0110   (0x0010)  
	SDK_UNDEFINED(16,2233) /* FString */               __um(LightingEnableCulling_48_78E217414CF08051DC339C9CF5E68DB6); // 0x0120   (0x0010)  
	SDK_UNDEFINED(16,2234) /* FString */               __um(ShadowUseUnrollBatch_53_F12989654DC4472151E80D8E50F1A3D8); // 0x0130   (0x0010)  
	SDK_UNDEFINED(16,2235) /* FString */               __um(ShadowPrioritizeDirectional_54_EE92E1B44EA59F38B1A9C8B54305E650); // 0x0140   (0x0010)  
	SDK_UNDEFINED(16,2236) /* FString */               __um(CSMMaxCascade_57_D1E86DA4471BD4DD2E928E821A8D3580);    // 0x0150   (0x0010)  
	SDK_UNDEFINED(16,2237) /* FString */               __um(ContactShadow_60_51AFCC6C47A5C780CC5EABAA2C2D40E5);    // 0x0160   (0x0010)  
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/SkyLight_Parameters.SkyLight_Parameters
/// Size: 0x0090 (0x000000 - 0x000090)
struct FSkyLight_Parameters
{ 
	SDK_UNDEFINED(16,2238) /* FString */               __um(GIEvalSkyLight_8_88EC9CBF40393B83BEDA22BB48A2B4CD);    // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2239) /* FString */               __um(EnableRTSkyLight_9_EEE1CC6A47D2E47508784A94A05AA80F);  // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2240) /* FString */               __um(EnableSkyLightDenoiser_10_640DC6C94DF5030E3BDF69AA07720EEF); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2241) /* FString */               __um(SkyLightEnableTwoSidedGeomtry_11_E5C3B38F423C10ECE9207C8B9031AEB7); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2242) /* FString */               __um(SkyLightMaxRayDistance_12_5399303843881FD92F8337BF45C730CF); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2243) /* FString */               __um(SkyLightSPP_13_2D3640B64C7D0103C812CB8533C87237);      // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2244) /* FString */               __um(SkyLightEnableMaterials_14_302F08D048720E799343BDB5D30E9479); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2245) /* FString */               __um(FinalGatherSkyLightIntensity_18_E1A9004942D802B91427469CF88EB838); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2246) /* FString */               __um(FinalGatherSkyLightIndirectMultiplier_19_C397D4FF42305F4582CEEF8263868ABF); // 0x0080   (0x0010)  
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/Translucency_Parameters.Translucency_Parameters
/// Size: 0x0160 (0x000000 - 0x000160)
struct FTranslucency_Parameters
{ 
	SDK_UNDEFINED(16,2247) /* FString */               __um(EnableTranslucensy_14_332FFB204F3B00FC3DF8B59EF91BC71D); // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2248) /* FString */               __um(EnableTranslucencyHeightFog_15_29C6A9F440F6A207C82331939CE3DCE1); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2249) /* FString */               __um(EnableTranslucencyAtmosphericFog_57_399B12EB441624EC80ACF5AD9331F2B3); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2250) /* FString */               __um(EnableTranslucencyShadows_16_7B2E0CEB49AD9CB4A47AF9A9D3EF8AA7); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2251) /* FString */               __um(EnableRefraction_17_72999B57452A259A9A901A8E6E51A5D9); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2252) /* FString */               __um(TranslucencyMaxRoughness_18_C605CB7A47F91F3AE88A7D9AA0CBB46A); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2253) /* FString */               __um(MaxRefractionRays_19_69E233FA4710FF92A41E4D8558ED5CF9); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2254) /* FString */               __um(EnableHybridTranslucency_20_5ECF7E16453EC6CA4CC6028C3BB79614); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2255) /* FString */               __um(HybridTranslucencyDepthThreshold_30_61E75A7D4A65B629146E84BC73B58997); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2256) /* FString */               __um(HybridTranslucencyLayers_22_8DDEED384B9ED866CB1E5CA52763214D); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2257) /* FString */               __um(HybridTranslucencySupport_29_C17F37CC42441163312E479B70C01372); // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2258) /* FString */               __um(TranslucencyMask_24_275B41B2429D609EA96B8E97E439F67B); // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2259) /* FString */               __um(HalfResHybridTranslucency_25_D59DF97446A9ACBCE0A0D38E1D882003); // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,2260) /* FString */               __um(TranslucencyRoughnessMultiplier_26_E69F7D934C950B2F98443380A571C42E); // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,2261) /* FString */               __um(ExcludeTranslucentsFromShadows_31_9A3A2D7F4B9E4A5336D34EAD1B7B8A7B); // 0x00E0   (0x0010)  
	SDK_UNDEFINED(16,2262) /* FString */               __um(TranslucencyEnableAbsorption_34_37C4F9144AB560F9FB3B05A728807878); // 0x00F0   (0x0010)  
	SDK_UNDEFINED(16,2263) /* FString */               __um(EnableTranslucencyinReflection_49_D325071D4CF3B5B35F33BBB3AE61E7A4); // 0x0100   (0x0010)  
	SDK_UNDEFINED(16,2264) /* FString */               __um(RefractionBackgroundSampleFallback_37_B38E1670400FA3C5B25342BD27FBF35A); // 0x0110   (0x0010)  
	SDK_UNDEFINED(16,2265) /* FString */               __um(TranslucencyIgnoreBackfaceOpacity_40_7B969FFF4087B1E90A0919AA274F255F); // 0x0120   (0x0010)  
	SDK_UNDEFINED(16,2266) /* FString */               __um(AbsorptionForceShadingOnOpaqueObjects_43_A8CE4EE74EA5CDDD66AF47945083DC33); // 0x0130   (0x0010)  
	SDK_UNDEFINED(16,2267) /* FString */               __um(HalfResRefraction_46_43CE013F48A027E289B1A39918778984); // 0x0140   (0x0010)  
	SDK_UNDEFINED(16,2268) /* FString */               __um(EnableGIInTranslucency_52_9C57A3514E8CA53E2FFE20A9F9BFC592); // 0x0150   (0x0010)  
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/Water_Caustics_Parameters.Water_Caustics_Parameters
/// Size: 0x0208 (0x000000 - 0x000208)
struct FWater_Caustics_Parameters
{ 
	SDK_UNDEFINED(16,2269) /* FString */               __um(WaterCausticsType_10_22E9DB2B44EBA1DDFCD669BFC4F5A2C3); // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2270) /* FString */               __um(WaterCausticsBufferScale_11_4891F1C1433E69AD7AE583B26CB8B74F); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2271) /* FString */               __um(WaterCausticsRefractiveIntensity_12_84E7671A4C1BAFCE5A912E8B9D549C41); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2272) /* FString */               __um(WaterCausticsReflectiveIntensity_13_A8FAED5646D272D518F78DBF2EC3FFF3); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2273) /* FString */               __um(WaterCausticsFresnelBaseReflectFraction_23_28BA9C044FF67107897D8E983B459690); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2274) /* FString */               __um(WaterCausticsMapSizeX_24_0DD69E77451F51BCA32B16A0B271FC6C); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2275) /* FString */               __um(WaterCausticsMapSizeY_25_5995CB844729B31103795D9CACF0CF3E); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2276) /* FString */               __um(WaterCausticsNumDenoisePasses_26_5FDE5D6146B749E8B952F89B329F61B2); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2277) /* FString */               __um(WaterCausticsMinReflectionRayDistance_27_45097790417E6E7F541B1382E5A0C9AA); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2278) /* FString */               __um(WaterCausticsMaxReflectionRayDistance_28_67F4322D4AF3ACF0CD8B2895974A115B); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2279) /* FString */               __um(WaterCausticsMinRefractionRayDistance_29_E9C281484F546DBCAF69C5A7866FD0B2); // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2280) /* FString */               __um(WaterCausticsMaxRefractionRayDistance_30_3B0E91A54E9D4AD25FCDD18B13E2A9EB); // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2281) /* FString */               __um(WaterCausticsRectLightTemporalWeight_32_6729E6744212BBA47350FDB9D6743EF6); // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,2282) /* FString */               __um(WaterCausticsRefractBackFaceCullingThreshold_33_7EC526954286067A65F5C7A1F3F7A71A); // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,2283) /* FString */               __um(WaterCausticsReflectBackFaceCullingThreshold_36_16DE876A4587F2728ED6C2BA6FD54C98); // 0x00E0   (0x0010)  
	SDK_UNDEFINED(16,2284) /* FString */               __um(WaterCausticsMapCascades_48_C35E153E4FD3359DF08CED8FD8911D43); // 0x00F0   (0x0010)  
	SDK_UNDEFINED(16,2285) /* FString */               __um(WaterCausticsMapCascadeScale_47_59ED42134835FEEF0A3586B7A60856F1); // 0x0100   (0x0010)  
	SDK_UNDEFINED(16,2286) /* FString */               __um(WaterCausticsMapForceLevel_51_4FE7525E45C9D08EA0F96D8388F5BFF6); // 0x0110   (0x0010)  
	SDK_UNDEFINED(16,2287) /* FString */               __um(WaterCausticsShowPhoton_46_B3215C834DEFE8DC5DA4A6A8F292D91D); // 0x0120   (0x0010)  
	SDK_UNDEFINED(16,2288) /* FString */               __um(WaterCausticsPhotonScale_54_1E5BBCA644165B132F85C78276BB702F); // 0x0130   (0x0010)  
	SDK_UNDEFINED(16,2289) /* FString */               __um(WaterCausticsCascadeSamplingOffsetX_61_2719694E494E4EB376BB5DAF45921638); // 0x0140   (0x0010)  
	SDK_UNDEFINED(16,2290) /* FString */               __um(WaterCausticsCascadeSamplingOffsetY_63_98AADADD45FD2ED6D43DC0ADDEC6C53A); // 0x0150   (0x0010)  
	SDK_UNDEFINED(16,2291) /* FString */               __um(WaterCausticsCascadeSamplingUVScaleX_64_3141DE974ACBDD26008C3E8B72619B44); // 0x0160   (0x0010)  
	SDK_UNDEFINED(16,2292) /* FString */               __um(WaterCausticsCascadeSamplingUVScaley_65_A879211B4B47DBCDA46BE4A1A4A3F47D); // 0x0170   (0x0010)  
	SDK_UNDEFINED(16,2293) /* FString */               __um(UseSceneLightDir_68_7B35F1EA4CDF9B9D16F068BF886419AF); // 0x0180   (0x0010)  
	SDK_UNDEFINED(16,2294) /* FString */               __um(WaterCausticsRefractiveNormalScale_71_1C19A78E4C0D6364E06610ABD327EA81); // 0x0190   (0x0010)  
	SDK_UNDEFINED(16,2295) /* FString */               __um(WaterCausticsReflectiveNormalScale_73_DD77A01349FB38B6C5DA8EA6A0587019); // 0x01A0   (0x0010)  
	SDK_UNDEFINED(16,2296) /* FString */               __um(LightLookAtDistance_79_6C8CDDF84333A4EB6FAB0786E1D58ABC); // 0x01B0   (0x0010)  
	SDK_UNDEFINED(16,2297) /* FString */               __um(EnableShadowRay_86_3188925648C445070E895CBB92238ED3);  // 0x01C0   (0x0010)  
	SDK_UNDEFINED(16,2298) /* FString */               __um(ShadowRayTMax_85_36B64E28416A3D12205BEBB3D8855705);    // 0x01D0   (0x0010)  
	SDK_UNDEFINED(16,2299) /* FString */               __um(ViewCulling_90_21A34DCD407C481F481890BAAA4918EC);      // 0x01E0   (0x0010)  
	SDK_UNDEFINED(16,2300) /* FString */               __um(EpsilonArea_93_C760B9CC462409498DFD3B925C102BBC);      // 0x01F0   (0x0010)  
	bool                                               UseAdaptiveWaterCausticsMapResolution_76_543DFDF14AE7BE8B40A0C69F95222067; // 0x0200   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0201   (0x0007)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/Mesh_Caustics_Parameters.Mesh_Caustics_Parameters
/// Size: 0x0160 (0x000000 - 0x000160)
struct FMesh_Caustics_Parameters
{ 
	SDK_UNDEFINED(16,2301) /* FString */               __um(EnableMeshCaustics_11_EF17A54E4000730673FD55AFA7851310); // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2302) /* FString */               __um(MeshCausticsResolution_12_8CBAF5AD40511B86FFECDBBE10551070); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2303) /* FString */               __um(MeshCausticsBufferScale_13_82AC6AEE4DE3DABA0E6EF8AFC173099A); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2304) /* FString */               __um(MeshCausticsTemporalStrength_14_53019FA5437B781E8F3DCDA3EAA12347); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2305) /* FString */               __um(MeshCausticsJitter_15_A7EFA23F493F73491A338F833DD71740); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2306) /* FString */               __um(MeshCausticsEnableDispersion_16_D1059E664DB569A0DCD2868ED0E410C0); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2307) /* FString */               __um(MeshCausticsTranslucentReflectionMode_57_234A3311428BB4FD6186D485A258D216); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2308) /* FString */               __um(MeshCausticsMaxTraceDepth_18_E5DFC534448262757F618C984430031B); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2309) /* FString */               __um(MeshCausticsAdaptivePhotonSize_19_75A570FD45DDB1FFB198EAB522F1327C); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2310) /* FString */               __um(MeshCausticsEnableTemporalFilter_20_B10DF55042CC5EB4BBBD3C9029E72D25); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2311) /* FString */               __um(MeshCausticsAdaptiveSmooth_26_B237A3464D57ACD60A63CEB0E381F8AF); // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2312) /* FString */               __um(MeshCausticsAdaptiveUpdateSpeed_27_EBAA130A425D904E6219BC847C5D4E7E); // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2313) /* FString */               __um(MeshCausticsAdaptiveVarianceGain_28_D612A8F64E9A6BB74AD5D0A9FC85241B); // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,2314) /* FString */               __um(MeshCausticsFixedLight_29_9C6912304FA41791E112799EF9B09B26); // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,2315) /* FString */               __um(MeshCausticsMaxIntensity_30_0571085B49EBB70A2506CC898A54B72E); // 0x00E0   (0x0010)  
	SDK_UNDEFINED(16,2316) /* FString */               __um(MeshCausticsSoftCausticsSample_34_23B75C3A4673EC4C06FB7380A1AFC77B); // 0x00F0   (0x0010)  
	SDK_UNDEFINED(16,2317) /* FString */               __um(MeshCausticsEnableAdvancedSoftCaustics_40_EF539D7E4B254D3FF7354499EA1ADA17); // 0x0100   (0x0010)  
	SDK_UNDEFINED(16,2318) /* FString */               __um(MeshCausticsMidCullColorThreshold_46_603884CE4A61EB477D7D2C82EFE3E844); // 0x0110   (0x0010)  
	SDK_UNDEFINED(16,2319) /* FString */               __um(MeshCausticsFinalCullColorThreshold_47_ADE4A81B4FC53161666873B6CE1C1E16); // 0x0120   (0x0010)  
	SDK_UNDEFINED(16,2320) /* FString */               __um(MeshCausticsIntensity_50_8E96F81D40BC087613695CBE1946AD28); // 0x0130   (0x0010)  
	SDK_UNDEFINED(16,2321) /* FString */               __um(MeshCausticsMaxRayDistance_53_7A78E57D4BA078EDB6381A846432F21C); // 0x0140   (0x0010)  
	SDK_UNDEFINED(16,2322) /* FString */               __um(MeshCausticsTemporalColorTolerance_56_C9E20A13401A4696C5D960922F2ED319); // 0x0150   (0x0010)  
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/DLSS_Parameters.DLSS_Parameters
/// Size: 0x00F8 (0x000000 - 0x0000F8)
struct FDLSS_Parameters
{ 
	SDK_UNDEFINED(16,2323) /* FString */               __um(Sharpness_2_35A008B94CA19E1D1157B4BEE3664DDE);         // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2324) /* FString */               __um(ReuseRenderTargets_7_4A5F178D4DE20524A960E091A6F15B02); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2325) /* FString */               __um(UseGBuffer_8_D4FFBFBC4F49C6E0E05205B3A8224F1E);        // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2326) /* FString */               __um(UseSeparateTranslucency_9_ED102B774883AFCFDAD94E98035351C5); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2327) /* FString */               __um(FallbackAAMethod_10_1704900741EBC3D6398BFCAD49B068A4); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2328) /* FString */               __um(Quality_12_75728F6C402DDAD6D3C83CB43D125F96);          // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2329) /* FString */               __um(AAMethod_15_13810A794156D8CEAF3F7AA78AD87AA4);         // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2330) /* FString */               __um(ReflectionsEnableTAABeforeDLSS_18_071A129344D3B6A5FF8552901A8CF67F); // 0x0070   (0x0010)  
	SDK_UNDEFINED(16,2331) /* FString */               __um(TranslucencyEnableTAABeforeDLSS_21_7E947A1D40EA2E0800C722881BCA5577); // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,2332) /* FString */               __um(ParticleReapplyTAAafterDLSS_38_01F8076E42227DCDF5D7C6BD22E42432); // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,2333) /* FString */               __um(DLSSFallBackQuality_34_146725084183D5B8875F03B095965D14); // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,2334) /* FString */               __um(DLSSEnablePlanarReflection_35_75D786CA4852F3DA32BBD5A03196AD6A); // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,2335) /* FString */               __um(DLSSEnableReflectionCaptures_36_E0D798E64EE07DDF022D31A71335EFD3); // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,2336) /* FString */               __um(DLSSSceneCaptureEnable_37_71C49B4347FB341069C65DA4366CAC3E); // 0x00D0   (0x0010)  
	SDK_UNDEFINED(16,2337) /* FString */               __um(DownSampleBloomWithTAA_41_BE4A636D47F2996D3048D4B3035BBD3F); // 0x00E0   (0x0010)  
	bool                                               EnableRTXParameterOverridebasedonDLSSstatus_23_2DE4E6914407E08718FD63BA1D1DAB85; // 0x00F0   (0x0001)  
	bool                                               EnableOverrideFromUI_25_C5AF676740D5D4F66196FAB79DF9A06B;   // 0x00F1   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x00F2   (0x0006)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/RTX_PostProcess_Settings.RTX_PostProcess_Settings
/// Size: 0x0680 (0x000000 - 0x000680)
struct FRTX_PostProcess_Settings
{ 
	FPostProcessSettings                               RTXPostProcessSettings_2_F5F7708F4E83FAC705A16388FF06FB09;  // 0x0000   (0x0670)  
	float                                              PostProcessWeight_5_1188286A49AC49349A20F8AA6289C4A3;       // 0x0670   (0x0004)  
	float                                              RTXPostProcessPriority_11_2871BEF94A8E61F2640AA297CA1481AE; // 0x0674   (0x0004)  
	bool                                               Unbound_7_7B0858BA4548AD147D2D9083D9CB5FF7;                 // 0x0678   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0679   (0x0007)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Parameter_Data/Data_Type_Support.Data_Type_Support
/// Size: 0x00A8 (0x000000 - 0x0000A8)
struct FData_Type_Support
{ 
	SDK_UNDEFINED(16,2338) /* FString */               __um(EnableStaticMeshes_2_651904DE43FBA47339D96A9DAD1E4C15); // 0x0000   (0x0010)  
	SDK_UNDEFINED(16,2339) /* FString */               __um(EvaluateStaticMeshesWPO_4_5ACA4FE447A0F2425FCB1D9EDA0BFE65); // 0x0010   (0x0010)  
	SDK_UNDEFINED(16,2340) /* FString */               __um(EnableStaticMeshesWPOCulling_6_39681B79467AC310B32BBAA229DE5B56); // 0x0020   (0x0010)  
	SDK_UNDEFINED(16,2341) /* FString */               __um(StaticMeshesWPOCullingRadius_8_DBBF24464491B594BE3DF3BF707035E2); // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,2342) /* FString */               __um(NiagaraMeshesSupport_10_4D6FAD924F96CFB988904F9D2479DA3D); // 0x0040   (0x0010)  
	SDK_UNDEFINED(16,2343) /* FString */               __um(EnableRayTracingCulling_15_FDADA8574431BA71B6F294BD87242BC3); // 0x0050   (0x0010)  
	SDK_UNDEFINED(16,2344) /* FString */               __um(RayTracingCullingAngle_16_4DEF320C4ADB0F1619EE56B2CEC4BBF8); // 0x0060   (0x0010)  
	SDK_UNDEFINED(16,2345) /* FString */               __um(RayTracingCullingRadius_17_57BBBB0141F7BA6B75C63EA93493D73E); // 0x0070   (0x0010)  
	float                                              EnableRTMaterialsCollection_21_ACDD89994453403AF2E80DB4AF4472C2; // 0x0080   (0x0004)  
	float                                              UseRasterPostProcessWaterCaustics_24_480609144913EF3CF13481BDBD3E8322; // 0x0084   (0x0004)  
	float                                              MPC_UseDepthOffset_32_51B09D2F43E571977A9E21B95382F060;     // 0x0088   (0x0004)  
	float                                              RT_UseDitherTAA_35_E33F647D47349E707FD8A587748D7739;        // 0x008C   (0x0004)  
	float                                              Use_RT_Roughness_38_2F7784B047306F81CE199CB924F63D7D;       // 0x0090   (0x0004)  
	bool                                               EnableSQSpotlightOverride_26_E6F62D4143A92ECBE97F1283BF947CAD; // 0x0094   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0095   (0x0003)  MISSED
	float                                              PointLightSpecularScaleOverride_42_FF982E7E486A59D67BFFF69C8E1B513E; // 0x0098   (0x0004)  
	float                                              SpotLightSpecularScaleOverride_43_21F52CFF4E8F7BC00F6D9FB786E22892; // 0x009C   (0x0004)  
	bool                                               UseSpotPointLightspecularoverride_46_1E0C743B45737161936929B032A84F0F; // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x00A1   (0x0007)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/VeryHigh.VeryHigh
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FVeryHigh
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_DF713E70420757F4C67C13BBDC8E3A9E;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_D6EED34F42FA2FE3B39C158FD4BF7119; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_AEFA0C0C452CE59634C848B5C631054B;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/High.High
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FHigh
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_3A6775704CF641DFEEC2478C297B7D69;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_268786DF438462588539E5BAF602ED34; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_9E6E38D0457178D057445BB789B66861;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/Medium.Medium
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FMedium
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_126107EB4BCF56CDC4C5B1A3FA2B8964;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_C236E627421415551C877990D27B9167; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_235E5EC54FBE277866307EA521303AE6;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/Low.Low
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FLow
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_7E4DC0424931B31C9DF0779DC71B119B;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_79EC232848BAB964A67DDB9C114B7FDA; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_2CF543B1483D74C0A33EDEA58E7FBCE3;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/Film.Film
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FFilm
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_1FF18AE34628A2E7E3B9D1A3B90943A2;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_87CE5EF04E423A2573F0718792B9B575; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_D278899C422ED09357C74FBEF16D1648;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/Queue.Queue
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FQueue
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_4A3CCCF54093EB9F67DCA6BAF9FDEA66;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_78467B544CA2D05E4E2F1AA0BF710D08; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_157829E840A72D1D9D310D8A11B6A990;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/Disable.Disable
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FDisable
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_D94EF156432B307677D00680EBDF73B8;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_96E0621447558B5C83E4DE968475A475; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_5A4FE3844869BBEAD37ECC9486050B48;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/Sequence.Sequence
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FSequence
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_AD9A759A4B351C95067BE9BC4F8BAB51;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_B2D33BEB48B4C7919E389880C9AC3F93; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_319_6E52450A459E7A4244F48EBFD811B9F7;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Class /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C
/// Size: 0xBB20 (0x000220 - 0x00BD40)
class ABP_RT_Quality_Parameters_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UPostProcessComponent*                       RTX_PostProcess;                                            // 0x0228   (0x0008)  
	class UBoxComponent*                               Box;                                                        // 0x0230   (0x0008)  
	class UTextRenderComponent*                        RT_Quality_Parameters;                                      // 0x0238   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0240   (0x0008)  
	SDK_UNDEFINED(16,2346) /* FString */               __um(Enable_Reflection);                                    // 0x0248   (0x0010)  
	SDK_UNDEFINED(16,2347) /* FString */               __um(Enable_AO);                                            // 0x0258   (0x0010)  
	SDK_UNDEFINED(16,2348) /* FString */               __um(Enable_Shadow);                                        // 0x0268   (0x0010)  
	SDK_UNDEFINED(16,2349) /* FString */               __um(Enable_Translucensy);                                  // 0x0278   (0x0010)  
	SDK_UNDEFINED(16,2350) /* FString */               __um(Enable_Translucency_Atmospheric_Fog);                  // 0x0288   (0x0010)  
	SDK_UNDEFINED(16,2351) /* FString */               __um(Enable_Translucency_Height_Fog);                       // 0x0298   (0x0010)  
	SDK_UNDEFINED(16,2352) /* FString */               __um(Enable_Translucency_Shadows);                          // 0x02A8   (0x0010)  
	SDK_UNDEFINED(16,2353) /* FString */               __um(Enable_Refraction);                                    // 0x02B8   (0x0010)  
	SDK_UNDEFINED(16,2354) /* FString */               __um(Translucency_Max_Roughness);                           // 0x02C8   (0x0010)  
	SDK_UNDEFINED(16,2355) /* FString */               __um(Max_Refraction_Rays);                                  // 0x02D8   (0x0010)  
	SDK_UNDEFINED(16,2356) /* FString */               __um(Evaluate_Materials_in_Shadow);                         // 0x02E8   (0x0010)  
	SDK_UNDEFINED(16,2357) /* FString */               __um(Shadow_Enable_Two_Sided_Geometry);                     // 0x02F8   (0x0010)  
	SDK_UNDEFINED(16,2358) /* FString */               __um(Enable_Height_Fog_in_Reflection);                      // 0x0308   (0x0010)  
	SDK_UNDEFINED(16,2359) /* FString */               __um(Reflection_Sort_Materials);                            // 0x0318   (0x0010)  
	SDK_UNDEFINED(16,2360) /* FString */               __um(Enable_Reflection_Shadow);                             // 0x0328   (0x0010)  
	SDK_UNDEFINED(16,2361) /* FString */               __um(Reflection_Max_Roughness);                             // 0x0338   (0x0010)  
	SDK_UNDEFINED(16,2362) /* FString */               __um(Reflection_Screen_Percentage);                         // 0x0348   (0x0010)  
	FVector                                            Box_Reletive_Scale;                                         // 0x0358   (0x000C)  
	bool                                               Hidden_in_Game;                                             // 0x0364   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0365   (0x0003)  MISSED
	SDK_UNDEFINED(16,2363) /* FString */               __um(Normal_Bias);                                          // 0x0368   (0x0010)  
	SDK_UNDEFINED(16,2364) /* FString */               __um(Debug_Force_Opaque);                                   // 0x0378   (0x0010)  
	SDK_UNDEFINED(16,2365) /* FString */               __um(Debug_Force_Full_Build);                               // 0x0388   (0x0010)  
	SDK_UNDEFINED(16,2366) /* FString */               __um(Debug_Disable_Triangle_Cull);                          // 0x0398   (0x0010)  
	SDK_UNDEFINED(16,2367) /* FString */               __um(Debug_Force_Build_Mode);                               // 0x03A8   (0x0010)  
	SDK_UNDEFINED(16,2368) /* FString */               __um(Reflection_Max_Ray_Distance);                          // 0x03B8   (0x0010)  
	SDK_UNDEFINED(16,2369) /* FString */               __um(Reflection_Min_Ray_Distance);                          // 0x03C8   (0x0010)  
	SDK_UNDEFINED(16,2370) /* FString */               __um(Reflection_Max_Bounces);                               // 0x03D8   (0x0010)  
	SDK_UNDEFINED(16,2371) /* FString */               __um(Reflection_SPP);                                       // 0x03E8   (0x0010)  
	SDK_UNDEFINED(16,2372) /* FString */               __um(Shadow_SPP);                                           // 0x03F8   (0x0010)  
	SDK_UNDEFINED(16,2373) /* FString */               __um(Enable_Reflection_Denoiser);                           // 0x0408   (0x0010)  
	SDK_UNDEFINED(16,2374) /* FString */               __um(Enable_Shadow_Denoiser);                               // 0x0418   (0x0010)  
	SDK_UNDEFINED(1,2375) /* TEnumAsByte<Enum_RT_Quality_Preset> */ __um(Enum_RT_QualitySwitch);                   // 0x0428   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0429   (0x0007)  MISSED
	SDK_UNDEFINED(16,2376) /* FString */               __um(GI_type);                                              // 0x0430   (0x0010)  
	SDK_UNDEFINED(16,2377) /* FString */               __um(Enable_GI_Denoiser);                                   // 0x0440   (0x0010)  
	SDK_UNDEFINED(16,2378) /* FString */               __um(GI_EvalSkyLight);                                      // 0x0450   (0x0010)  
	SDK_UNDEFINED(16,2379) /* FString */               __um(GI_MaxBounce);                                         // 0x0460   (0x0010)  
	SDK_UNDEFINED(16,2380) /* FString */               __um(GI_MaxRayDistance);                                    // 0x0470   (0x0010)  
	SDK_UNDEFINED(16,2381) /* FString */               __um(GI_SPP);                                               // 0x0480   (0x0010)  
	SDK_UNDEFINED(16,2382) /* FString */               __um(GI_Screen_Percentage);                                 // 0x0490   (0x0010)  
	SDK_UNDEFINED(16,2383) /* FString */               __um(GI_UseRussianRoulette_);                               // 0x04A0   (0x0010)  
	SDK_UNDEFINED(16,2384) /* FString */               __um(Enable_RT_SkyLight);                                   // 0x04B0   (0x0010)  
	SDK_UNDEFINED(16,2385) /* FString */               __um(Enable_SkyLight_Denoiser);                             // 0x04C0   (0x0010)  
	SDK_UNDEFINED(16,2386) /* FString */               __um(SkyLight_Enable_Two_Sided_Geomtry);                    // 0x04D0   (0x0010)  
	SDK_UNDEFINED(16,2387) /* FString */               __um(SkyLight_MaxRay_Distance);                             // 0x04E0   (0x0010)  
	SDK_UNDEFINED(16,2388) /* FString */               __um(SkyLight_SPP);                                         // 0x04F0   (0x0010)  
	SDK_UNDEFINED(16,2389) /* FString */               __um(Reflection_Enable_Materials);                          // 0x0500   (0x0010)  
	FVeryHigh                                          Very_High;                                                  // 0x0510   (0x14C0)  
	FHigh                                              High;                                                       // 0x19D0   (0x14C0)  
	FMedium                                            Medium;                                                     // 0x2E90   (0x14C0)  
	FLow                                               Low;                                                        // 0x4350   (0x14C0)  
	FFilm                                              Film;                                                       // 0x5810   (0x14C0)  
	FQueue                                             Queue;                                                      // 0x6CD0   (0x14C0)  
	FDisable                                           Disable;                                                    // 0x8190   (0x14C0)  
	SDK_UNDEFINED(16,2390) /* FString */               __um(RT_Enable_Reflection_Capture_);                        // 0x9650   (0x0010)  
	SDK_UNDEFINED(16,2391) /* FString */               __um(Enable_Shader_Cache);                                  // 0x9660   (0x0010)  
	SDK_UNDEFINED(16,2392) /* FString */               __um(AO_Enable_Material);                                   // 0x9670   (0x0010)  
	SDK_UNDEFINED(16,2393) /* FString */               __um(AO_Enable_Two_Side_Geometry);                          // 0x9680   (0x0010)  
	SDK_UNDEFINED(16,2394) /* FString */               __um(Enable_Landscape_Detect_Texture_Streaming);            // 0x9690   (0x0010)  
	SDK_UNDEFINED(16,2395) /* FString */               __um(Enable_Landscape_LOD_UpdateEveryFrame);                // 0x96A0   (0x0010)  
	SDK_UNDEFINED(16,2396) /* FString */               __um(Enable_Instanced_Static_Mesh);                         // 0x96B0   (0x0010)  
	SDK_UNDEFINED(16,2397) /* FString */               __um(Enable_Instanced_Static_Meshes_Culling);               // 0x96C0   (0x0010)  
	SDK_UNDEFINED(16,2398) /* FString */               __um(Instanced_Static_Meshes_Culling_Radius);               // 0x96D0   (0x0010)  
	SDK_UNDEFINED(16,2399) /* FString */               __um(Shadow_Max_Batch_Size);                                // 0x96E0   (0x0010)  
	SDK_UNDEFINED(16,2400) /* FString */               __um(GI_Diffuse_Threshold);                                 // 0x96F0   (0x0010)  
	SDK_UNDEFINED(16,2401) /* FString */               __um(Shadow_Denoiser_Max_Batch_Size);                       // 0x9700   (0x0010)  
	SDK_UNDEFINED(16,2402) /* FString */               __um(Enable_Landscape_In_RT);                               // 0x9710   (0x0010)  
	SDK_UNDEFINED(16,2403) /* FString */               __um(RTX_Switch);                                           // 0x9720   (0x0010)  
	SDK_UNDEFINED(16,2404) /* FString */               __um(Enable_Reflection_Test_Roughness);                     // 0x9730   (0x0010)  
	float                                              EnableRTMaterialsCollection;                                // 0x9740   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x9744   (0x0004)  MISSED
	SDK_UNDEFINED(16,2405) /* FString */               __um(Reflection_Use_Unroll_Sampling);                       // 0x9748   (0x0010)  
	SDK_UNDEFINED(16,2406) /* FString */               __um(GI_Sort_Materials);                                    // 0x9758   (0x0010)  
	SDK_UNDEFINED(16,2407) /* FString */               __um(GI_Enable_Two_Sided_Geometry);                         // 0x9768   (0x0010)  
	SDK_UNDEFINED(16,2408) /* FString */               __um(Final_Gather_Distance);                                // 0x9778   (0x0010)  
	SDK_UNDEFINED(16,2409) /* FString */               __um(Enable_Hybrid_Translucency);                           // 0x9788   (0x0010)  
	SDK_UNDEFINED(16,2410) /* FString */               __um(Hybrid_Translucency_DepthThreshold_);                  // 0x9798   (0x0010)  
	SDK_UNDEFINED(16,2411) /* FString */               __um(Hybrid_Translucency_Layers);                           // 0x97A8   (0x0010)  
	SDK_UNDEFINED(16,2412) /* FString */               __um(Hybrid_Translucency_Support);                          // 0x97B8   (0x0010)  
	SDK_UNDEFINED(16,2413) /* FString */               __um(Lighting_Max_Lights);                                  // 0x97C8   (0x0010)  
	SDK_UNDEFINED(16,2414) /* FString */               __um(Shadow_Max_Lights);                                    // 0x97D8   (0x0010)  
	SDK_UNDEFINED(16,2415) /* FString */               __um(Lighting_Miss_Shader);                                 // 0x97E8   (0x0010)  
	SDK_UNDEFINED(16,2416) /* FString */               __um(Lighting_Max_Shadow_Lights);                           // 0x97F8   (0x0010)  
	SDK_UNDEFINED(16,2417) /* FString */               __um(Shadow_Max_Denoised_Lights_);                          // 0x9808   (0x0010)  
	SDK_UNDEFINED(16,2418) /* FString */               __um(Translucency_Mask_);                                   // 0x9818   (0x0010)  
	SDK_UNDEFINED(16,2419) /* FString */               __um(SkyLight_Enable_Materials);                            // 0x9828   (0x0010)  
	SDK_UNDEFINED(16,2420) /* FString */               __um(_Half_Res_Hybrid_Translucency);                        // 0x9838   (0x0010)  
	SDK_UNDEFINED(16,2421) /* FString */               __um(ShadowScissor);                                        // 0x9848   (0x0010)  
	SDK_UNDEFINED(16,2422) /* FString */               __um(Support_Light_Function);                               // 0x9858   (0x0010)  
	SDK_UNDEFINED(16,2423) /* FString */               __um(Sharp_Shadow_Fall_Back);                               // 0x9868   (0x0010)  
	SDK_UNDEFINED(16,2424) /* FString */               __um(Light_Channel_Support);                                // 0x9878   (0x0010)  
	SDK_UNDEFINED(16,2425) /* FString */               __um(Translucency_Roughness_Multiplier_);                   // 0x9888   (0x0010)  
	SDK_UNDEFINED(16,2426) /* FString */               __um(Reflections_Roughness_Multiplier_);                    // 0x9898   (0x0010)  
	SDK_UNDEFINED(16,2427) /* FString */               __um(Hybrid_Reflection);                                    // 0x98A8   (0x0010)  
	SDK_UNDEFINED(16,2428) /* FString */               __um(Per_Light_Shadow_Casting);                             // 0x98B8   (0x0010)  
	SDK_UNDEFINED(16,2429) /* FString */               __um(RT_Parallel_Gather);                                   // 0x98C8   (0x0010)  
	SDK_UNDEFINED(16,2430) /* FString */               __um(RT_Late_Init);                                         // 0x98D8   (0x0010)  
	SDK_UNDEFINED(16,2431) /* FString */               __um(Exclude_Translucents_From_Shadows_);                   // 0x98E8   (0x0010)  
	SDK_UNDEFINED(16,2432) /* FString */               __um(OcclusionCullDirection_);                              // 0x98F8   (0x0010)  
	SDK_UNDEFINED(16,2433) /* FString */               __um(Parallel_Mesh_Batch_Setup_);                           // 0x9908   (0x0010)  
	SDK_UNDEFINED(16,2434) /* FString */               __um(Batch_Materials_);                                     // 0x9918   (0x0010)  
	SDK_UNDEFINED(16,2435) /* FString */               __um(Enable_Mesh_Caustics);                                 // 0x9928   (0x0010)  
	SDK_UNDEFINED(16,2436) /* FString */               __um(Water_Caustics_Type);                                  // 0x9938   (0x0010)  
	SDK_UNDEFINED(16,2437) /* FString */               __um(Water_Caustics_Refractive_Intensity_);                 // 0x9948   (0x0010)  
	SDK_UNDEFINED(16,2438) /* FString */               __um(Water_Caustics_Reflective_Intensity_);                 // 0x9958   (0x0010)  
	SDK_UNDEFINED(16,2439) /* FString */               __um(Water_Caustics_Fresnel_Base_Reflect_Fraction_);        // 0x9968   (0x0010)  
	SDK_UNDEFINED(16,2440) /* FString */               __um(Water_Caustics_Map_Size_X__);                          // 0x9978   (0x0010)  
	SDK_UNDEFINED(16,2441) /* FString */               __um(Water_Caustics_Map_Size_Y);                            // 0x9988   (0x0010)  
	SDK_UNDEFINED(16,2442) /* FString */               __um(Water_Caustics_Num_Denoise_Passes_);                   // 0x9998   (0x0010)  
	SDK_UNDEFINED(16,2443) /* FString */               __um(Water_Caustics_Min_Reflection_Ray_Distance_);          // 0x99A8   (0x0010)  
	SDK_UNDEFINED(16,2444) /* FString */               __um(Water_Caustics_Max_Reflection_Ray_Distance_);          // 0x99B8   (0x0010)  
	SDK_UNDEFINED(16,2445) /* FString */               __um(Water_Caustics_Min_Refraction_Ray_Distance_);          // 0x99C8   (0x0010)  
	SDK_UNDEFINED(16,2446) /* FString */               __um(Water_Caustics_Max_Refraction_Ray_Distance_);          // 0x99D8   (0x0010)  
	SDK_UNDEFINED(16,2447) /* FString */               __um(Water_Caustics_Rect_Light_Temporal_Weight_);           // 0x99E8   (0x0010)  
	SDK_UNDEFINED(16,2448) /* FString */               __um(Mesh_Caustics_Resolution_);                            // 0x99F8   (0x0010)  
	SDK_UNDEFINED(16,2449) /* FString */               __um(Mesh_Caustics_Intensity_);                             // 0x9A08   (0x0010)  
	SDK_UNDEFINED(16,2450) /* FString */               __um(Water_Caustics_Buffer_Scale_);                         // 0x9A18   (0x0010)  
	SDK_UNDEFINED(16,2451) /* FString */               __um(Mesh_Caustics_Buffer_Scale_);                          // 0x9A28   (0x0010)  
	SDK_UNDEFINED(16,2452) /* FString */               __um(Mesh_Caustics_Temporal_Strength_);                     // 0x9A38   (0x0010)  
	SDK_UNDEFINED(16,2453) /* FString */               __um(Mesh_Caustics_Jitter_);                                // 0x9A48   (0x0010)  
	SDK_UNDEFINED(16,2454) /* FString */               __um(Mesh_Caustics_Enable_Dispersion_);                     // 0x9A58   (0x0010)  
	SDK_UNDEFINED(16,2455) /* FString */               __um(Mesh_Caustics_Translucent_Reflection_Mode);            // 0x9A68   (0x0010)  
	SDK_UNDEFINED(16,2456) /* FString */               __um(Mesh_Caustics_Max_Trace_Depth_);                       // 0x9A78   (0x0010)  
	SDK_UNDEFINED(16,2457) /* FString */               __um(Mesh_Caustics_Adaptive_Photon_Size_);                  // 0x9A88   (0x0010)  
	SDK_UNDEFINED(16,2458) /* FString */               __um(Mesh_Caustics_Enable_Temporal_Filter_);                // 0x9A98   (0x0010)  
	SDK_UNDEFINED(16,2459) /* FString */               __um(Mesh_Caustics_Adaptive_Smooth_);                       // 0x9AA8   (0x0010)  
	SDK_UNDEFINED(16,2460) /* FString */               __um(Mesh_Caustics_Adaptive_Update_Speed_);                 // 0x9AB8   (0x0010)  
	SDK_UNDEFINED(16,2461) /* FString */               __um(Mesh_Caustics_Adaptive_Variance_Gain_);                // 0x9AC8   (0x0010)  
	SDK_UNDEFINED(16,2462) /* FString */               __um(Mesh_Caustics_Fixed_Light_);                           // 0x9AD8   (0x0010)  
	SDK_UNDEFINED(16,2463) /* FString */               __um(Mesh_Caustics_Max_Intensity_);                         // 0x9AE8   (0x0010)  
	SDK_UNDEFINED(16,2464) /* FString */               __um(Translucency_Enable_Absorption_);                      // 0x9AF8   (0x0010)  
	SDK_UNDEFINED(16,2465) /* FString */               __um(Mesh_Caustics_Soft_Caustics_Sample_);                  // 0x9B08   (0x0010)  
	SDK_UNDEFINED(16,2466) /* FString */               __um(Water_Caustics_Refract_Back_Face_Culling_Threshold_);  // 0x9B18   (0x0010)  
	SDK_UNDEFINED(16,2467) /* FString */               __um(Water_Caustics_Reflect_Back_Face_Culling_Threshold_);  // 0x9B28   (0x0010)  
	SDK_UNDEFINED(16,2468) /* FString */               __um(Water_Caustics_Map_Cascades_);                         // 0x9B38   (0x0010)  
	SDK_UNDEFINED(16,2469) /* FString */               __um(Water_Caustics_Map_Force_Level_);                      // 0x9B48   (0x0010)  
	SDK_UNDEFINED(16,2470) /* FString */               __um(Water_Caustics_Map_Cascade_Scale_);                    // 0x9B58   (0x0010)  
	SDK_UNDEFINED(16,2471) /* FString */               __um(Water_Caustics_Show_Photon_);                          // 0x9B68   (0x0010)  
	SDK_UNDEFINED(16,2472) /* FString */               __um(Water_Caustics_Photon_Scale);                          // 0x9B78   (0x0010)  
	SDK_UNDEFINED(16,2473) /* FString */               __um(Mesh_Caustics_Enable_Advanced_Soft_Caustics_);         // 0x9B88   (0x0010)  
	SDK_UNDEFINED(16,2474) /* FString */               __um(Mesh_Caustics_Mid_Cull_Color_Threshold_);              // 0x9B98   (0x0010)  
	SDK_UNDEFINED(16,2475) /* FString */               __um(Mesh_Caustics_Final_Cull_Color_Threshold_);            // 0x9BA8   (0x0010)  
	SDK_UNDEFINED(16,2476) /* FString */               __um(Water_Caustics_Cascade_Sampling_Offset_X_);            // 0x9BB8   (0x0010)  
	SDK_UNDEFINED(16,2477) /* FString */               __um(Water_Caustics_Cascade_Sampling_Offset_Y);             // 0x9BC8   (0x0010)  
	SDK_UNDEFINED(16,2478) /* FString */               __um(Water_Caustics_Cascade_Sampling_UVScale_X_);           // 0x9BD8   (0x0010)  
	SDK_UNDEFINED(16,2479) /* FString */               __um(Water_Caustics_Cascade_Sampling_UVScale_Y_);           // 0x9BE8   (0x0010)  
	SDK_UNDEFINED(16,2480) /* FString */               __um(Sharpness);                                            // 0x9BF8   (0x0010)  
	SDK_UNDEFINED(16,2481) /* FString */               __um(ReuseRenderTargets);                                   // 0x9C08   (0x0010)  
	SDK_UNDEFINED(16,2482) /* FString */               __um(UseGBuffer);                                           // 0x9C18   (0x0010)  
	SDK_UNDEFINED(16,2483) /* FString */               __um(UseSeparateTranslucency);                              // 0x9C28   (0x0010)  
	SDK_UNDEFINED(16,2484) /* FString */               __um(FallbackAAMethod);                                     // 0x9C38   (0x0010)  
	SDK_UNDEFINED(16,2485) /* FString */               __um(Quality);                                              // 0x9C48   (0x0010)  
	SDK_UNDEFINED(16,2486) /* FString */               __um(AA_Method);                                            // 0x9C58   (0x0010)  
	SDK_UNDEFINED(16,2487) /* FString */               __um(Reflections_Enable_TAA_Before_DLSS_);                  // 0x9C68   (0x0010)  
	SDK_UNDEFINED(16,2488) /* FString */               __um(Translucency_Enable_TAA_Before_DLSS_);                 // 0x9C78   (0x0010)  
	SDK_UNDEFINED(16,2489) /* FString */               __um(GI_Max_Light_Count_);                                  // 0x9C88   (0x0010)  
	SDK_UNDEFINED(16,2490) /* FString */               __um(AO_SPP);                                               // 0x9C98   (0x0010)  
	SDK_UNDEFINED(16,2491) /* FString */               __um(GI_Denoiser_Type);                                     // 0x9CA8   (0x0010)  
	SDK_UNDEFINED(16,2492) /* FString */               __um(GI_Apply_AO);                                          // 0x9CB8   (0x0010)  
	SDK_UNDEFINED(16,2493) /* FString */               __um(GI_Denoiser_Color_Clamp);                              // 0x9CC8   (0x0010)  
	SDK_UNDEFINED(16,2494) /* FString */               __um(GI_Denoiser_Normal_Tolerance);                         // 0x9CD8   (0x0010)  
	SDK_UNDEFINED(16,2495) /* FString */               __um(Spatial_Normal_Tolerance);                             // 0x9CE8   (0x0010)  
	bool                                               Enable_RTX_Parameter_Override_based_on_DLSS_status;         // 0x9CF8   (0x0001)  
	bool                                               Enable_Override_From_UI;                                    // 0x9CF9   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x9CFA   (0x0006)  MISSED
	SDK_UNDEFINED(16,2496) /* FString */               __um(Particle_Reapply_TAA_after_DLSS);                      // 0x9D00   (0x0010)  
	SDK_UNDEFINED(16,2497) /* FString */               __um(Refraction_Background_Sample_Fallback_);               // 0x9D10   (0x0010)  
	SDK_UNDEFINED(16,2498) /* FString */               __um(GI_Denoise_History_Length);                            // 0x9D20   (0x0010)  
	SDK_UNDEFINED(16,2499) /* FString */               __um(Spatial_Filter_Iteration);                             // 0x9D30   (0x0010)  
	SDK_UNDEFINED(16,2500) /* FString */               __um(Translucency_Ignore_Backface_Opacity);                 // 0x9D40   (0x0010)  
	SDK_UNDEFINED(16,2501) /* FString */               __um(Use_Scene_Light_Dir);                                  // 0x9D50   (0x0010)  
	SDK_UNDEFINED(16,2502) /* FString */               __um(Enable_Volumetric_Shadow);                             // 0x9D60   (0x0010)  
	SDK_UNDEFINED(16,2503) /* FString */               __um(Absorption_Force_Shading_On_Opaque_Objects);           // 0x9D70   (0x0010)  
	SDK_UNDEFINED(16,2504) /* FString */               __um(Mesh_Caustics_Max_Ray_Distance);                       // 0x9D80   (0x0010)  
	SDK_UNDEFINED(16,2505) /* FString */               __um(Mesh_Caustics_Temporal_Color_Tolerance);               // 0x9D90   (0x0010)  
	SDK_UNDEFINED(16,2506) /* FString */               __um(GI_Diffuse_Boost);                                     // 0x9DA0   (0x0010)  
	SDK_UNDEFINED(16,2507) /* FString */               __um(Reflected_Translucency_Mode);                          // 0x9DB0   (0x0010)  
	SDK_UNDEFINED(16,2508) /* FString */               __um(Reflected_Translucency_Max_Bounces);                   // 0x9DC0   (0x0010)  
	SDK_UNDEFINED(16,2509) /* FString */               __um(Reflected_Translucency_Transmission_Threshold);        // 0x9DD0   (0x0010)  
	SDK_UNDEFINED(16,2510) /* FString */               __um(Half_Res_Refraction);                                  // 0x9DE0   (0x0010)  
	SDK_UNDEFINED(16,2511) /* FString */               __um(AO_Denoiser_History_Convolution_Sample_Count_);        // 0x9DF0   (0x0010)  
	SDK_UNDEFINED(16,2512) /* FString */               __um(Shadow_Cull_Transmissives);                            // 0x9E00   (0x0010)  
	SDK_UNDEFINED(16,2513) /* FString */               __um(DLSS_Fall_Back_Quality);                               // 0x9E10   (0x0010)  
	SDK_UNDEFINED(16,2514) /* FString */               __um(DLSS_Enable_Planar_Reflection);                        // 0x9E20   (0x0010)  
	SDK_UNDEFINED(16,2515) /* FString */               __um(DLSS_Enable_Reflection_Captures);                      // 0x9E30   (0x0010)  
	SDK_UNDEFINED(16,2516) /* FString */               __um(DLSS_Scene_Capture_Enable);                            // 0x9E40   (0x0010)  
	SDK_UNDEFINED(16,2517) /* FString */               __um(Instanced_Static_Meshes_Culling_Angle);                // 0x9E50   (0x0010)  
	FPostProcessSettings                               RTX_Post_Process_Settings;                                  // 0x9E60   (0x0670)  
	float                                              RTX_Post_Process_Weight;                                    // 0xA4D0   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0xA4D4   (0x0004)  MISSED
	SDK_UNDEFINED(16,2518) /* FString */               __um(Enable_Translucency_in_Reflection);                    // 0xA4D8   (0x0010)  
	bool                                               Unbound;                                                    // 0xA4E8   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0xA4E9   (0x0003)  MISSED
	float                                              RTX_Post_Process_Priority;                                  // 0xA4EC   (0x0004)  
	SDK_UNDEFINED(16,2519) /* FString */               __um(FinalGather_UseReservoirResampling);                   // 0xA4F0   (0x0010)  
	SDK_UNDEFINED(16,2520) /* FString */               __um(GI_Metalic_Support);                                   // 0xA500   (0x0010)  
	SDK_UNDEFINED(16,2521) /* FString */               __um(GI_Denoiser_Spatial_Filter_Type);                      // 0xA510   (0x0010)  
	SDK_UNDEFINED(16,2522) /* FString */               __um(GI_Denoiser_Use_SH);                                   // 0xA520   (0x0010)  
	SDK_UNDEFINED(16,2523) /* FString */               __um(GI_Denoiser_SH_Sharpness);                             // 0xA530   (0x0010)  
	SDK_UNDEFINED(16,2524) /* FString */               __um(ATrous_Depth_Tolerance_);                              // 0xA540   (0x0010)  
	SDK_UNDEFINED(16,2525) /* FString */               __um(Final_Gather_SkyLight_Intensity_);                     // 0xA550   (0x0010)  
	SDK_UNDEFINED(16,2526) /* FString */               __um(Final_Gather_SkyLight_IndirectMultiplier_);            // 0xA560   (0x0010)  
	SDK_UNDEFINED(16,2527) /* FString */               __um(Instanced_Static_Meshes_Evaluate_WPO);                 // 0xA570   (0x0010)  
	SDK_UNDEFINED(16,2528) /* FString */               __um(Instanced_Static_Meshes_Simulation_Count);             // 0xA580   (0x0010)  
	SDK_UNDEFINED(16,2529) /* FString */               __um(Shadow_UseBiasForSkipWPOEval);                         // 0xA590   (0x0010)  
	SDK_UNDEFINED(16,2530) /* FString */               __um(Shadow_MaxBiasForInexactGeometry);                     // 0xA5A0   (0x0010)  
	SDK_UNDEFINED(16,2531) /* FString */               __um(Lighting_Enable_Culling);                              // 0xA5B0   (0x0010)  
	SDK_UNDEFINED(16,2532) /* FString */               __um(Enable_Culling);                                       // 0xA5C0   (0x0010)  
	SDK_UNDEFINED(16,2533) /* FString */               __um(Culling_Angle);                                        // 0xA5D0   (0x0010)  
	SDK_UNDEFINED(16,2534) /* FString */               __um(Culling_Radius);                                       // 0xA5E0   (0x0010)  
	SDK_UNDEFINED(16,2535) /* FString */               __um(Shadow_Use_Unroll_Batch);                              // 0xA5F0   (0x0010)  
	SDK_UNDEFINED(16,2536) /* FString */               __um(Shadow_PrioritizeDirectional);                         // 0xA600   (0x0010)  
	SDK_UNDEFINED(16,2537) /* FString */               __um(Enable_Static_Meshes);                                 // 0xA610   (0x0010)  
	SDK_UNDEFINED(16,2538) /* FString */               __um(Evaluate_Static_Meshes_WPO);                           // 0xA620   (0x0010)  
	SDK_UNDEFINED(16,2539) /* FString */               __um(Enable_Static_Meshes_WPO_Culling);                     // 0xA630   (0x0010)  
	SDK_UNDEFINED(16,2540) /* FString */               __um(Static_Meshes_WPO_Culling_Radius);                     // 0xA640   (0x0010)  
	SDK_UNDEFINED(16,2541) /* FString */               __um(Niagara_Meshes_Support);                               // 0xA650   (0x0010)  
	SDK_UNDEFINED(16,2542) /* FString */               __um(AO_UseBiasForSkipWPOEval);                             // 0xA660   (0x0010)  
	SDK_UNDEFINED(16,2543) /* FString */               __um(AO_MaxBiasForInexactGeometry_);                        // 0xA670   (0x0010)  
	SDK_UNDEFINED(16,2544) /* FString */               __um(GIDenoise_ATrous_Filter_Width_);                       // 0xA680   (0x0010)  
	SDK_UNDEFINED(16,2545) /* FString */               __um(Final_Gather_Reservoir_Update_Interval_);              // 0xA690   (0x0010)  
	SDK_UNDEFINED(16,2546) /* FString */               __um(Final_Gather_Max_Reuse_Weight_);                       // 0xA6A0   (0x0010)  
	SDK_UNDEFINED(16,2547) /* FString */               __um(Final_Gather_Aggressive_Reservoir_Reuse);              // 0xA6B0   (0x0010)  
	SDK_UNDEFINED(16,2548) /* FString */               __um(Final_Gather_Normal_From_Depth);                       // 0xA6C0   (0x0010)  
	SDK_UNDEFINED(16,2549) /* TArray<FString> */       __um(Features);                                             // 0xA6D0   (0x0010)  
	bool                                               EnableExclude;                                              // 0xA6E0   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0xA6E1   (0x0007)  MISSED
	SDK_UNDEFINED(16,2550) /* FString */               __um(WaterCaustics_RefractiveNormalScale_);                 // 0xA6E8   (0x0010)  
	SDK_UNDEFINED(16,2551) /* FString */               __um(WaterCaustics_ReflectiveNormalScale_);                 // 0xA6F8   (0x0010)  
	float                                              Player_Current_Velocity;                                    // 0xA708   (0x0004)  
	float                                              Player_Max_Velocity_Threshold;                              // 0xA70C   (0x0004)  
	float                                              Adaptive_Screen_Res_Factor;                                 // 0xA710   (0x0004)  
	bool                                               Enable_Adaptive_Reflection_Res_Based_on_speed;              // 0xA714   (0x0001)  
	bool                                               Enable_Adaptive_Screen_Res_Based_on_Scene_UI_Res;           // 0xA715   (0x0001)  
	unsigned char                                      UnknownData07_5[0xA];                                       // 0xA716   (0x000A)  MISSED
	FSequence                                          Sequence;                                                   // 0xA720   (0x14C0)  
	SDK_UNDEFINED(16,2552) /* FString */               __um(Light_Look_At_Distance);                               // 0xBBE0   (0x0010)  
	bool                                               Enable_Adaptive_ISM_Render;                                 // 0xBBF0   (0x0001)  
	bool                                               Enable_Tick;                                                // 0xBBF1   (0x0001)  
	unsigned char                                      UnknownData08_5[0x2];                                       // 0xBBF2   (0x0002)  MISSED
	float                                              RTX_Tick_Interval;                                          // 0xBBF4   (0x0004)  
	SDK_UNDEFINED(16,2553) /* FString */               __um(Multi_Bounce_Interval);                                // 0xBBF8   (0x0010)  
	bool                                               RTX_Gate;                                                   // 0xBC08   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0xBC09   (0x0007)  MISSED
	SDK_UNDEFINED(16,2554) /* FString */               __um(Max_Under_Coat_Bounces_);                              // 0xBC10   (0x0010)  
	SDK_UNDEFINED(16,2555) /* FString */               __um(Enable_Shadow_Ray_);                                   // 0xBC20   (0x0010)  
	SDK_UNDEFINED(16,2556) /* FString */               __um(Shadow_Ray_TMax_);                                     // 0xBC30   (0x0010)  
	SDK_UNDEFINED(16,2557) /* FString */               __um(View_Culling);                                         // 0xBC40   (0x0010)  
	bool                                               Use_Adaptive_Water_Caustics_Map_Resolution;                 // 0xBC50   (0x0001)  
	unsigned char                                      UnknownData10_5[0x3];                                       // 0xBC51   (0x0003)  MISSED
	float                                              Use_Raster_Post_Process_Water_Caustics;                     // 0xBC54   (0x0004)  
	SDK_UNDEFINED(16,2558) /* FString */               __um(Remove_Invisible_BLAS_);                               // 0xBC58   (0x0010)  
	bool                                               Enable_SQ_Spotlight_Override;                               // 0xBC68   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0xBC69   (0x0007)  MISSED
	SDK_UNDEFINED(16,2559) /* FString */               __um(Down_SampleBloom_With_TAA_);                           // 0xBC70   (0x0010)  
	float                                              RT_UseDepthOffset;                                          // 0xBC80   (0x0004)  
	unsigned char                                      UnknownData12_5[0x4];                                       // 0xBC84   (0x0004)  MISSED
	SDK_UNDEFINED(16,2560) /* FString */               __um(Geometry_MaxBuiltPrimitivesPerFrame);                  // 0xBC88   (0x0010)  
	SDK_UNDEFINED(16,2561) /* FString */               __um(Enable_GI_In_Translucency);                            // 0xBC98   (0x0010)  
	SDK_UNDEFINED(16,2562) /* FString */               __um(CSM_Max_Cascade);                                      // 0xBCA8   (0x0010)  
	SDK_UNDEFINED(16,2563) /* FString */               __um(Enable_GI_in_Reflection);                              // 0xBCB8   (0x0010)  
	SDK_UNDEFINED(16,2564) /* FString */               __um(Reflection_GI_Denoise);                                // 0xBCC8   (0x0010)  
	SDK_UNDEFINED(16,2565) /* FString */               __um(Reflection_GI_Denois_Filter_Width);                    // 0xBCD8   (0x0010)  
	SDK_UNDEFINED(16,2566) /* FString */               __um(Reflection_Restir_GI);                                 // 0xBCE8   (0x0010)  
	SDK_UNDEFINED(16,2567) /* FString */               __um(Reflection_GI_Screen_Percentage);                      // 0xBCF8   (0x0010)  
	SDK_UNDEFINED(16,2568) /* FString */               __um(Contact_Shadows_);                                     // 0xBD08   (0x0010)  
	float                                              RT_UseDitherTAA;                                            // 0xBD18   (0x0004)  
	float                                              Use_RT_Roughness;                                           // 0xBD1C   (0x0004)  
	float                                              Point_Light_Specular_Scale_Override;                        // 0xBD20   (0x0004)  
	float                                              Spot_Light_Specular_Scale_Override;                         // 0xBD24   (0x0004)  
	bool                                               Use_Spot_Point_Light_specular_override;                     // 0xBD28   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0xBD29   (0x0007)  MISSED
	SDK_UNDEFINED(16,2569) /* FString */               __um(EpsilonArea);                                          // 0xBD30   (0x0010)  


	/// Functions
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.OnlyLeaveKeySpotLightInSQ
	// void OnlyLeaveKeySpotLightInSQ(bool Enable Spot Light Override);                                                      // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.Use Adaptive ISM Render
	// void Use Adaptive ISM Render();                                                                                       // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.RTX Override Light Parameters
	// void RTX Override Light Parameters();                                                                                 // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.UpdateRTX
	// void UpdateRTX();                                                                                                     // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.UpdateDLSS 
	// void UpdateDLSS ();                                                                                                   // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.Use Adaptive Reflection and Caustics Map Resolution
	// void Use Adaptive Reflection and Caustics Map Resolution();                                                           // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.ExcludeFeature
	// void ExcludeFeature();                                                                                                // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.Force Override RT Parameters  On Screen Res
	// void Force Override RT Parameters  On Screen Res();                                                                   // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.Force Override RT Parameters DLAA Quality
	// void Force Override RT Parameters DLAA Quality();                                                                     // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.Force Override RT Parameters  On AA Status
	// void Force Override RT Parameters  On AA Status();                                                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.SetText Display
	// void SetText Display();                                                                                               // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.Ini RT Parameter
	// void Ini RT Parameter(FRT_Parameters RT_Parameters);                                                                  // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.Construct RT Parameter
	// void Construct RT Parameter();                                                                                        // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.RT_Custom_Preset
	// void RT_Custom_Preset(FRT_Parameters RT_Parameters);                                                                  // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.InpActEvt_H_K2Node_InputKeyEvent
	// void InpActEvt_H_K2Node_InputKeyEvent(FKey Key);                                                                      // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.InpActEvt_K_K2Node_InputKeyEvent
	// void InpActEvt_K_K2Node_InputKeyEvent(FKey Key);                                                                      // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.RTX_Switch_Preset_From_UI
	// void RTX_Switch_Preset_From_UI(TEnumAsByte<Enum_RT_Quality_Preset> RTX Preset);                                       // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.RTX_Switch_DLSS_From_UI
	// void RTX_Switch_DLSS_From_UI(FString AA Method, FString DLSS Quality, bool Enable Override From UI);                  // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.RTX_Force_Override
	// void RTX_Force_Override();                                                                                            // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.CustomEvent
	// void CustomEvent(bool bRayTracing, int32_t SettingValue);                                                             // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x15dd8c0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RT_Quality_Parameters.BP_RT_Quality_Parameters_C.ExecuteUbergraph_BP_RT_Quality_Parameters
	// void ExecuteUbergraph_BP_RT_Quality_Parameters(int32_t EntryPoint);                                                   // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/BP_RTX/BP_RTX_Parameter_Interface.BP_RTX_Parameter_Interface_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBP_RTX_Parameter_Interface_C : public UInterface
{ 
public:


	/// Functions
	// Function /Game/Blueprint/BP_RTX/BP_RTX_Parameter_Interface.BP_RTX_Parameter_Interface_C.RTX_Switch_DLSS_From_UI
	// void RTX_Switch_DLSS_From_UI(FString AA Method, FString DLSS Quality, bool Enable Override From UI);                  // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RTX_Parameter_Interface.BP_RTX_Parameter_Interface_C.RTX_Switch_Preset_From_UI
	// void RTX_Switch_Preset_From_UI(TEnumAsByte<Enum_RT_Quality_Preset> RTX Preset);                                       // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_RTX_Parameter_Interface.BP_RTX_Parameter_Interface_C.RTX_Force_Override
	// void RTX_Force_Override();                                                                                            // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprint/BP_RTX/BP_Reflection.BP_Reflection_C
/// Size: 0x0020 (0x000220 - 0x000240)
class ABP_Reflection_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	TArray<class AReflectionCapture*>                  All;                                                        // 0x0230   (0x0010)  


	/// Functions
	// Function /Game/Blueprint/BP_RTX/BP_Reflection.BP_Reflection_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_Reflection.BP_Reflection_C.Refresh
	// void Refresh();                                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_Reflection.BP_Reflection_C.OnReflection
	// void OnReflection();                                                                                                  // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/BP_RTX/BP_Reflection.BP_Reflection_C.ExecuteUbergraph_BP_Reflection
	// void ExecuteUbergraph_BP_Reflection(int32_t EntryPoint);                                                              // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/EnvInteractionSystem/GlobleFogControler/BP_Fill_Light_Controler.BP_Fill_Light_Controler_C
/// Size: 0x0048 (0x000220 - 0x000268)
class ABP_Fill_Light_Controler_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USpotLightComponent*                         SpotLight3;                                                 // 0x0228   (0x0008)  
	class USpotLightComponent*                         SpotLight2;                                                 // 0x0230   (0x0008)  
	class USpotLightComponent*                         SpotLight1;                                                 // 0x0238   (0x0008)  
	class USpotLightComponent*                         SpotLight;                                                  // 0x0240   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0248   (0x0008)  
	float                                              Timeline_0_NewTrack_0_B6274395407BEEB3A715CE9CACEEC703;     // 0x0250   (0x0004)  
	SDK_UNDEFINED(1,2570) /* TEnumAsByte<ETimelineDirection> */ __um(Timeline_0__Direction_B6274395407BEEB3A715CE9CACEEC703); // 0x0254   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0255   (0x0003)  MISSED
	class UTimelineComponent*                          Timeline;                                                   // 0x0258   (0x0008)  
	bool                                               Light_Switch;                                               // 0x0260   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0261   (0x0003)  MISSED
	float                                              FillLight_Intensity;                                        // 0x0264   (0x0004)  


	/// Functions
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleFogControler/BP_Fill_Light_Controler.BP_Fill_Light_Controler_C.Timeline_0__FinishedFunc
	// void Timeline_0__FinishedFunc();                                                                                      // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleFogControler/BP_Fill_Light_Controler.BP_Fill_Light_Controler_C.Timeline_0__UpdateFunc
	// void Timeline_0__UpdateFunc();                                                                                        // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleFogControler/BP_Fill_Light_Controler.BP_Fill_Light_Controler_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleFogControler/BP_Fill_Light_Controler.BP_Fill_Light_Controler_C.OnPaladinPlayModeChangedDelegate_Event
	// void OnPaladinPlayModeChangedDelegate_Event(FName ModeName);                                                          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleFogControler/BP_Fill_Light_Controler.BP_Fill_Light_Controler_C.Refresh
	// void Refresh();                                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleFogControler/BP_Fill_Light_Controler.BP_Fill_Light_Controler_C.ExecuteUbergraph_BP_Fill_Light_Controler
	// void ExecuteUbergraph_BP_Fill_Light_Controler(int32_t EntryPoint);                                                    // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/Benchmark/BenchmarkGraphWidgetBlueprint.BenchmarkGraphWidgetBlueprint_C
/// Size: 0x0058 (0x000270 - 0x0002C8)
class UBenchmarkGraphWidgetBlueprint_C : public UPaladinUIBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class UImage*                                      BackgroundImage;                                            // 0x0278   (0x0008)  
	class UCanvasPanelWithNavigation*                  CanvasForClose;                                             // 0x0280   (0x0008)  
	class USimpleButton_C*                             Close;                                                      // 0x0288   (0x0008)  
	class USimpleTimeSeriesPlot*                       MainSimpleTimeSeriesPlot;                                   // 0x0290   (0x0008)  
	class UTextBlock*                                  TextBlock;                                                  // 0x0298   (0x0008)  
	FName                                              SeriesIdMain;                                               // 0x02A0   (0x0008)  
	float                                              CurrentFrameTime;                                           // 0x02A8   (0x0004)  
	FName                                              SeriesIdAverage;                                            // 0x02AC   (0x0008)  
	float                                              FPSSum;                                                     // 0x02B4   (0x0004)  
	float                                              FPS;                                                        // 0x02B8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x02BC   (0x0004)  MISSED
	class ABenchmarkGatherActor_Blueprint_C*           BenchGather;                                                // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/Blueprint/Benchmark/BenchmarkGraphWidgetBlueprint.BenchmarkGraphWidgetBlueprint_C.OnPaladinUIEvent
	// bool OnPaladinUIEvent(EPaladinUIKeyControlType UIKeyControlType, EUINavigation UINavigation);                         // [0x15dd8c0] BlueprintCosmetic|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGraphWidgetBlueprint.BenchmarkGraphWidgetBlueprint_C.Init
	// void Init();                                                                                                          // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGraphWidgetBlueprint.BenchmarkGraphWidgetBlueprint_C.LoadResult
	// void LoadResult();                                                                                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGraphWidgetBlueprint.BenchmarkGraphWidgetBlueprint_C.GetText
	// FText GetText();                                                                                                      // [0x15dd8c0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprint/Benchmark/BenchmarkGraphWidgetBlueprint.BenchmarkGraphWidgetBlueprint_C.Construct
	// void Construct();                                                                                                     // [0x15dd8c0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGraphWidgetBlueprint.BenchmarkGraphWidgetBlueprint_C.ExecuteUbergraph_BenchmarkGraphWidgetBlueprint
	// void ExecuteUbergraph_BenchmarkGraphWidgetBlueprint(int32_t EntryPoint);                                              // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/Benchmark/Benchmark.Benchmark_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBenchmark_C : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Game/Blueprint/Benchmark/Benchmark.Benchmark_C.GetBenchmarkGatherActor
	// void GetBenchmarkGatherActor(class UObject* __WorldContext, class ABenchmarkGatherActor_Blueprint_C*& BenchmarkGatherActor); // [0x15dd8c0] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/Benchmark.Benchmark_C.StopBenchmark
	// void StopBenchmark(class UObject* __WorldContext);                                                                    // [0x15dd8c0] Static|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/Benchmark.Benchmark_C.StartBenchmark
	// void StartBenchmark(class UObject* __WorldContext);                                                                   // [0x15dd8c0] Static|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/Benchmark.Benchmark_C.ShowBenchmarkResult
	// void ShowBenchmarkResult(class UObject* __WorldContext, class UBenchmarkGraphWidgetBlueprint_C*& BenchmarkUI);        // [0x15dd8c0] Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C
/// Size: 0x0028 (0x000220 - 0x000248)
class ABenchmarkGatherActor_Blueprint_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot1;                                          // 0x0228   (0x0008)  
	bool                                               bRun;                                                       // 0x0230   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0231   (0x0007)  MISSED
	TArray<float>                                      FrametimeArray;                                             // 0x0238   (0x0010)  


	/// Functions
	// Function /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C.HideResult
	// void HideResult();                                                                                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C.ShowResult
	// void ShowResult(class UBenchmarkGraphWidgetBlueprint_C*& BenchmarkUI);                                                // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C.Start
	// void Start();                                                                                                         // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C.Stop
	// void Stop();                                                                                                          // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/Benchmark/BenchmarkGatherActor_Blueprint.BenchmarkGatherActor_Blueprint_C.ExecuteUbergraph_BenchmarkGatherActor_Blueprint
	// void ExecuteUbergraph_BenchmarkGatherActor_Blueprint(int32_t EntryPoint);                                             // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C
/// Size: 0x01E8 (0x000220 - 0x000408)
class ABP_AquaticSurface_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UBoxComponent*                               InteractionShape;                                           // 0x0228   (0x0008)  
	class UStaticMeshComponent*                        PlaneUnderWater;                                            // 0x0230   (0x0008)  
	class UStaticMeshComponent*                        PlaneOverWater;                                             // 0x0238   (0x0008)  
	class UBoxComponent*                               PostProcessShape;                                           // 0x0240   (0x0008)  
	class UBoxComponent*                               ReflectionUnder;                                            // 0x0248   (0x0008)  
	class UBoxComponent*                               ReflectionOver;                                             // 0x0250   (0x0008)  
	class UBillboardComponent*                         ReflectionBillboad;                                         // 0x0258   (0x0008)  
	class USceneComponent*                             root;                                                       // 0x0260   (0x0008)  
	class UStaticMeshComponent*                        PostProcessMesh;                                            // 0x0268   (0x0008)  
	class UPostProcessComponent*                       PostProcess;                                                // 0x0270   (0x0008)  
	class UMaterialInstance*                           OverWaterMaterial;                                          // 0x0278   (0x0008)  
	class UMaterialInstance*                           OptimizationWaterMaterial;                                  // 0x0280   (0x0008)  
	class UMaterialInstance*                           UltimateWaterMaterial;                                      // 0x0288   (0x0008)  
	class UMaterialInstance*                           UnderWaterMaterial;                                         // 0x0290   (0x0008)  
	class UMaterialInstance*                           VolumeMaterial;                                             // 0x0298   (0x0008)  
	class UTexture*                                    ReflectionHDR;                                              // 0x02A0   (0x0008)  
	FVector                                            VolumeBoxExtend;                                            // 0x02A8   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x02B4   (0x0004)  MISSED
	class UMaterialInstanceDynamic*                    OverWaterMaterialInstance;                                  // 0x02B8   (0x0008)  
	class UMaterialInstanceDynamic*                    UnderWaterMaterialInstance;                                 // 0x02C0   (0x0008)  
	class USceneCaptureComponentCube*                  ReflectionCache;                                            // 0x02C8   (0x0008)  
	bool                                               Reconstruct;                                                // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	class ABP_AquaticRefletion_C*                      ReflectionExternal;                                         // 0x02D8   (0x0008)  
	class UTexture*                                    StaticReflectionCubemap;                                    // 0x02E0   (0x0008)  
	TArray<class AActor*>                              HiddenInReflection;                                         // 0x02E8   (0x0010)  
	float                                              ReflectionCaptureDelay;                                     // 0x02F8   (0x0004)  
	FVector                                            ReflectionLocation;                                         // 0x02FC   (0x000C)  
	FVector                                            ReflectionBoxOverExtend;                                    // 0x0308   (0x000C)  
	FVector                                            ReflectionBoxOverLocation;                                  // 0x0314   (0x000C)  
	FVector                                            ReflectionBoxUnderExtend;                                   // 0x0320   (0x000C)  
	FVector                                            ReflectionBoxUnderLocation;                                 // 0x032C   (0x000C)  
	FVector                                            VolumeBoxLocation;                                          // 0x0338   (0x000C)  
	float                                              VolumeFogDensity;                                           // 0x0344   (0x0004)  
	float                                              VolumeFogBase;                                              // 0x0348   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x034C   (0x0004)  MISSED
	class UMaterialInstanceDynamic*                    VolumeMaterialInstance;                                     // 0x0350   (0x0008)  
	float                                              BuoyancyAngularDamping;                                     // 0x0358   (0x0004)  
	float                                              BuoyancyLinearDamping;                                      // 0x035C   (0x0004)  
	class ABP_AquaticSimulation_C*                     AquaticSimulation;                                          // 0x0360   (0x0008)  
	float                                              Specular;                                                   // 0x0368   (0x0004)  
	float                                              BlendDepth;                                                 // 0x036C   (0x0004)  
	float                                              EdgeOpacity;                                                // 0x0370   (0x0004)  
	float                                              FakeReflection;                                             // 0x0374   (0x0004)  
	float                                              NormalStrength;                                             // 0x0378   (0x0004)  
	float                                              InteractionNormal;                                          // 0x037C   (0x0004)  
	float                                              Refraction;                                                 // 0x0380   (0x0004)  
	float                                              OpacitySoftness;                                            // 0x0384   (0x0004)  
	FLinearColor                                       BaseColor;                                                  // 0x0388   (0x0010)  
	FLinearColor                                       DeepColor;                                                  // 0x0398   (0x0010)  
	FLinearColor                                       RayTraceBaseColor;                                          // 0x03A8   (0x0010)  
	bool                                               OptimizeWaterMat;                                           // 0x03B8   (0x0001)  
	bool                                               NotAllowModifyFakeReflection;                               // 0x03B9   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x03BA   (0x0006)  MISSED
	FTimerHandle                                       SearchBossTimer;                                            // 0x03C0   (0x0008)  
	bool                                               FindBoss;                                                   // 0x03C8   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x03C9   (0x0003)  MISSED
	FLinearColor                                       RayTraceBaseColorFresnel;                                   // 0x03CC   (0x0010)  
	float                                              RayTraceOpacity;                                            // 0x03DC   (0x0004)  
	float                                              RayTraceRefraction;                                         // 0x03E0   (0x0004)  
	float                                              RayTraceNormal;                                             // 0x03E4   (0x0004)  
	float                                              RayTraceFresnelPower;                                       // 0x03E8   (0x0004)  
	float                                              NormalTiling;                                               // 0x03EC   (0x0004)  
	float                                              RaytraceMetallic;                                           // 0x03F0   (0x0004)  
	float                                              RasterMetallic;                                             // 0x03F4   (0x0004)  
	float                                              WorldPositionOffset;                                        // 0x03F8   (0x0004)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x03FC   (0x0004)  MISSED
	class ABP_AquaticManager_C*                        AquaticManager;                                             // 0x0400   (0x0008)  


	/// Functions
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.GetHeight
	// void GetHeight(float& Height);                                                                                        // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.OnEndOverlapInteraction
	// void OnEndOverlapInteraction(class AActor* OtherAtor);                                                                // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.OnBeginOverlapInteraction
	// void OnBeginOverlapInteraction(class AActor* OtherActor);                                                             // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.OnEndOverlapBuoyancy
	// void OnEndOverlapBuoyancy(class AActor* OtherAtor);                                                                   // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.SetInteraction
	// void SetInteraction(class UTexture* value);                                                                           // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.OnBeginOverlapBuoyancy
	// void OnBeginOverlapBuoyancy(class AActor* OtherActor);                                                                // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.BoxReflection
	// void BoxReflection(class UBoxComponent* BoxShape, class UMaterialInstanceDynamic* UseMaterial, FVector BoxExtent, FVector BoxLocation, bool Over); // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.InitMaterials
	// void InitMaterials();                                                                                                 // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.UpdatePostProcessShape
	// void UpdatePostProcessShape();                                                                                        // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.UpdateReflectionShape
	// void UpdateReflectionShape();                                                                                         // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.UpdateVolume
	// void UpdateVolume();                                                                                                  // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.CaptureEvent
	// void CaptureEvent();                                                                                                  // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x15dd8c0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature
	// void BndEvt__PostProcessShape_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__InteractionShape_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x15dd8c0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	// void BndEvt__InteractionShape_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.SearchBoss
	// void SearchBoss();                                                                                                    // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.OnPaladinRestartFightDelegate_Event
	// void OnPaladinRestartFightDelegate_Event(FName QuestID, bool bBossBattle);                                            // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSurface.BP_AquaticSurface_C.ExecuteUbergraph_BP_AquaticSurface
	// void ExecuteUbergraph_BP_AquaticSurface(int32_t EntryPoint);                                                          // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C
/// Size: 0x010A (0x000408 - 0x000512)
class ABP_AquaticSurface_Lake_C : public ABP_AquaticSurface_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0408   (0x0008)  
	class APaladinHero*                                Heroine1_Inst;                                              // 0x0410   (0x0008)  
	SDK_UNDEFINED(80,2571) /* TMap<FString, TEnumAsByte<E_CharacterName>> */ __um(dict_CharacName);                // 0x0418   (0x0050)  
	class UCPNT_FormalEnvTest_C*                       Heroine1_CPNT;                                              // 0x0468   (0x0008)  
	bool                                               inWater_Heroine1;                                           // 0x0470   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0471   (0x0007)  MISSED
	FTimerHandle                                       Heroine1_TimerHandle;                                       // 0x0478   (0x0008)  
	class APaladinHero*                                Hero1_Inst;                                                 // 0x0480   (0x0008)  
	class UCPNT_FormalEnvTest_C*                       Hero1_CPNT;                                                 // 0x0488   (0x0008)  
	bool                                               inWater_Hero1;                                              // 0x0490   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0491   (0x0007)  MISSED
	FTimerHandle                                       Hero1_TimerHandle;                                          // 0x0498   (0x0008)  
	class APaladinHero*                                Heroine2_Inst;                                              // 0x04A0   (0x0008)  
	class UCPNT_FormalEnvTest_C*                       Heroine2_CPNT;                                              // 0x04A8   (0x0008)  
	bool                                               inWater_Heroine2;                                           // 0x04B0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x04B1   (0x0007)  MISSED
	FTimerHandle                                       Heroine2_TimerHandle;                                       // 0x04B8   (0x0008)  
	class APaladinHero*                                Hero2_Inst;                                                 // 0x04C0   (0x0008)  
	class UCPNT_FormalEnvTest_C*                       Hero2_CPNT;                                                 // 0x04C8   (0x0008)  
	bool                                               inWater_Hero2;                                              // 0x04D0   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x04D1   (0x0007)  MISSED
	FTimerHandle                                       Hero2_TimerHandle;                                          // 0x04D8   (0x0008)  
	class UParticleSystem*                             P_JumpIn;                                                   // 0x04E0   (0x0008)  
	class UParticleSystem*                             P_JumpOut;                                                  // 0x04E8   (0x0008)  
	class UParticleSystem*                             P_RunInWater;                                               // 0x04F0   (0x0008)  
	class ABP_AquaticSimulation_C*                     InteractionWaterManager;                                    // 0x04F8   (0x0008)  
	bool                                               HeroInWater;                                                // 0x0500   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0501   (0x0003)  MISSED
	float                                              InteractionAreaSize;                                        // 0x0504   (0x0004)  
	class AActor*                                      Actor;                                                      // 0x0508   (0x0008)  
	ESpecialEnvironment                                SpecialEnviroment;                                          // 0x0510   (0x0001)  
	bool                                               EnableSplash;                                               // 0x0511   (0x0001)  


	/// Functions
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.CheckCharacterInside
	// void CheckCharacterInside(bool Character);                                                                            // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.FUNC_getTouchLoc
	// void FUNC_getTouchLoc(class APaladinHero* CharacterInst, FVector& Location);                                          // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.Evt_Heroine1_updLoc
	// void Evt_Heroine1_updLoc();                                                                                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.BndEvt__InteractionShape_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__InteractionShape_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x15dd8c0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.BndEvt__InteractionShape_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
	// void BndEvt__InteractionShape_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.Evt_Hero1_updLoc
	// void Evt_Hero1_updLoc();                                                                                              // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.Evt_Heroine2_updLoc
	// void Evt_Heroine2_updLoc();                                                                                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.Evt_Hero2_updLoc
	// void Evt_Hero2_updLoc();                                                                                              // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	// void BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x15dd8c0] HasOutParms|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	// void BndEvt__PlaneOverWater_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0x15dd8c0] BlueprintEvent       
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.SearchHero
	// void SearchHero();                                                                                                    // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Demo/Templates/Lake/BP_AquaticSurface_Lake.BP_AquaticSurface_Lake_C.ExecuteUbergraph_BP_AquaticSurface_Lake
	// void ExecuteUbergraph_BP_AquaticSurface_Lake(int32_t EntryPoint);                                                     // [0x15dd8c0] Final|HasDefaults    
};

/// Struct /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BS_AquaticInteractionData.BS_AquaticInteractionData
/// Size: 0x0020 (0x000000 - 0x000020)
struct FBS_AquaticInteractionData
{ 
	float                                              Dynamic_15_2B37AF5E4D20E2DF8559718620844133;                // 0x0000   (0x0004)  
	float                                              Force_10_2F4FD72F49BCBB81FA9729A268993C4D;                  // 0x0004   (0x0004)  
	float                                              Torque_26_BFFA81594F81A9D829E82083436A0590;                 // 0x0008   (0x0004)  
	float                                              Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B;                 // 0x000C   (0x0004)  
	float                                              HeightFade_33_F441FDA8430DC576749A3EB5DBED6D8D;             // 0x0010   (0x0004)  
	float                                              Importance_14_B5BEDFB9418E67A384EBA79581DA1AA7;             // 0x0014   (0x0004)  
	float                                              MaxVelocity_21_6499E59046192D125441009588B75BF6;            // 0x0018   (0x0004)  
	float                                              MaxDistance_29_6BEF08A8488CE3949B1C5C8AEB936920;            // 0x001C   (0x0004)  
};

/// Struct /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BS_AquaticInteraction.BS_AquaticInteraction
/// Size: 0x0050 (0x000000 - 0x000050)
struct FBS_AquaticInteraction
{ 
	class USceneComponent*                             Owner_25_3A6C815B42EBA54B541ACB86F6EEFB72;                  // 0x0000   (0x0008)  
	FVector                                            Location_3_71138D054985852AB5FB0FB5A877456B;                // 0x0008   (0x000C)  
	FRotator                                           Rotation_32_8ECAA5CB4DEA3542181A9E8834A54D71;               // 0x0014   (0x000C)  
	float                                              TimeToEnd_22_BB29A2AD4316564D628DDF8B4A4F7B82;              // 0x0020   (0x0004)  
	FBS_AquaticInteractionData                         Data_21_A16BE8584186AE436372DA9C1708BC4C;                   // 0x0024   (0x0020)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0044   (0x0004)  MISSED
	class AActor*                                      Surface_41_47A741AB49BD9C26C2B535A8C3CCC99C;                // 0x0048   (0x0008)  
};

/// Class /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C
/// Size: 0x00E8 (0x000220 - 0x000308)
class ABP_AquaticSimulation_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UBoxComponent*                               Volume;                                                     // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	int32_t                                            FrameIndex;                                                 // 0x0238   (0x0004)  
	float                                              TimeAccumulator;                                            // 0x023C   (0x0004)  
	int32_t                                            AreaSize;                                                   // 0x0240   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0244   (0x0004)  MISSED
	class UMaterialInstanceDynamic*                    SimulationInstance;                                         // 0x0248   (0x0008)  
	class UMaterialInstanceDynamic*                    SplatInstance;                                              // 0x0250   (0x0008)  
	TArray<class ABP_AquaticSurface_C*>                AquaticSurfaces;                                            // 0x0258   (0x0010)  
	int32_t                                            TextureResolution;                                          // 0x0268   (0x0004)  
	FVector                                            TargetPoint;                                                // 0x026C   (0x000C)  
	TArray<FBS_AquaticInteraction>                     Interactions;                                               // 0x0278   (0x0010)  
	int32_t                                            RemoveInteraction;                                          // 0x0288   (0x0004)  
	float                                              TextureToWorld;                                             // 0x028C   (0x0004)  
	FVector                                            HalfSize;                                                   // 0x0290   (0x000C)  
	int32_t                                            InterpStepSize;                                             // 0x029C   (0x0004)  
	float                                              AreaSizeInv;                                                // 0x02A0   (0x0004)  
	FVector2D                                          LocationShift;                                              // 0x02A4   (0x0008)  
	FVector2D                                          LocationShiftPrev;                                          // 0x02AC   (0x0008)  
	float                                              TextureResolutionInv;                                       // 0x02B4   (0x0004)  
	float                                              InterpSpeed;                                                // 0x02B8   (0x0004)  
	float                                              WorldToTexture;                                             // 0x02BC   (0x0004)  
	float                                              UpdateRate;                                                 // 0x02C0   (0x0004)  
	int32_t                                            MaxInterations;                                             // 0x02C4   (0x0004)  
	float                                              MaxTimeAccumulator;                                         // 0x02C8   (0x0004)  
	float                                              AnimationRate;                                              // 0x02CC   (0x0004)  
	bool                                               DrawDebug;                                                  // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x02D1   (0x0003)  MISSED
	int32_t                                            MinCameraDistance;                                          // 0x02D4   (0x0004)  
	float                                              WaveTravelSpeed;                                            // 0x02D8   (0x0004)  
	float                                              WaveDamping;                                                // 0x02DC   (0x0004)  
	float                                              WaveNormalScale;                                            // 0x02E0   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x02E4   (0x0004)  MISSED
	class UTextureRenderTarget2D*                      Texture1;                                                   // 0x02E8   (0x0008)  
	class UTextureRenderTarget2D*                      Texture2;                                                   // 0x02F0   (0x0008)  
	class UTextureRenderTarget2D*                      Texture3;                                                   // 0x02F8   (0x0008)  
	bool                                               EnableInteraction;                                          // 0x0300   (0x0001)  
	bool                                               EnablePrintString;                                          // 0x0301   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x0302   (0x0002)  MISSED
	int32_t                                            HeroInWaterNum;                                             // 0x0304   (0x0004)  


	/// Functions
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.Initialize
	// void Initialize();                                                                                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.NewFunction
	// void NewFunction();                                                                                                   // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.AddInteraction
	// void AddInteraction(FBS_AquaticInteractionData Interaction, FVector Location, float Duration);                        // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.SetTargetPoint
	// void SetTargetPoint(FVector TargetLocation, float InterpSpeed, float MaxDistance);                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.RemoveInteractionFinished
	// void RemoveInteractionFinished();                                                                                     // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.UpdateRenderPosition
	// void UpdateRenderPosition();                                                                                          // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.UpdateInteractionTime
	// void UpdateInteractionTime(int32_t Index, float DeltaTime, bool& Draw);                                               // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.RemoveInteractionActor
	// void RemoveInteractionActor(class UBP_AquaticInteraction_C* Interaction Actor);                                       // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.AddInteractionActor
	// void AddInteractionActor(class UBP_AquaticInteraction_C* Interaction, class ABP_AquaticSurface_C* Surface);           // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.UpdateInteraction
	// void UpdateInteraction(class UCanvas* Canvas, FVector2D ScreenSize, int32_t Interaction, float DeltaTime);            // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.GetLastHeight
	// void GetLastHeight(int32_t NumFramesOld, class UTextureRenderTarget2D*& HeightRT);                                    // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.RefreshInitialize
	// void RefreshInitialize();                                                                                             // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.FindHeroInWater
	// void FindHeroInWater();                                                                                               // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticSimulation.BP_AquaticSimulation_C.ExecuteUbergraph_BP_AquaticSimulation
	// void ExecuteUbergraph_BP_AquaticSimulation(int32_t EntryPoint);                                                       // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticBuoyancy.BP_AquaticBuoyancy_C
/// Size: 0x003C (0x0000B0 - 0x0000EC)
class UBP_AquaticBuoyancy_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00B0   (0x0008)  
	class UStaticMeshComponent*                        CachedMesh;                                                 // 0x00B8   (0x0008)  
	class ABP_AquaticSurface_C*                        AquaticSurface;                                             // 0x00C0   (0x0008)  
	SDK_UNDEFINED(1,2572) /* TEnumAsByte<BuoyancyShape> */ __um(Shape);                                            // 0x00C8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00C9   (0x0003)  MISSED
	float                                              ShapeRadius;                                                // 0x00CC   (0x0004)  
	float                                              LinearDampingScale;                                         // 0x00D0   (0x0004)  
	float                                              AngularDampingScale;                                        // 0x00D4   (0x0004)  
	FVector                                            CenterOfMass;                                               // 0x00D8   (0x000C)  
	float                                              ForceScale;                                                 // 0x00E4   (0x0004)  
	float                                              FinalForce;                                                 // 0x00E8   (0x0004)  


	/// Functions
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.SetAquaticVolume
	// void SetAquaticVolume(class ABP_AquaticSurface_C* AquaticSurface);                                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.UpdateTickMode
	// void UpdateTickMode();                                                                                                // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.UpdateInFluid
	// void UpdateInFluid(float DeltaTime);                                                                                  // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.ExecuteUbergraph_BP_AquaticBuoyancy
	// void ExecuteUbergraph_BP_AquaticBuoyancy(int32_t EntryPoint);                                                         // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C
/// Size: 0x00DD (0x000220 - 0x0002FD)
class ABP_AquaticManager_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UBoxComponent*                               Volume;                                                     // 0x0228   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0230   (0x0008)  
	int32_t                                            AreaSize;                                                   // 0x0238   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x023C   (0x0004)  MISSED
	TArray<class ABP_AquaticSurface_C*>                AquaticSurfaces;                                            // 0x0240   (0x0010)  
	int32_t                                            TextureResolution;                                          // 0x0250   (0x0004)  
	float                                              TextureToWorld;                                             // 0x0254   (0x0004)  
	float                                              WorldToTexture;                                             // 0x0258   (0x0004)  
	FVector                                            TargetPoint;                                                // 0x025C   (0x000C)  
	TArray<FBS_AquaticInteraction>                     Interactions;                                               // 0x0268   (0x0010)  
	int32_t                                            RemoveInteraction;                                          // 0x0278   (0x0004)  
	float                                              AnimationRate;                                              // 0x027C   (0x0004)  
	class UMaterialInstanceDynamic*                    SimulationInstance;                                         // 0x0280   (0x0008)  
	float                                              WaveTravelSpeed;                                            // 0x0288   (0x0004)  
	float                                              WaveDamping;                                                // 0x028C   (0x0004)  
	float                                              WaveNormalScale;                                            // 0x0290   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0294   (0x0004)  MISSED
	class UMaterialInstanceDynamic*                    SplatInstance;                                              // 0x0298   (0x0008)  
	class UTextureRenderTarget2D*                      Texture1;                                                   // 0x02A0   (0x0008)  
	class UTextureRenderTarget2D*                      Texture2;                                                   // 0x02A8   (0x0008)  
	class UTextureRenderTarget2D*                      Texture3;                                                   // 0x02B0   (0x0008)  
	FVector                                            HalfSize;                                                   // 0x02B8   (0x000C)  
	int32_t                                            InterpStepSize;                                             // 0x02C4   (0x0004)  
	float                                              AreaSizeInv;                                                // 0x02C8   (0x0004)  
	FVector2D                                          LocationShift;                                              // 0x02CC   (0x0008)  
	FVector2D                                          LocationShiftPrev;                                          // 0x02D4   (0x0008)  
	float                                              TextureResolutionInv;                                       // 0x02DC   (0x0004)  
	float                                              InterpSpeed;                                                // 0x02E0   (0x0004)  
	bool                                               DrawDebug;                                                  // 0x02E4   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02E5   (0x0003)  MISSED
	int32_t                                            FrameIndex;                                                 // 0x02E8   (0x0004)  
	float                                              TimeAccumulator;                                            // 0x02EC   (0x0004)  
	float                                              UpdateRate;                                                 // 0x02F0   (0x0004)  
	int32_t                                            MaxInterations;                                             // 0x02F4   (0x0004)  
	float                                              MaxTimeAccumulator;                                         // 0x02F8   (0x0004)  
	bool                                               EnablePrintString;                                          // 0x02FC   (0x0001)  


	/// Functions
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.Initialize
	// void Initialize();                                                                                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.NewFunction
	// void NewFunction();                                                                                                   // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.AddInteraction
	// void AddInteraction(FBS_AquaticInteractionData Interaction, FVector Location, float Duration);                        // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.SetTargetPoint
	// void SetTargetPoint(FVector TargetLocation, float InterpSpeed, float MaxDistance);                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.RemoveInteractionFinished
	// void RemoveInteractionFinished();                                                                                     // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.UpdateRenderPosition
	// void UpdateRenderPosition();                                                                                          // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.UpdateInteractionTime
	// void UpdateInteractionTime(int32_t Index, float DeltaTime, bool& Draw);                                               // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.RemoveInteractionActor
	// void RemoveInteractionActor(class UBP_AquaticInteraction_C* Interaction Actor);                                       // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.AddInteractionActor
	// void AddInteractionActor(class UBP_AquaticInteraction_C* Interaction, class ABP_AquaticSurface_C* Surface);           // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.UpdateInteraction
	// void UpdateInteraction(class UCanvas* Canvas, FVector2D ScreenSize, int32_t Interaction, float DeltaTime);            // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.GetLastHeight
	// void GetLastHeight(int32_t NumFramesOld, class UTextureRenderTarget2D*& HeightRT);                                    // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticManager.BP_AquaticManager_C.ExecuteUbergraph_BP_AquaticManager
	// void ExecuteUbergraph_BP_AquaticManager(int32_t EntryPoint);                                                          // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticRefletion.BP_AquaticRefletion_C
/// Size: 0x000C (0x000238 - 0x000244)
class ABP_AquaticRefletion_C : public ASceneCaptureCube
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0238   (0x0008)  
	float                                              ReflectionCaptureDelay;                                     // 0x0240   (0x0004)  


	/// Functions
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticRefletion.BP_AquaticRefletion_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticRefletion.BP_AquaticRefletion_C.ExecuteUbergraph_BP_AquaticRefletion
	// void ExecuteUbergraph_BP_AquaticRefletion(int32_t EntryPoint);                                                        // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/EnvInteractionSystem/GlobleWindControler/BP_GlobleWindControler.BP_GlobleWindControler_C
/// Size: 0x0030 (0x000220 - 0x000250)
class ABP_GlobleWindControler_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	class AWindDirectionalSource*                      Wind;                                                       // 0x0230   (0x0008)  
	float                                              wind_Strength;                                              // 0x0238   (0x0004)  
	float                                              Wind_Speed;                                                 // 0x023C   (0x0004)  
	float                                              WindStrengthM;                                              // 0x0240   (0x0004)  
	float                                              WindSpeedM;                                                 // 0x0244   (0x0004)  
	class ABP_CheckPlayerInRoom_C*                     NewVar;                                                     // 0x0248   (0x0008)  


	/// Functions
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleWindControler/BP_GlobleWindControler.BP_GlobleWindControler_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleWindControler/BP_GlobleWindControler.BP_GlobleWindControler_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleWindControler/BP_GlobleWindControler.BP_GlobleWindControler_C.Refresh
	// void Refresh();                                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleWindControler/BP_GlobleWindControler.BP_GlobleWindControler_C.OnPaladinPlayModeChangedDelegate_Event
	// void OnPaladinPlayModeChangedDelegate_Event(FName ModeName);                                                          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/EnvInteractionSystem/GlobleWindControler/BP_GlobleWindControler.BP_GlobleWindControler_C.ExecuteUbergraph_BP_GlobleWindControler
	// void ExecuteUbergraph_BP_GlobleWindControler(int32_t EntryPoint);                                                     // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/ArtAssets/EnvCreateTools/Fog/BP/BP_SmokePlane.BP_SmokePlane_C
/// Size: 0x0078 (0x000230 - 0x0002A8)
class ABP_SmokePlane_C : public AStaticMeshActor
{ 
public:
	bool                                               FaceCamera;                                                 // 0x0230   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0231   (0x0003)  MISSED
	float                                              Yaw;                                                        // 0x0234   (0x0004)  
	class UMaterialInterface*                          faceCameraSomke;                                            // 0x0238   (0x0008)  
	class UMaterialInterface*                          ordinarySomke;                                              // 0x0240   (0x0008)  
	bool                                               DynamicMaterail;                                            // 0x0248   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0249   (0x0003)  MISSED
	FLinearColor                                       ColorA;                                                     // 0x024C   (0x0010)  
	FLinearColor                                       ColorB;                                                     // 0x025C   (0x0010)  
	FLinearColor                                       Speed1;                                                     // 0x026C   (0x0010)  
	FLinearColor                                       Speed2;                                                     // 0x027C   (0x0010)  
	float                                              CameraFadeDistance;                                         // 0x028C   (0x0004)  
	float                                              CloudSpeedX;                                                // 0x0290   (0x0004)  
	float                                              FadeDistance;                                               // 0x0294   (0x0004)  
	float                                              Opacity;                                                    // 0x0298   (0x0004)  
	float                                              SelectedUVNumSpeed;                                         // 0x029C   (0x0004)  
	float                                              TextureMipBias;                                             // 0x02A0   (0x0004)  
	float                                              Tilling;                                                    // 0x02A4   (0x0004)  


	/// Functions
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/Fog/BP/BP_SmokePlane.BP_SmokePlane_C.SetMaterailParameters
	// void SetMaterailParameters(class UMaterialInterface* Material, class UMaterialInterface*& DynamicMI);                 // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/Fog/BP/BP_SmokePlane.BP_SmokePlane_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C
/// Size: 0x00F9 (0x000220 - 0x000319)
class ABP_RiverTool_001_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             root;                                                       // 0x0228   (0x0008)  
	class USplineComponent*                            RiverSpline;                                                // 0x0230   (0x0008)  
	TArray<class USplineMeshComponent*>                SplineMeshArray;                                            // 0x0238   (0x0010)  
	class UStaticMesh*                                 RiverMesh;                                                  // 0x0248   (0x0008)  
	class UMaterialInstance*                           RiverMaterial;                                              // 0x0250   (0x0008)  
	float                                              SegmentScale;                                               // 0x0258   (0x0004)  
	float                                              RiverMeshSegmentSize;                                       // 0x025C   (0x0004)  
	float                                              Front_Fade;                                                 // 0x0260   (0x0004)  
	float                                              Back_Fade;                                                  // 0x0264   (0x0004)  
	SDK_UNDEFINED(16,2573) /* FMulticastInlineDelegate */ __um(ED_GetIn);                                          // 0x0268   (0x0010)  
	SDK_UNDEFINED(16,2574) /* FMulticastInlineDelegate */ __um(ED_GetOut);                                         // 0x0278   (0x0010)  
	class APaladinHero*                                Heroine1_Instance;                                          // 0x0288   (0x0008)  
	bool                                               inWater_Heroine1;                                           // 0x0290   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0291   (0x0003)  MISSED
	FVector                                            Touch_Location;                                             // 0x0294   (0x000C)  
	FTimerHandle                                       Heroine1_TimerHandle;                                       // 0x02A0   (0x0008)  
	SDK_UNDEFINED(16,2575) /* TArray<FString> */       __um(CharacterLst);                                         // 0x02A8   (0x0010)  
	class APaladinHero*                                Hero1_Instance;                                             // 0x02B8   (0x0008)  
	class APaladinHero*                                Heroine2_Instance;                                          // 0x02C0   (0x0008)  
	class APaladinHero*                                Hero2_Instance;                                             // 0x02C8   (0x0008)  
	bool                                               inWater_Hero1;                                              // 0x02D0   (0x0001)  
	bool                                               inWater_Heroine2;                                           // 0x02D1   (0x0001)  
	bool                                               inWater_Hero2;                                              // 0x02D2   (0x0001)  
	unsigned char                                      UnknownData01_5[0x5];                                       // 0x02D3   (0x0005)  MISSED
	FTimerHandle                                       Hero1_TimerHandle;                                          // 0x02D8   (0x0008)  
	FTimerHandle                                       Heroine2_TimerHandle;                                       // 0x02E0   (0x0008)  
	FTimerHandle                                       Hero2_TimerHandle;                                          // 0x02E8   (0x0008)  
	class UCPNT_FormalEnvTest_C*                       Heroine1_CPNT;                                              // 0x02F0   (0x0008)  
	class UCPNT_FormalEnvTest_C*                       Hero1_CPNT;                                                 // 0x02F8   (0x0008)  
	class UCPNT_FormalEnvTest_C*                       Heroine2_CPNT;                                              // 0x0300   (0x0008)  
	class UCPNT_FormalEnvTest_C*                       Hero2_CPNT;                                                 // 0x0308   (0x0008)  
	float                                              height_Decrease;                                            // 0x0310   (0x0004)  
	int32_t                                            Sort;                                                       // 0x0314   (0x0004)  
	ESpecialEnvironment                                CurSpecialEnvironment;                                      // 0x0318   (0x0001)  


	/// Functions
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.FUNC_getTouchLoc
	// void FUNC_getTouchLoc(class APaladinHero* Hero, class USplineComponent* Spline, FVector& Location, FVector& RotationVector); // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.FadeFunction
	// void FadeFunction(class USplineMeshComponent* SplineMesh, FName ParameterName, float ParameterValue);                 // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.ReceiveActorBeginOverlap
	// void ReceiveActorBeginOverlap(class AActor* OtherActor);                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.Evt_Refresh_GetIn
	// void Evt_Refresh_GetIn();                                                                                             // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.Evt_Refresh_GetOut
	// void Evt_Refresh_GetOut();                                                                                            // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.ReceiveActorEndOverlap
	// void ReceiveActorEndOverlap(class AActor* OtherActor);                                                                // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.Evt_Heroine1_updLoc
	// void Evt_Heroine1_updLoc();                                                                                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.Evt_Hero1_updLoc
	// void Evt_Hero1_updLoc();                                                                                              // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.Evt_Heroine2_updLoc
	// void Evt_Heroine2_updLoc();                                                                                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.Evt_Hero2_updLocation
	// void Evt_Hero2_updLocation();                                                                                         // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.ExecuteUbergraph_BP_RiverTool_001
	// void ExecuteUbergraph_BP_RiverTool_001(int32_t EntryPoint);                                                           // [0x15dd8c0] Final|HasDefaults    
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.ED_GetOut__DelegateSignature
	// void ED_GetOut__DelegateSignature();                                                                                  // [0x15dd8c0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/EnvCreateTools/RiverTool/BP_RiverTool_001.BP_RiverTool_001_C.ED_GetIn__DelegateSignature
	// void ED_GetIn__DelegateSignature();                                                                                   // [0x15dd8c0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Blueprint/ArtAssets/char/light/BP_getLightPosition.BP_getLightPosition_C
/// Size: 0x0061 (0x000220 - 0x000281)
class ABP_getLightPosition_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	bool                                               UsePointLight;                                              // 0x0230   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0231   (0x0007)  MISSED
	SDK_UNDEFINED(16,2576) /* FString */               __um(TheStartOfPointLightName);                             // 0x0238   (0x0010)  
	class UMaterialInstanceDynamic*                    hairMaterialInstance;                                       // 0x0248   (0x0008)  
	float                                              PointLight_sphereCollisionRadius;                           // 0x0250   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0254   (0x0004)  MISSED
	TArray<class ATriggerSphere*>                      getLocaitionCollsionLight;                                  // 0x0258   (0x0010)  
	class ADirectionalLight*                           currentDirectionalLight;                                    // 0x0268   (0x0008)  
	TArray<class UClass*>                              ParentActor;                                                // 0x0270   (0x0010)  
	bool                                               OnlyNoShadow;                                               // 0x0280   (0x0001)  


	/// Functions
	// Function /Game/Blueprint/ArtAssets/char/light/BP_getLightPosition.BP_getLightPosition_C.UserConstructionScript
	// void UserConstructionScript();                                                                                        // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_getLightPosition.BP_getLightPosition_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_getLightPosition.BP_getLightPosition_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_getLightPosition.BP_getLightPosition_C.createPointLightCollision
	// void createPointLightCollision();                                                                                     // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_getLightPosition.BP_getLightPosition_C.clearPointLightCollision
	// void clearPointLightCollision();                                                                                      // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_getLightPosition.BP_getLightPosition_C.ExecuteUbergraph_BP_getLightPosition
	// void ExecuteUbergraph_BP_getLightPosition(int32_t EntryPoint);                                                        // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/ArtAssets/char/light/BP_triggerSphereLight.BP_triggerSphereLight_C
/// Size: 0x0020 (0x000228 - 0x000248)
class ABP_triggerSphereLight_C : public ATriggerSphere
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0228   (0x0008)  
	class ABP_getLightPosition_C*                      bP_getLightPositionRef;                                     // 0x0230   (0x0008)  
	bool                                               tickSetup;                                                  // 0x0238   (0x0001)  
	bool                                               tickRuntime;                                                // 0x0239   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x023A   (0x0002)  MISSED
	FVector                                            Vector;                                                     // 0x023C   (0x000C)  


	/// Functions
	// Function /Game/Blueprint/ArtAssets/char/light/BP_triggerSphereLight.BP_triggerSphereLight_C.CustomEvent
	// void CustomEvent(class AActor* OverlappedActor, class AActor* OtherActor);                                            // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_triggerSphereLight.BP_triggerSphereLight_C.CustomEvent
	// void CustomEvent(class AActor* OverlappedActor, class AActor* OtherActor);                                            // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_triggerSphereLight.BP_triggerSphereLight_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_triggerSphereLight.BP_triggerSphereLight_C.CustomEvent
	// void CustomEvent();                                                                                                   // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/light/BP_triggerSphereLight.BP_triggerSphereLight_C.ExecuteUbergraph_BP_triggerSphereLight
	// void ExecuteUbergraph_BP_triggerSphereLight(int32_t EntryPoint);                                                      // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/ArtAssets/char/transluceShadow/BP_setTranslucentShadow.BP_setTranslucentShadow_C
/// Size: 0x0024 (0x000220 - 0x000244)
class ABP_setTranslucentShadow_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	int32_t                                            setOuterDistance;                                           // 0x0230   (0x0004)  
	int32_t                                            setInnerDistance;                                           // 0x0234   (0x0004)  
	int32_t                                            setVolumeDim;                                               // 0x0238   (0x0004)  
	int32_t                                            OpenBlur;                                                   // 0x023C   (0x0004)  
	float                                              mfov;                                                       // 0x0240   (0x0004)  


	/// Functions
	// Function /Game/Blueprint/ArtAssets/char/transluceShadow/BP_setTranslucentShadow.BP_setTranslucentShadow_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/ArtAssets/char/transluceShadow/BP_setTranslucentShadow.BP_setTranslucentShadow_C.ExecuteUbergraph_BP_setTranslucentShadow
	// void ExecuteUbergraph_BP_setTranslucentShadow(int32_t EntryPoint);                                                    // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticInteraction.BP_AquaticInteraction_C
/// Size: 0x0031 (0x0001F0 - 0x000221)
class UBP_AquaticInteraction_C : public USceneComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01F0   (0x0008)  
	FBS_AquaticInteractionData                         Data;                                                       // 0x01F8   (0x0020)  
	class ABP_PaladinHero_C*                           ComponentOwner;                                             // 0x0218   (0x0008)  
	bool                                               IsOwnerControlled;                                          // 0x0220   (0x0001)  


	/// Functions
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticInteraction.BP_AquaticInteraction_C.isControlledPawn
	// void isControlledPawn(bool& Return Value);                                                                            // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticInteraction.BP_AquaticInteraction_C.GetTransform
	// void GetTransform(FVector& Location, FRotator& Rotation);                                                             // [0x15dd8c0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticInteraction.BP_AquaticInteraction_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticInteraction.BP_AquaticInteraction_C.Evt_onSwitchHero
	// void Evt_onSwitchHero(class APaladinHero* SwitchFromHero, class APaladinHero* SwitchToHero);                          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/RT_Water/AquaticSurface/Blueprints/BP_AquaticInteraction.BP_AquaticInteraction_C.ExecuteUbergraph_BP_AquaticInteraction
	// void ExecuteUbergraph_BP_AquaticInteraction(int32_t EntryPoint);                                                      // [0x15dd8c0] Final                
};

/// Class /Game/Blueprint/TrailSystem/Blueprints/BP_TrailComponent.BP_TrailComponent_C
/// Size: 0x0025 (0x0001F0 - 0x000215)
class UBP_TrailComponent_C : public USceneComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01F0   (0x0008)  
	float                                              TrailScale;                                                 // 0x01F8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x01FC   (0x0004)  MISSED
	class ABP_TrailsManager_C*                         TrailManagerInstance;                                       // 0x0200   (0x0008)  
	float                                              Hardness;                                                   // 0x0208   (0x0004)  
	FName                                              ReceivingActorsTag;                                         // 0x020C   (0x0008)  
	bool                                               GatherTrailInformation;                                     // 0x0214   (0x0001)  


	/// Functions
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailComponent.BP_TrailComponent_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailComponent.BP_TrailComponent_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailComponent.BP_TrailComponent_C.OnHeroFootStepDown_Event
	// void OnHeroFootStepDown_Event(FHitResult LineHitResult, EFoot FootRotator);                                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailComponent.BP_TrailComponent_C.RefreshGetTrailMannager
	// void RefreshGetTrailMannager();                                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailComponent.BP_TrailComponent_C.ExecuteUbergraph_BP_TrailComponent
	// void ExecuteUbergraph_BP_TrailComponent(int32_t EntryPoint);                                                          // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C
/// Size: 0x00E0 (0x000220 - 0x000300)
class ABP_TrailsManager_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0228   (0x0008)  
	TArray<FVector2D>                                  TrailsLocation;                                             // 0x0230   (0x0010)  
	TArray<float>                                      TrailsRadius;                                               // 0x0240   (0x0010)  
	TArray<float>                                      TrailsHardness;                                             // 0x0250   (0x0010)  
	TArray<float>                                      TrailsDepth;                                                // 0x0260   (0x0010)  
	class UTextureRenderTarget2D*                      HistoryRenderTarget;                                        // 0x0270   (0x0008)  
	float                                              MaxDistance;                                                // 0x0278   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x027C   (0x0004)  MISSED
	class UTextureRenderTarget2D*                      CurrentRenderTarget;                                        // 0x0280   (0x0008)  
	class UTextureRenderTarget2D*                      TrailsRenderTarget;                                         // 0x0288   (0x0008)  
	class UMaterial*                                   TrailDrawer;                                                // 0x0290   (0x0008)  
	class UMaterial*                                   HistoryMerge;                                               // 0x0298   (0x0008)  
	class UMaterial*                                   HistoryCopy;                                                // 0x02A0   (0x0008)  
	class UMaterialInstanceDynamic*                    TrailDrawerInstance;                                        // 0x02A8   (0x0008)  
	class UMaterialInstanceDynamic*                    HistoryMergeInstance;                                       // 0x02B0   (0x0008)  
	class UMaterialInstanceDynamic*                    HistoryCopyInstance;                                        // 0x02B8   (0x0008)  
	FVector                                            HistoryLocation;                                            // 0x02C0   (0x000C)  
	float                                              TrailsAttenuation;                                          // 0x02CC   (0x0004)  
	FVector                                            CurrentLocation;                                            // 0x02D0   (0x000C)  
	float                                              LocationCalcHelper;                                         // 0x02DC   (0x0004)  
	bool                                               IsLocationCalculated;                                       // 0x02E0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x02E1   (0x0003)  MISSED
	float                                              SideFade;                                                   // 0x02E4   (0x0004)  
	float                                              DaltaSeconds;                                               // 0x02E8   (0x0004)  
	bool                                               EnableRender;                                               // 0x02EC   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x02ED   (0x0003)  MISSED
	TArray<bool>                                       ComponentBool;                                              // 0x02F0   (0x0010)  


	/// Functions
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.RegisterBool
	// void RegisterBool(bool GatherTrail);                                                                                  // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.Initialize
	// void Initialize();                                                                                                    // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.VisualizeTrailComponents
	// void VisualizeTrailComponents(class AActor* Actor);                                                                   // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.CalculateLocation
	// void CalculateLocation();                                                                                             // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.RenderTrails
	// void RenderTrails();                                                                                                  // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.RegisterTrail
	// void RegisterTrail(FVector Location, float Radius, float Depth, float Hardness);                                      // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.ReceiveEndPlay
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                       // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.DrawTrail
	// void DrawTrail();                                                                                                     // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/Blueprint/TrailSystem/Blueprints/BP_TrailsManager.BP_TrailsManager_C.ExecuteUbergraph_BP_TrailsManager
	// void ExecuteUbergraph_BP_TrailsManager(int32_t EntryPoint);                                                           // [0x15dd8c0] Final|HasDefaults    
};

/// Struct /Game/Blueprint/BP_RTX/RT_Presets/RT_Parameters.RT_Parameters
/// Size: 0x14C0 (0x000000 - 0x0014C0)
struct FRT_Parameters
{ 
	FAO_Parameters                                     AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7;         // 0x0000   (0x0050)  
	FDebug_Parameters                                  Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698;      // 0x0050   (0x0138)  
	FGI_Parameters                                     GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C;         // 0x0188   (0x01F0)  
	FLandscapeAndFoliage_Parameter                     LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0378   (0x00D8)  
	FReflection_Parameters                             Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x0450   (0x0180)  
	FShadow_Parameters                                 Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684;     // 0x05D0   (0x0170)  
	FSkyLight_Parameters                               SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC;   // 0x0740   (0x0090)  
	FTranslucency_Parameters                           Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x07D0   (0x0160)  
	FWater_Caustics_Parameters                         WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0930   (0x0208)  
	FMesh_Caustics_Parameters                          MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x0B38   (0x0160)  
	FDLSS_Parameters                                   DLSSParameters_310_DF713E70420757F4C67C13BBDC8E3A9E;        // 0x0C98   (0x00F8)  
	FRTX_PostProcess_Settings                          RTXPostProcessSettings_316_D6EED34F42FA2FE3B39C158FD4BF7119; // 0x0D90   (0x0680)  
	FData_Type_Support                                 DataTypeSupport_320_05E01BCA47D595DB8AD533BF5B4A1C5C;       // 0x1410   (0x00A8)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x14B8   (0x0008)  MISSED
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/AnimalBase.AnimalBase_C
/// Size: 0x0008 (0x0005C0 - 0x0005C8)
class AAnimalBase_C : public APaladinAnimalBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x05C0   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/AnimalBase.AnimalBase_C.InitBlackboardData
	// void InitBlackboardData();                                                                                            // [0x15dd8c0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/AnimalBase.AnimalBase_C.ReceiveBeginPlay
	// void ReceiveBeginPlay();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/AnimalBase.AnimalBase_C.ExecuteUbergraph_AnimalBase
	// void ExecuteUbergraph_AnimalBase(int32_t EntryPoint);                                                                 // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CheckAnimalAround.BTService_CheckAnimalAround_C
/// Size: 0x00E0 (0x000098 - 0x000178)
class UBTService_CheckAnimalAround_C : public UBTService_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0098   (0x0008)  
	FBlackboardKeySelector                             AnimalState;                                                // 0x00A0   (0x0028)  
	FBlackboardKeySelector                             SpawnPos;                                                   // 0x00C8   (0x0028)  
	FBlackboardKeySelector                             ActiveRadius;                                               // 0x00F0   (0x0028)  
	FBlackboardKeySelector                             CanAround;                                                  // 0x0118   (0x0028)  
	FBlackboardKeySelector                             CanScared;                                                  // 0x0140   (0x0028)  
	class APawn*                                       LocalPlayer;                                                // 0x0168   (0x0008)  
	class AAnimalBase_C*                               AnimalPawn;                                                 // 0x0170   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CheckAnimalAround.BTService_CheckAnimalAround_C.ReceiveTickAI
	// void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);            // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CheckAnimalAround.BTService_CheckAnimalAround_C.ExecuteUbergraph_BTService_CheckAnimalAround
	// void ExecuteUbergraph_BTService_CheckAnimalAround(int32_t EntryPoint);                                                // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CalcAroundPos.BTService_CalcAroundPos_C
/// Size: 0x0140 (0x000098 - 0x0001D8)
class UBTService_CalcAroundPos_C : public UBTService_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0098   (0x0008)  
	class APawn*                                       AnimalPawn;                                                 // 0x00A0   (0x0008)  
	class APawn*                                       LocalPlayer;                                                // 0x00A8   (0x0008)  
	FBlackboardKeySelector                             ActiveRadius;                                               // 0x00B0   (0x0028)  
	FBlackboardKeySelector                             SpawnPos;                                                   // 0x00D8   (0x0028)  
	FBlackboardKeySelector                             AnimalState;                                                // 0x0100   (0x0028)  
	FBlackboardKeySelector                             AroundDistance;                                             // 0x0128   (0x0028)  
	FBlackboardKeySelector                             NeedAroundMove;                                             // 0x0150   (0x0028)  
	FVector                                            unTestPos;                                                  // 0x0178   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0184   (0x0004)  MISSED
	FBlackboardKeySelector                             AroundPos;                                                  // 0x0188   (0x0028)  
	FBlackboardKeySelector                             RandomState;                                                // 0x01B0   (0x0028)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CalcAroundPos.BTService_CalcAroundPos_C.ReceiveTickAI
	// void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);            // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CalcAroundPos.BTService_CalcAroundPos_C.ExecuteUbergraph_BTService_CalcAroundPos
	// void ExecuteUbergraph_BTService_CalcAroundPos(int32_t EntryPoint);                                                    // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Decorator/BTDecorator_IsPlayerAround.BTDecorator_IsPlayerAround_C
/// Size: 0x0038 (0x0000A0 - 0x0000D8)
class UBTDecorator_IsPlayerAround_C : public UBTDecorator_BlueprintBase
{ 
public:
	class APawn*                                       AnimalPawn;                                                 // 0x00A0   (0x0008)  
	class APawn*                                       LocalPlayer;                                                // 0x00A8   (0x0008)  
	FBlackboardKeySelector                             AroundDistance;                                             // 0x00B0   (0x0028)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Decorator/BTDecorator_IsPlayerAround.BTDecorator_IsPlayerAround_C.PerformConditionCheckAI
	// bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);                      // [0x15dd8c0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/PreViewContent/GameplayEffect/GE_CommonSkill_CD.GE_CommonSkill_CD_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_CommonSkill_CD_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/GE_AIAttrBuff_Normal.GE_AIAttrBuff_Normal_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AIAttrBuff_Normal_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/GE_AIAttrBuff_NightMare.GE_AIAttrBuff_NightMare_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AIAttrBuff_NightMare_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/GE_AIAttrBuff_Hard.GE_AIAttrBuff_Hard_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AIAttrBuff_Hard_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/GE_AIAttrBuff_Easy.GE_AIAttrBuff_Easy_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AIAttrBuff_Easy_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/GE_AIAttrBuff_BossChallenge.GE_AIAttrBuff_BossChallenge_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AIAttrBuff_BossChallenge_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/BP_PaladinGlobals.BP_PaladinGlobals_C
/// Size: 0x0000 (0x0005B0 - 0x0005B0)
class UBP_PaladinGlobals_C : public UPaladinGlobals
{ 
public:
};

/// Class /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_MainQuestTag.ActiveCondition_MainQuestTag_C
/// Size: 0x0010 (0x000138 - 0x000148)
class UActiveCondition_MainQuestTag_C : public UPaladinQuestActiveCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  
	FGameplayTag                                       QuestTag;                                                   // 0x0140   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_MainQuestTag.ActiveCondition_MainQuestTag_C.GetConditionActiveText
	// FText GetConditionActiveText();                                                                                       // [0x15dd8c0] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_MainQuestTag.ActiveCondition_MainQuestTag_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_MainQuestTag.ActiveCondition_MainQuestTag_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_MainQuestTag.ActiveCondition_MainQuestTag_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_MainQuestTag.ActiveCondition_MainQuestTag_C.OnQuestTagChanged
	// void OnQuestTagChanged(FGameplayTag Tag, bool bAddTag);                                                               // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_MainQuestTag.ActiveCondition_MainQuestTag_C.ExecuteUbergraph_ActiveCondition_MainQuestTag
	// void ExecuteUbergraph_ActiveCondition_MainQuestTag(int32_t EntryPoint);                                               // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/GameplayEffect/GE_AntiAbilityMPCost.GE_AntiAbilityMPCost_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AntiAbilityMPCost_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_SwitchLockActor.PaladinCondition_Teach_SwitchLockActor_C
/// Size: 0x0009 (0x000138 - 0x000141)
class UPaladinCondition_Teach_SwitchLockActor_C : public UPaladinCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  
	bool                                               Locked;                                                     // 0x0140   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_SwitchLockActor.PaladinCondition_Teach_SwitchLockActor_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_SwitchLockActor.PaladinCondition_Teach_SwitchLockActor_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_SwitchLockActor.PaladinCondition_Teach_SwitchLockActor_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_SwitchLockActor.PaladinCondition_Teach_SwitchLockActor_C.OnSwitchLock
	// void OnSwitchLock(class APaladinCharacterBase* Source, EPaladinLockChangeState LockChangeState);                      // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_SwitchLockActor.PaladinCondition_Teach_SwitchLockActor_C.InitCondition
	// void InitCondition(class UWorld* WorldContext, bool bResetSubgoal);                                                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_SwitchLockActor.PaladinCondition_Teach_SwitchLockActor_C.ExecuteUbergraph_PaladinCondition_Teach_SwitchLockActor
	// void ExecuteUbergraph_PaladinCondition_Teach_SwitchLockActor(int32_t EntryPoint);                                     // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_LockActor.PaladinCondition_Teach_LockActor_C
/// Size: 0x0009 (0x000138 - 0x000141)
class UPaladinCondition_Teach_LockActor_C : public UPaladinCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  
	bool                                               Done;                                                       // 0x0140   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_LockActor.PaladinCondition_Teach_LockActor_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_LockActor.PaladinCondition_Teach_LockActor_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_LockActor.PaladinCondition_Teach_LockActor_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_LockActor.PaladinCondition_Teach_LockActor_C.OnLook
	// void OnLook(class APaladinCharacterBase* Source, EPaladinLockChangeState LockChangeState);                            // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_LockActor.PaladinCondition_Teach_LockActor_C.InitCondition
	// void InitCondition(class UWorld* WorldContext, bool bResetSubgoal);                                                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_LockActor.PaladinCondition_Teach_LockActor_C.ExecuteUbergraph_PaladinCondition_Teach_LockActor
	// void ExecuteUbergraph_PaladinCondition_Teach_LockActor(int32_t EntryPoint);                                           // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_Ability.PaladinCondition_Teach_Ability_C
/// Size: 0x0014 (0x000138 - 0x00014C)
class UPaladinCondition_Teach_Ability_C : public UPaladinCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  
	FName                                              TargetActorID;                                              // 0x0140   (0x0008)  
	bool                                               bHit;                                                       // 0x0148   (0x0001)  
	bool                                               bOnAbilityEnd;                                              // 0x0149   (0x0001)  
	bool                                               bMatchAbility;                                              // 0x014A   (0x0001)  
	bool                                               bNeedHitTarget;                                             // 0x014B   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_Ability.PaladinCondition_Teach_Ability_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_Ability.PaladinCondition_Teach_Ability_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_Ability.PaladinCondition_Teach_Ability_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_Ability.PaladinCondition_Teach_Ability_C.OnHitByHostileDamage_Event
	// void OnHitByHostileDamage_Event(class UPaladinHostileDamageEventData* Data);                                          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_Ability.PaladinCondition_Teach_Ability_C.OnbilityActiveEvent_Event
	// void OnbilityActiveEvent_Event(class APaladinCharacterBase* Character, class UPaladinComboAbility* Ability);          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_Ability.PaladinCondition_Teach_Ability_C.ExecuteUbergraph_PaladinCondition_Teach_Ability
	// void ExecuteUbergraph_PaladinCondition_Teach_Ability(int32_t EntryPoint);                                             // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Condition/PaladinCondition_KillMonster.PaladinCondition_KillMonster_C
/// Size: 0x0008 (0x000138 - 0x000140)
class UPaladinCondition_KillMonster_C : public UPaladinCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Condition/PaladinCondition_KillMonster.PaladinCondition_KillMonster_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_KillMonster.PaladinCondition_KillMonster_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_KillMonster.PaladinCondition_KillMonster_C.OnMonsterBeKilled_Event
	// void OnMonsterBeKilled_Event(class APaladinHero* Killer, class APaladinEnemy* KilledEnemy);                           // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_KillMonster.PaladinCondition_KillMonster_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_KillMonster.PaladinCondition_KillMonster_C.ExecuteUbergraph_PaladinCondition_KillMonster
	// void ExecuteUbergraph_PaladinCondition_KillMonster(int32_t EntryPoint);                                               // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Condition/PaladinCondition_CollectItems.PaladinCondition_CollectItems_C
/// Size: 0x0008 (0x000138 - 0x000140)
class UPaladinCondition_CollectItems_C : public UPaladinCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Condition/PaladinCondition_CollectItems.PaladinCondition_CollectItems_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_CollectItems.PaladinCondition_CollectItems_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_CollectItems.PaladinCondition_CollectItems_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_CollectItems.PaladinCondition_CollectItems_C.OnItemCountChangedEventDelegate_Event
	// void OnItemCountChangedEventDelegate_Event(int32_t ItemId, int32_t ItemCount);                                        // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_CollectItems.PaladinCondition_CollectItems_C.ExecuteUbergraph_PaladinCondition_CollectItems
	// void ExecuteUbergraph_PaladinCondition_CollectItems(int32_t EntryPoint);                                              // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_True.BTTask_True_C
/// Size: 0x0008 (0x0000A8 - 0x0000B0)
class UBTTask_True_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_True.BTTask_True_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                             // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_True.BTTask_True_C.ExecuteUbergraph_BTTask_True
	// void ExecuteUbergraph_BTTask_True(int32_t EntryPoint);                                                                // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_SetAnimalSpeed.BTTask_SetAnimalSpeed_C
/// Size: 0x0010 (0x0000A8 - 0x0000B8)
class UBTTask_SetAnimalSpeed_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	EAnimalNPCState                                    AnimalState;                                                // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x00B1   (0x0003)  MISSED
	float                                              Speed;                                                      // 0x00B4   (0x0004)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_SetAnimalSpeed.BTTask_SetAnimalSpeed_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                             // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_SetAnimalSpeed.BTTask_SetAnimalSpeed_C.ExecuteUbergraph_BTTask_SetAnimalSpeed
	// void ExecuteUbergraph_BTTask_SetAnimalSpeed(int32_t EntryPoint);                                                      // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalWalkPoint.BTTask_RandomAnimalWalkPoint_C
/// Size: 0x008C (0x0000A8 - 0x000134)
class UBTTask_RandomAnimalWalkPoint_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	FBlackboardKeySelector                             SpawnPos;                                                   // 0x00B0   (0x0028)  
	FBlackboardKeySelector                             ActiveRadius;                                               // 0x00D8   (0x0028)  
	FBlackboardKeySelector                             TargetPos;                                                  // 0x0100   (0x0028)  
	FVector                                            unTestTargetPos;                                            // 0x0128   (0x000C)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalWalkPoint.BTTask_RandomAnimalWalkPoint_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                             // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalWalkPoint.BTTask_RandomAnimalWalkPoint_C.ExecuteUbergraph_BTTask_RandomAnimalWalkPoint
	// void ExecuteUbergraph_BTTask_RandomAnimalWalkPoint(int32_t EntryPoint);                                               // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalState.BTTask_RandomAnimalState_C
/// Size: 0x0039 (0x0000A8 - 0x0000E1)
class UBTTask_RandomAnimalState_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	int32_t                                            State;                                                      // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00B4   (0x0004)  MISSED
	FBlackboardKeySelector                             AnimalState;                                                // 0x00B8   (0x0028)  
	bool                                               CheckPassiveState;                                          // 0x00E0   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalState.BTTask_RandomAnimalState_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                             // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalState.BTTask_RandomAnimalState_C.ExecuteUbergraph_BTTask_RandomAnimalState
	// void ExecuteUbergraph_BTTask_RandomAnimalState(int32_t EntryPoint);                                                   // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalScaredPoint.BTTask_RandomAnimalScaredPoint_C
/// Size: 0x00C4 (0x0000A8 - 0x00016C)
class UBTTask_RandomAnimalScaredPoint_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	FBlackboardKeySelector                             SpawnPos;                                                   // 0x00B0   (0x0028)  
	FBlackboardKeySelector                             ActiveRadius;                                               // 0x00D8   (0x0028)  
	FBlackboardKeySelector                             TargetPos;                                                  // 0x0100   (0x0028)  
	class APawn*                                       AnimalPawn;                                                 // 0x0128   (0x0008)  
	class APawn*                                       LocalPlayer;                                                // 0x0130   (0x0008)  
	FBlackboardKeySelector                             ScaredDistance;                                             // 0x0138   (0x0028)  
	FVector                                            RandomPos;                                                  // 0x0160   (0x000C)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalScaredPoint.BTTask_RandomAnimalScaredPoint_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                             // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_RandomAnimalScaredPoint.BTTask_RandomAnimalScaredPoint_C.ExecuteUbergraph_BTTask_RandomAnimalScaredPoint
	// void ExecuteUbergraph_BTTask_RandomAnimalScaredPoint(int32_t EntryPoint);                                             // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_AnimalPlayAction.BTTask_AnimalPlayAction_C
/// Size: 0x0050 (0x0000A8 - 0x0000F8)
class UBTTask_AnimalPlayAction_C : public UBTTask_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00A8   (0x0008)  
	EAnimalNPCState                                    AnimalState;                                                // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x00B1   (0x0007)  MISSED
	TArray<FPaladinAnimalAnimSequenceInfo>             Actions;                                                    // 0x00B8   (0x0010)  
	class UAnimInstance*                               AnimInstance;                                               // 0x00C8   (0x0008)  
	class UAnimMontage*                                AnimMontage;                                                // 0x00D0   (0x0008)  
	FTimerHandle                                       TimerHandle;                                                // 0x00D8   (0x0008)  
	float                                              LeftTime;                                                   // 0x00E0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00E4   (0x0004)  MISSED
	FPaladinAnimalAnimSequenceInfo                     Action;                                                     // 0x00E8   (0x0010)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_AnimalPlayAction.BTTask_AnimalPlayAction_C.ReceiveExecuteAI
	// void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);                             // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_AnimalPlayAction.BTTask_AnimalPlayAction_C.ReceiveAbortAI
	// void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);                               // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_AnimalPlayAction.BTTask_AnimalPlayAction_C.ActionFinish
	// void ActionFinish();                                                                                                  // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Task/BTTask_AnimalPlayAction.BTTask_AnimalPlayAction_C.ExecuteUbergraph_BTTask_AnimalPlayAction
	// void ExecuteUbergraph_BTTask_AnimalPlayAction(int32_t EntryPoint);                                                    // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CheckScared.BTService_CheckScared_C
/// Size: 0x0130 (0x000098 - 0x0001C8)
class UBTService_CheckScared_C : public UBTService_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0098   (0x0008)  
	class AAnimalBase_C*                               AnimalPawn;                                                 // 0x00A0   (0x0008)  
	FBlackboardKeySelector                             CanAround;                                                  // 0x00A8   (0x0028)  
	FBlackboardKeySelector                             CanScared;                                                  // 0x00D0   (0x0028)  
	class APawn*                                       LocalPlayer;                                                // 0x00F8   (0x0008)  
	FBlackboardKeySelector                             SpawnPos;                                                   // 0x0100   (0x0028)  
	FBlackboardKeySelector                             ActiveRadius;                                               // 0x0128   (0x0028)  
	FBlackboardKeySelector                             AnimalShoudAvoid;                                           // 0x0150   (0x0028)  
	FBlackboardKeySelector                             ScaredDistance;                                             // 0x0178   (0x0028)  
	FBlackboardKeySelector                             AnimalState;                                                // 0x01A0   (0x0028)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CheckScared.BTService_CheckScared_C.ReceiveTickAI
	// void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);            // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/NPC/Animal/Service/BTService_CheckScared.BTService_CheckScared_C.ExecuteUbergraph_BTService_CheckScared
	// void ExecuteUbergraph_BTService_CheckScared(int32_t EntryPoint);                                                      // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_HeroInTeam.ActiveCondition_HeroInTeam_C
/// Size: 0x0009 (0x000138 - 0x000141)
class UActiveCondition_HeroInTeam_C : public UPaladinQuestActiveCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  
	EPaladinHeroName                                   HeroIndex;                                                  // 0x0140   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_HeroInTeam.ActiveCondition_HeroInTeam_C.GetConditionActiveText
	// FText GetConditionActiveText();                                                                                       // [0x15dd8c0] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_HeroInTeam.ActiveCondition_HeroInTeam_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_HeroInTeam.ActiveCondition_HeroInTeam_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_HeroInTeam.ActiveCondition_HeroInTeam_C.OnTeamQueueChangeEvt
	// void OnTeamQueueChangeEvt();                                                                                          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_HeroInTeam.ActiveCondition_HeroInTeam_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/ActiveQuest/ActiveCondition_HeroInTeam.ActiveCondition_HeroInTeam_C.ExecuteUbergraph_ActiveCondition_HeroInTeam
	// void ExecuteUbergraph_ActiveCondition_HeroInTeam(int32_t EntryPoint);                                                 // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeSpelDefByMultiply.GE_ChangeSpelDefByMultiply_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeSpelDefByMultiply_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeSpelDefByAdd.GE_ChangeSpelDefByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeSpelDefByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeSpelAttkByMultiply.GE_ChangeSpelAttkByMultiply_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeSpelAttkByMultiply_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeSpelAttkByAdd.GE_ChangeSpelAttkByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeSpelAttkByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangePhysicalDefByMultiply.GE_ChangePhysicalDefByMultiply_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangePhysicalDefByMultiply_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangePhysicalDefByAdd.GE_ChangePhysicalDefByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangePhysicalDefByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangePhysicalAttkByMultiply.GE_ChangePhysicalAttkByMultiply_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangePhysicalAttkByMultiply_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangePhysicalAttkByAdd.GE_ChangePhysicalAttkByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangePhysicalAttkByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeMPMaxByMultiply.GE_ChangeMPMaxByMultiply_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeMPMaxByMultiply_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeHPMaxByAdd.GE_ChangeHPMaxByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeHPMaxByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeReduceDamageTakenRatioByAdd.GE_ChangeReduceDamageTakenRatioByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeReduceDamageTakenRatioByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeMPMaxByAdd.GE_ChangeMPMaxByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeMPMaxByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeHPMaxByMultiply.GE_ChangeHPMaxByMultiply_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeHPMaxByMultiply_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeCritChanceByAdd.GE_ChangeCritChanceByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeCritChanceByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_ChangeBothDamageRatioByAdd.GE_ChangeBothDamageRatioByAdd_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_ChangeBothDamageRatioByAdd_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddRecoveryItemEffectRate.GE_AddRecoveryItemEffectRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddRecoveryItemEffectRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddMoneyGainRate.GE_AddMoneyGainRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddMoneyGainRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddFoodEffectRate.GE_AddFoodEffectRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddFoodEffectRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddExpGainRate.GE_AddExpGainRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddExpGainRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddDropRate.GE_AddDropRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddDropRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddDropNumPlusRate.GE_AddDropNumPlusRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddDropNumPlusRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddDebuffResistChance_YuLingShanZhu.GE_AddDebuffResistChance_YuLingShanZhu_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddDebuffResistChance_YuLingShanZhu_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddAwakenTime.GE_AddAwakenTime_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddAwakenTime_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddAwakenDamageRate.GE_AddAwakenDamageRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddAwakenDamageRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/GameplayEffect/Attribute/GE_AddAwakenBuffGetRate.GE_AddAwakenBuffGetRate_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_AddAwakenBuffGetRate_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/QuestTest/Editor/QuestGoal/WaitTag.WaitTag_C
/// Size: 0x0030 (0x000188 - 0x0001B8)
class UWaitTag_C : public UPaladinQuestNode_Goal_BlueprintBase
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0188   (0x0008)  
	FGameplayTag                                       ActiveByTag;                                                // 0x0190   (0x0008)  
	TArray<FGameplayTag>                               TriggerTagsAfterEnd;                                        // 0x0198   (0x0010)  
	SDK_UNDEFINED(16,2577) /* TArray<FText> */         __um(SubTexts);                                             // 0x01A8   (0x0010)  


	/// Functions
	// Function /Game/PreViewContent/QuestTest/Editor/QuestGoal/WaitTag.WaitTag_C.OnTriggedDelegate_444483E74304C967343DB18D02AE8122
	// void OnTriggedDelegate_444483E74304C967343DB18D02AE8122();                                                            // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/Editor/QuestGoal/WaitTag.WaitTag_C.K2_Activite
	// void K2_Activite();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/Editor/QuestGoal/WaitTag.WaitTag_C.K2_OnEnd
	// void K2_OnEnd(bool bInterrupt);                                                                                       // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/QuestTest/Editor/QuestGoal/WaitTag.WaitTag_C.ExecuteUbergraph_WaitTag
	// void ExecuteUbergraph_WaitTag(int32_t EntryPoint);                                                                    // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/Condition/PaladinCondition_QuestTag.PaladinCondition_QuestTag_C
/// Size: 0x001C (0x000138 - 0x000154)
class UPaladinCondition_QuestTag_C : public UPaladinCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  
	FGameplayTag                                       QuestTag;                                                   // 0x0140   (0x0008)  
	bool                                               bTagExist;                                                  // 0x0148   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0149   (0x0003)  MISSED
	FName                                              QuestTagName;                                               // 0x014C   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Condition/PaladinCondition_QuestTag.PaladinCondition_QuestTag_C.ConfigTagByName
	// void ConfigTagByName();                                                                                               // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_QuestTag.PaladinCondition_QuestTag_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_QuestTag.PaladinCondition_QuestTag_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_QuestTag.PaladinCondition_QuestTag_C.OnQuestTagChanged
	// void OnQuestTagChanged(FGameplayTag Tag, bool bAddTag);                                                               // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_QuestTag.PaladinCondition_QuestTag_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/PaladinCondition_QuestTag.PaladinCondition_QuestTag_C.ExecuteUbergraph_PaladinCondition_QuestTag
	// void ExecuteUbergraph_PaladinCondition_QuestTag(int32_t EntryPoint);                                                  // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/SkillAbility/Pet/Water/GEA_Water_Shield.GEA_Water_Shield_C
/// Size: 0x003C (0x000418 - 0x000454)
class UGEA_Water_Shield_C : public UPaladinEventAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0418   (0x0008)  
	float                                              Total;                                                      // 0x0420   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0424   (0x0004)  MISSED
	SDK_UNDEFINED(40,2578) /* TWeakObjectPtr<UClass*> */ __um(GE_WaterShieldForAccessory);                         // 0x0428   (0x0028)  
	float                                              WaterShiledBuffDuration;                                    // 0x0450   (0x0004)  


	/// Functions
	// Function /Game/PreViewContent/SkillAbility/Pet/Water/GEA_Water_Shield.GEA_Water_Shield_C.HerosHPMaxAverageValue
	// void HerosHPMaxAverageValue(float& AverageValue);                                                                     // [0x15dd8c0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/Pet/Water/GEA_Water_Shield.GEA_Water_Shield_C.OnLoaded_41D9D62A45335D7C2939B58A3F191F61
	// void OnLoaded_41D9D62A45335D7C2939B58A3F191F61(class UClass* Loaded);                                                 // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/Pet/Water/GEA_Water_Shield.GEA_Water_Shield_C.K2_ActivateAbilityFromEvent
	// void K2_ActivateAbilityFromEvent(FGameplayEventData& EventData);                                                      // [0x15dd8c0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/Pet/Water/GEA_Water_Shield.GEA_Water_Shield_C.ApplyWaterShieldToSelf
	// void ApplyWaterShieldToSelf(float ShieldHP);                                                                          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/Pet/Water/GEA_Water_Shield.GEA_Water_Shield_C.ExecuteUbergraph_GEA_Water_Shield
	// void ExecuteUbergraph_GEA_Water_Shield(int32_t EntryPoint);                                                           // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/SkillAbility/Pet/Water/GE_Water_Shield.GE_Water_Shield_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_Water_Shield_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/SkillAbility/ItemAbility/GE_CommonItem_CD.GE_CommonItem_CD_C
/// Size: 0x0000 (0x0007B8 - 0x0007B8)
class UGE_CommonItem_CD_C : public UPaladinGEBase
{ 
public:
};

/// Class /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C
/// Size: 0x000C (0x000468 - 0x000474)
class UBP_ItemAbilityBase_C : public UPaladinItemAbility
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0468   (0x0008)  
	bool                                               CheckHP;                                                    // 0x0470   (0x0001)  
	bool                                               CheckMP;                                                    // 0x0471   (0x0001)  
	bool                                               CheckDie;                                                   // 0x0472   (0x0001)  
	bool                                               NeedMinusOne;                                               // 0x0473   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.CheckConfig
	// bool CheckConfig(class AActor* Actor);                                                                                // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.MakeEffectToPartners
	// void MakeEffectToPartners(class UClass* GE, float Magnitude, float Duration, float Period);                           // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.Make Effect to Other
	// void Make Effect to Other(class AActor* Other, class UClass* GameplayEffectClass, float Magnitude, float Duration, float Period, int32_t StackCount, FActiveGameplayEffectHandle& ActiveGEHandle); // [0x15dd8c0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.MakeEffectToSelf
	// void MakeEffectToSelf(class UClass* GE, float Magnitude, float Duration, float Period);                               // [0x15dd8c0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.SpawnParticleOnHero
	// void SpawnParticleOnHero(class UObject* Actor);                                                                       // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.K2_OnEndAbility
	// void K2_OnEndAbility(bool bWasCancelled);                                                                             // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.SpawnItemAbilitySound
	// void SpawnItemAbilitySound(class UObject* Actor);                                                                     // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/BP_ItemAbilityBase.BP_ItemAbilityBase_C.ExecuteUbergraph_BP_ItemAbilityBase
	// void ExecuteUbergraph_BP_ItemAbilityBase(int32_t EntryPoint);                                                         // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/SkillAbility/ItemAbility/ItemAbility_SpellDef.ItemAbility_SpellDef_C
/// Size: 0x000C (0x000474 - 0x000480)
class UItemAbility_SpellDef_C : public UBP_ItemAbilityBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x4];                                       // 0x0474   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0478   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/ItemAbility_SpellDef.ItemAbility_SpellDef_C.K2_ActivateAbility
	// void K2_ActivateAbility();                                                                                            // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Game/PreViewContent/SkillAbility/ItemAbility/ItemAbility_SpellDef.ItemAbility_SpellDef_C.ExecuteUbergraph_ItemAbility_SpellDef
	// void ExecuteUbergraph_ItemAbility_SpellDef(int32_t EntryPoint);                                                       // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C
/// Size: 0x000C (0x000138 - 0x000144)
class UPaladinCondition_Teach_PerfectDodge_C : public UPaladinCondition
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0138   (0x0008)  
	int32_t                                            SkipTipsCount;                                              // 0x0140   (0x0004)  


	/// Functions
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.OnPerfectDodge_Event
	// void OnPerfectDodge_Event();                                                                                          // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.OnReceiveGameplayEffectAppliedToSelf_Event
	// void OnReceiveGameplayEffectAppliedToSelf_Event(class AActor* TargetActor, float Damage);                             // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.PaladinGuideProgressChangeDelegate_Event
	// void PaladinGuideProgressChangeDelegate_Event(EPaladinGuidProgress GuidProgressType, int32_t CurrPro, int32_t MaxPro); // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.CustomEvent
	// void CustomEvent(bool Yes?, class UConfirmBox_C* ConfirmBox);                                                         // [0x15dd8c0] BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Condition/Teaching/PaladinCondition_Teach_PerfectDodge.PaladinCondition_Teach_PerfectDodge_C.ExecuteUbergraph_PaladinCondition_Teach_PerfectDodge
	// void ExecuteUbergraph_PaladinCondition_Teach_PerfectDodge(int32_t EntryPoint);                                        // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/Action/Guide/PaladinAction_RemoveHeroGE.PaladinAction_RemoveHeroGE_C
/// Size: 0x0010 (0x000068 - 0x000078)
class UPaladinAction_RemoveHeroGE_C : public UPaladinAction
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0068   (0x0008)  
	class UClass*                                      GameplayEffectClazz;                                        // 0x0070   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Action/Guide/PaladinAction_RemoveHeroGE.PaladinAction_RemoveHeroGE_C.StartAction
	// void StartAction();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Action/Guide/PaladinAction_RemoveHeroGE.PaladinAction_RemoveHeroGE_C.ExecuteUbergraph_PaladinAction_RemoveHeroGE
	// void ExecuteUbergraph_PaladinAction_RemoveHeroGE(int32_t EntryPoint);                                                 // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Action/Guide/PaladinAction_ApplyHeroGE.PaladinAction_ApplyHeroGE_C
/// Size: 0x0010 (0x000068 - 0x000078)
class UPaladinAction_ApplyHeroGE_C : public UPaladinAction
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0068   (0x0008)  
	class UClass*                                      GameplayEffectClazz;                                        // 0x0070   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Action/Guide/PaladinAction_ApplyHeroGE.PaladinAction_ApplyHeroGE_C.StartAction
	// void StartAction();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Action/Guide/PaladinAction_ApplyHeroGE.PaladinAction_ApplyHeroGE_C.ExecuteUbergraph_PaladinAction_ApplyHeroGE
	// void ExecuteUbergraph_PaladinAction_ApplyHeroGE(int32_t EntryPoint);                                                  // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/Action/ActionEvent/BP_ActionEvent_RemoveAppearedPartnerFromRecord.BP_ActionEvent_RemoveAppearedPartnerFromRecord_C
/// Size: 0x0009 (0x000068 - 0x000071)
class UBP_ActionEvent_RemoveAppearedPartnerFromRecord_C : public UPaladinActionEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0068   (0x0008)  
	EPaladinHeroName                                   Hero;                                                       // 0x0070   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/Action/ActionEvent/BP_ActionEvent_RemoveAppearedPartnerFromRecord.BP_ActionEvent_RemoveAppearedPartnerFromRecord_C.StartAction
	// void StartAction();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Action/ActionEvent/BP_ActionEvent_RemoveAppearedPartnerFromRecord.BP_ActionEvent_RemoveAppearedPartnerFromRecord_C.ExecuteUbergraph_BP_ActionEvent_RemoveAppearedPartnerFromRecord
	// void ExecuteUbergraph_BP_ActionEvent_RemoveAppearedPartnerFromRecord(int32_t EntryPoint);                             // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Action/Tips/ActionEvent_ShowGuidTips.ActionEvent_ShowGuidTips_C
/// Size: 0x0010 (0x000068 - 0x000078)
class UActionEvent_ShowGuidTips_C : public UPaladinActionEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0068   (0x0008)  
	FName                                              GuidRowID;                                                  // 0x0070   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Action/Tips/ActionEvent_ShowGuidTips.ActionEvent_ShowGuidTips_C.StartAction
	// void StartAction();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Action/Tips/ActionEvent_ShowGuidTips.ActionEvent_ShowGuidTips_C.ExecuteUbergraph_ActionEvent_ShowGuidTips
	// void ExecuteUbergraph_ActionEvent_ShowGuidTips(int32_t EntryPoint);                                                   // [0x15dd8c0] Final|HasDefaults    
};

/// Class /Game/PreViewContent/Action/Function/BP_Function_TriggerOpenState.BP_Function_TriggerOpenState_C
/// Size: 0x000A (0x000068 - 0x000072)
class UBP_Function_TriggerOpenState_C : public UPaladinActionEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0068   (0x0008)  
	EOpenFunctionID                                    ID;                                                         // 0x0070   (0x0001)  
	bool                                               Open;                                                       // 0x0071   (0x0001)  


	/// Functions
	// Function /Game/PreViewContent/Action/Function/BP_Function_TriggerOpenState.BP_Function_TriggerOpenState_C.StartAction
	// void StartAction();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Action/Function/BP_Function_TriggerOpenState.BP_Function_TriggerOpenState_C.ExecuteUbergraph_BP_Function_TriggerOpenState
	// void ExecuteUbergraph_BP_Function_TriggerOpenState(int32_t EntryPoint);                                               // [0x15dd8c0] Final                
};

/// Class /Game/PreViewContent/Action/Tips/ActionEvent_HideGuidTips.ActionEvent_HideGuidTips_C
/// Size: 0x0010 (0x000068 - 0x000078)
class UActionEvent_HideGuidTips_C : public UPaladinActionEvent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0068   (0x0008)  
	FName                                              GuidRowID;                                                  // 0x0070   (0x0008)  


	/// Functions
	// Function /Game/PreViewContent/Action/Tips/ActionEvent_HideGuidTips.ActionEvent_HideGuidTips_C.StartAction
	// void StartAction();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/PreViewContent/Action/Tips/ActionEvent_HideGuidTips.ActionEvent_HideGuidTips_C.ExecuteUbergraph_ActionEvent_HideGuidTips
	// void ExecuteUbergraph_ActionEvent_HideGuidTips(int32_t EntryPoint);                                                   // [0x15dd8c0] Final                
};

