
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AIModule
/// dependency: CinematicCamera
/// dependency: CoreUObject
/// dependency: CriWareRuntime
/// dependency: Engine
/// dependency: GameplayAbilities
/// dependency: GameplayTags
/// dependency: GameplayTasks
/// dependency: InputCore
/// dependency: LevelSequence
/// dependency: MovieScene
/// dependency: PaladinAutoTestUtilRuntime
/// dependency: Paper2D
/// dependency: PathFollow
/// dependency: Slate
/// dependency: SlateCore
/// dependency: UMG

/// Enum /Script/Pal7.EPaladinKeyEventName
/// Size: 0x120
enum class EPaladinKeyEventName : uint8_t
{
	EPaladinKeyEventName__None                                                       = 0,
	EPaladinKeyEventName__Front                                                      = 1,
	EPaladinKeyEventName__Back                                                       = 2,
	EPaladinKeyEventName__Left                                                       = 3,
	EPaladinKeyEventName__Right                                                      = 4,
	EPaladinKeyEventName__Turn                                                       = 5,
	EPaladinKeyEventName__LookUp                                                     = 6,
	EPaladinKeyEventName__ChangeHeroNan1                                             = 7,
	EPaladinKeyEventName__ChangeHeroNv1                                              = 8,
	EPaladinKeyEventName__ChangeHeroNan2                                             = 9,
	EPaladinKeyEventName__ChangeHeroNv2                                              = 10,
	EPaladinKeyEventName__LockEnemy                                                  = 11,
	EPaladinKeyEventName__SwitchLockEnemyUp                                          = 12,
	EPaladinKeyEventName__SwitchLockEnemyDown                                        = 13,
	EPaladinKeyEventName__CameraLensReset                                            = 14,
	EPaladinKeyEventName__ChangeSkillPage                                            = 15,
	EPaladinKeyEventName__Jump                                                       = 16,
	EPaladinKeyEventName__DodgeAndSprint                                             = 17,
	EPaladinKeyEventName__Dodge                                                      = 18,
	EPaladinKeyEventName__Sprint                                                     = 19,
	EPaladinKeyEventName__ToggleWalk                                                 = 20,
	EPaladinKeyEventName__Attack                                                     = 21,
	EPaladinKeyEventName__Awake                                                      = 22,
	EPaladinKeyEventName__SuperAwake                                                 = 23,
	EPaladinKeyEventName__Skill0                                                     = 24,
	EPaladinKeyEventName__Skill1                                                     = 25,
	EPaladinKeyEventName__Skill2                                                     = 26,
	EPaladinKeyEventName__Skill3                                                     = 27,
	EPaladinKeyEventName__Skill4                                                     = 28,
	EPaladinKeyEventName__HotItem1                                                   = 29,
	EPaladinKeyEventName__HotItem2                                                   = 30,
	EPaladinKeyEventName__HotItem3                                                   = 31,
	EPaladinKeyEventName__HotItem4                                                   = 32,
	EPaladinKeyEventName__FightHotItem1                                              = 33,
	EPaladinKeyEventName__FightHotItem2                                              = 34,
	EPaladinKeyEventName__FightHotItem3                                              = 35,
	EPaladinKeyEventName__FightHotItem4                                              = 36,
	EPaladinKeyEventName__OpenBigMap                                                 = 37,
	EPaladinKeyEventName__OpenQuest                                                  = 38,
	EPaladinKeyEventName__OpenWorldMap                                               = 39,
	EPaladinKeyEventName__OpenBag                                                    = 40,
	EPaladinKeyEventName__OpenOverview                                               = 41,
	EPaladinKeyEventName__OpenPet                                                    = 42,
	EPaladinKeyEventName__OpenSystem                                                 = 43,
	EPaladinKeyEventName__OpenMuseum                                                 = 44,
	EPaladinKeyEventName__OpenEquipment                                              = 45,
	EPaladinKeyEventName__OpenSkill                                                  = 46,
	EPaladinKeyEventName__OpenScreenshot                                             = 47,
	EPaladinKeyEventName__Interaction                                                = 48,
	EPaladinKeyEventName__SkipDialogue                                               = 49,
	EPaladinKeyEventName__SwimGameUp                                                 = 50,
	EPaladinKeyEventName__SwimGameDown                                               = 51,
	EPaladinKeyEventName__SwimGameInteract                                           = 52,
	EPaladinKeyEventName__MiniGameShoot                                              = 53,
	EPaladinKeyEventName__MiniGameAim                                                = 54,
	EPaladinKeyEventName__PatrolGameSprint                                           = 55,
	EPaladinKeyEventName__PatrolGameSkill                                            = 56,
	EPaladinKeyEventName__DanceGameUP                                                = 57,
	EPaladinKeyEventName__DanceGameDown                                              = 58,
	EPaladinKeyEventName__DanceGameLeft                                              = 59,
	EPaladinKeyEventName__DanceGameRight                                             = 60,
	EPaladinKeyEventName__DanceGameY                                                 = 61,
	EPaladinKeyEventName__DanceGameX                                                 = 62,
	EPaladinKeyEventName__DanceGameA                                                 = 63,
	EPaladinKeyEventName__DanceGameB                                                 = 64,
	EPaladinKeyEventName__PatrolGameKill                                             = 65,
	EPaladinKeyEventName__SwimGameSkill0                                             = 66,
	EPaladinKeyEventName__SwimGameSkill1                                             = 67,
	EPaladinKeyEventName__XiLouGameOut                                               = 68,
	EPaladinKeyEventName__XiLouGameChoose                                            = 69,
	EPaladinKeyEventName__SkipPuzzle                                                 = 70,
	EPaladinKeyEventName__CardGameUp                                                 = 71,
	EPaladinKeyEventName__CardGameDown                                               = 72,
	EPaladinKeyEventName__CardGameLeft                                               = 73,
	EPaladinKeyEventName__CardGameRight                                              = 74,
	EPaladinKeyEventName__GamepadSkillHelper                                         = 75,
	EPaladinKeyEventName__GamepadChangeHeroHelper                                    = 76,
	EPaladinKeyEventName__GamepadLeftHelper                                          = 77,
	EPaladinKeyEventName__GamepadRightHelper                                         = 78,
	EPaladinKeyEventName__GamepadY                                                   = 79,
	EPaladinKeyEventName__GamepadX                                                   = 80,
	EPaladinKeyEventName__GamepadB                                                   = 81,
	EPaladinKeyEventName__GamepadA                                                   = 82,
	EPaladinKeyEventName__GamepadRightShoulder                                       = 83,
	EPaladinKeyEventName__GamepadLeftShoulder                                        = 84,
	EPaladinKeyEventName__GamepadLeftThumbstick                                      = 85,
	EPaladinKeyEventName__GamepadRightThumbstick                                     = 86,
	EPaladinKeyEventName__SkipSequence                                               = 87,
	EPaladinKeyEventName__StopSequence                                               = 88,
	EPaladinKeyEventName__ResumeSequence                                             = 89,
	EPaladinKeyEventName__HidePhotoUI                                                = 90,
	EPaladinKeyEventName__CameraUP                                                   = 91,
	EPaladinKeyEventName__CameraDown                                                 = 92,
	EPaladinKeyEventName__CameraXLeft                                                = 93,
	EPaladinKeyEventName__CameraXRight                                               = 94,
	EPaladinKeyEventName__CameraUnlock                                               = 95,
	EPaladinKeyEventName__QuitPhotograph                                             = 96,
	EPaladinKeyEventName__StartPhotograph                                            = 97,
	EPaladinKeyEventName__GamepadRightShoulderForPhoto                               = 98,
	EPaladinKeyEventName__GamepadLeftShoulderForPhoto                                = 99,
	EPaladinKeyEventName__EffectOptionChangeUp                                       = 100,
	EPaladinKeyEventName__EffectOptionChangeDown                                     = 101,
	EPaladinKeyEventName__EffectValueChangeUp                                        = 102,
	EPaladinKeyEventName__EffectValueChangeDown                                      = 103,
	EPaladinKeyEventName__CameraReset                                                = 104,
	EPaladinKeyEventName__CameraShoot                                                = 105,
	EPaladinKeyEventName__DecalRepeal                                                = 106,
	EPaladinKeyEventName__DecalMirror                                                = 107,
	EPaladinKeyEventName__TabPhotoPage                                               = 108,
	EPaladinKeyEventName__PhotoDecalMode                                             = 109,
	EPaladinKeyEventName__TrackRecentQuest                                           = 110,
	EPaladinKeyEventName__ShowUnlockAbility                                          = 111,
	EPaladinKeyEventName__LoadingStartGame                                           = 112,
	EPaladinKeyEventName__Num                                                        = 113,
	EPaladinKeyEventName__SwitchWalk                                                 = 114,
	EPaladinKeyEventName__SwitchRTX                                                  = 115,
	EPaladinKeyEventName__SwitchDLSS                                                 = 116,
	EPaladinKeyEventName__SequneceSpeedUp                                            = 117,
	EPaladinKeyEventName__SequneceSpeedDown                                          = 118,
	EPaladinKeyEventName__EPaladinKeyEventName_MAX                                   = 119
};

/// Enum /Script/Pal7.EPaladinControllerMode
/// Size: 0x31
enum class EPaladinControllerMode : uint8_t
{
	EPaladinControllerMode__PCME_Free                                                = 0,
	EPaladinControllerMode__PCME_Town                                                = 1,
	EPaladinControllerMode__PCME_Fight                                               = 2,
	EPaladinControllerMode__PCME_MoveBox                                             = 3,
	EPaladinControllerMode__PCME_DivingGame                                          = 4,
	EPaladinControllerMode__PCME_PatrolGame                                          = 5,
	EPaladinControllerMode__PCME_DanceGame                                           = 6,
	EPaladinControllerMode__PCME_SlidingGame                                         = 7,
	EPaladinControllerMode__PCME_Photo                                               = 8,
	EPaladinControllerMode__PCME_Interaction                                         = 9,
	EPaladinControllerMode__PCME_Dialogue                                            = 10,
	EPaladinControllerMode__PCME_MainMission1                                        = 11,
	EPaladinControllerMode__PCME_Cruise                                              = 12,
	EPaladinControllerMode__PCME_GameEnd                                             = 13,
	EPaladinControllerMode__PCME_Sequence                                            = 14,
	EPaladinControllerMode__PCME_Sequence_DisableMove                                = 15,
	EPaladinControllerMode__PCME_Sequence_DisableLookUp                              = 16,
	EPaladinControllerMode__PCME_Sequence_DisableInput                               = 17,
	EPaladinControllerMode__PCME_Sequence_Pause                                      = 18,
	EPaladinControllerMode__PCME_Sequence_Group                                      = 19,
	EPaladinControllerMode__PCME_Picking                                             = 20,
	EPaladinControllerMode__PCME_InRoom                                              = 21,
	EPaladinControllerMode__PCME_GamePause_DisableSystem                             = 22,
	EPaladinControllerMode__PCME_UIOnly                                              = 23,
	EPaladinControllerMode__PCME_ChangeUI_DisableInput                               = 24,
	EPaladinControllerMode__PCME_Group_Free                                          = 25,
	EPaladinControllerMode__PCME_Puzzle_Free                                         = 26,
	EPaladinControllerMode__PCME_Puzzle_Town                                         = 27,
	EPaladinControllerMode__PCME_Esc_Only                                            = 28,
	EPaladinControllerMode__Unknown                                                  = 29,
	EPaladinControllerMode__EPaladinControllerMode_MAX                               = 30
};

/// Enum /Script/Pal7.EQuestCategory
/// Size: 0x05
enum class EQuestCategory : uint8_t
{
	EQuestCategory__Main                                                             = 0,
	EQuestCategory__Branch                                                           = 1,
	EQuestCategory__Other                                                            = 2,
	EQuestCategory__None                                                             = 3,
	EQuestCategory__EQuestCategory_MAX                                               = 4
};

/// Enum /Script/Pal7.EPaladinSaveFileType
/// Size: 0x05
enum class EPaladinSaveFileType : uint8_t
{
	EPaladinSaveFileType__GlobalFile                                                 = 0,
	EPaladinSaveFileType__MetaFile                                                   = 1,
	EPaladinSaveFileType__SlotFile                                                   = 2,
	EPaladinSaveFileType__ScreenShotFile                                             = 3,
	EPaladinSaveFileType__EPaladinSaveFileType_MAX                                   = 4
};

/// Enum /Script/Pal7.EItemMainType
/// Size: 0x22
enum class EItemMainType : uint8_t
{
	EItemMainType__IT_Weapon                                                         = 0,
	EItemMainType__IT_Equip_UpperBody                                                = 1,
	EItemMainType__IT_Equip_LowerBody                                                = 2,
	EItemMainType__IT_Equip_Feet                                                     = 3,
	EItemMainType__IT_Equip_Accessory                                                = 4,
	EItemMainType__IT_Equip_Suit                                                     = 5,
	EItemMainType__IT_Weapon_Skin                                                    = 6,
	EItemMainType__IT_EquipmentNum                                                   = 7,
	EItemMainType__IT_Consumable                                                     = 8,
	EItemMainType__IT_Food_Material                                                  = 9,
	EItemMainType__IT_Forge_Material                                                 = 10,
	EItemMainType__IT_Story_Item                                                     = 11,
	EItemMainType__IT_Quest_Item                                                     = 12,
	EItemMainType__IT_Museum_Item                                                    = 13,
	EItemMainType__IT_Other_Item                                                     = 14,
	EItemMainType__IT_Card                                                           = 15,
	EItemMainType__IT_PetFood                                                        = 16,
	EItemMainType__IT_Wine                                                           = 17,
	EItemMainType__IT_Recipe                                                         = 18,
	EItemMainType__IT_Food                                                           = 19,
	EItemMainType__TC_Main_MAX                                                       = 20,
	EItemMainType__EItemMainType_MAX                                                 = 21
};

/// Enum /Script/Pal7.EPaladinHeroName
/// Size: 0x07
enum class EPaladinHeroName : uint8_t
{
	EPaladinHeroName__PalHero_NAN1                                                   = 0,
	EPaladinHeroName__PalHero_NV1                                                    = 1,
	EPaladinHeroName__PalHero_NAN2                                                   = 2,
	EPaladinHeroName__PalHero_NV2                                                    = 3,
	EPaladinHeroName__SuperHero                                                      = 4,
	EPaladinHeroName__PalHero_None                                                   = 10,
	EPaladinHeroName__EPaladinHeroName_MAX                                           = 11
};

/// Enum /Script/Pal7.EDeckGroup
/// Size: 0x05
enum class EDeckGroup : uint8_t
{
	EDeckGroup__EDeckGroup_1stGroup                                                  = 0,
	EDeckGroup__EDeckGroup_2ndGroup                                                  = 1,
	EDeckGroup__EDeckGroup_3rdGroup                                                  = 2,
	EDeckGroup__EDeckGroup_Num                                                       = 3,
	EDeckGroup__EDeckGroup_MAX                                                       = 4
};

/// Enum /Script/Pal7.EPaladinNPCEnableLord
/// Size: 0x07
enum class EPaladinNPCEnableLord : uint8_t
{
	EPaladinNPCEnableLord__ENABLE_QUEST                                              = 0,
	EPaladinNPCEnableLord__ENABLE_Sequence                                           = 1,
	EPaladinNPCEnableLord__ENABLE_Sleep                                              = 2,
	EPaladinNPCEnableLord__ENABLE_Config                                             = 3,
	EPaladinNPCEnableLord__ENABLE_Running                                            = 4,
	EPaladinNPCEnableLord__ENABLE_None                                               = 5,
	EPaladinNPCEnableLord__ENABLE_MAX                                                = 6
};

/// Enum /Script/Pal7.EPaladinNPCEnableFactor
/// Size: 0x13
enum class EPaladinNPCEnableFactor : uint8_t
{
	EPaladinNPCEnableFactor__FACTOR_ShowMesh                                         = 0,
	EPaladinNPCEnableFactor__FACTOR_EnableCollision                                  = 1,
	EPaladinNPCEnableFactor__FACTOR_EnableBehaviorTree                               = 2,
	EPaladinNPCEnableFactor__FACTOR_EnablePerception                                 = 3,
	EPaladinNPCEnableFactor__FACTOR_RegisterActor                                    = 4,
	EPaladinNPCEnableFactor__FACTOR_MarkInMap                                        = 5,
	EPaladinNPCEnableFactor__FACTOR_EnableClothSim                                   = 6,
	EPaladinNPCEnableFactor__FACTOR_ResumeClothSim                                   = 7,
	EPaladinNPCEnableFactor__FACTOR_UpdateAnimation                                  = 8,
	EPaladinNPCEnableFactor__FACTOR_EnableMoveComponent                              = 9,
	EPaladinNPCEnableFactor__FACTOR_EnableBodyPhysics                                = 10,
	EPaladinNPCEnableFactor__FACTOR_None                                             = 11,
	EPaladinNPCEnableFactor__FACTOR_MAX                                              = 12
};

/// Enum /Script/Pal7.EBossBattleName
/// Size: 0x27
enum class EBossBattleName : uint8_t
{
	EBossBattleName__XiQu                                                            = 0,
	EBossBattleName__KuiYu_TianShiMen_Battle1                                        = 1,
	EBossBattleName__KuiYu_TianShiMen_Battle2                                        = 2,
	EBossBattleName__KuiYu_LuLongZhen                                                = 3,
	EBossBattleName__BingXianShou                                                    = 4,
	EBossBattleName__HuaLiu                                                          = 5,
	EBossBattleName__HuoXianShou                                                     = 6,
	EBossBattleName__QiOu                                                            = 7,
	EBossBattleName__Jiuying                                                         = 8,
	EBossBattleName__JingJianRenOu                                                   = 9,
	EBossBattleName__JiaLouLuoWang                                                   = 10,
	EBossBattleName__MengZhang_TianShiMen                                            = 11,
	EBossBattleName__ChongLou                                                        = 12,
	EBossBattleName__ChiRu                                                           = 13,
	EBossBattleName__DuZhangWeiShu                                                   = 14,
	EBossBattleName__MoHuai                                                          = 15,
	EBossBattleName__ShenGuan_XuYing                                                 = 16,
	EBossBattleName__ShenGuan_BenTi_S1                                               = 17,
	EBossBattleName__ShenGuan_BenTi_S2                                               = 18,
	EBossBattleName__ShenGuan_BenTi_S3                                               = 19,
	EBossBattleName__BossXiuWu_S1                                                    = 20,
	EBossBattleName__BossXiuWu_S2                                                    = 21,
	EBossBattleName__ChongLou_DiYiZhan                                               = 22,
	EBossBattleName__DuzhangQiOu                                                     = 23,
	EBossBattleName__JianShiGroup                                                    = 24,
	EBossBattleName__BattleNone                                                      = 25,
	EBossBattleName__EBossBattleName_MAX                                             = 26
};

/// Enum /Script/Pal7.EPaladinCookSurroundType
/// Size: 0x03
enum class EPaladinCookSurroundType : uint8_t
{
	EPaladinCookSurroundType__CST_OutDoor                                            = 0,
	EPaladinCookSurroundType__CST_InDoor                                             = 1,
	EPaladinCookSurroundType__CST_MAX                                                = 2
};

/// Enum /Script/Pal7.EPaladinGuideType
/// Size: 0x17
enum class EPaladinGuideType : uint8_t
{
	EPaladinGuideType__GuideType_Non                                                 = 0,
	EPaladinGuideType__GuideType_Move                                                = 1,
	EPaladinGuideType__GuideType_Jump                                                = 2,
	EPaladinGuideType__GuideType_JumpSprint                                          = 3,
	EPaladinGuideType__GuideType_UesItem                                             = 4,
	EPaladinGuideType__GuideType_Attack_single                                       = 5,
	EPaladinGuideType__GuideType_Attack_multi                                        = 6,
	EPaladinGuideType__GuideType_LianXie                                             = 7,
	EPaladinGuideType__GuideType_Dodge                                               = 8,
	EPaladinGuideType__GuideType_Skill                                               = 9,
	EPaladinGuideType__GuideType_KOBoss                                              = 10,
	EPaladinGuideType__GuideType_JianYu                                              = 11,
	EPaladinGuideType__GuideType_JianYu2                                             = 12,
	EPaladinGuideType__GuideType_ZhuiJi1                                             = 13,
	EPaladinGuideType__GuideType_ZhuiJi2                                             = 14,
	EPaladinGuideType__GuideType_ZhuiJi3                                             = 15,
	EPaladinGuideType__GuideType_Max                                                 = 16
};

/// Enum /Script/Pal7.EPaladinGuidProgress
/// Size: 0x08
enum class EPaladinGuidProgress : uint8_t
{
	EPaladinGuidProgress__GuideProgressType_Non                                      = 0,
	EPaladinGuidProgress__GuideProgressType_Normal_LianJi                            = 1,
	EPaladinGuidProgress__GuideProgressType_Air_LianJi                               = 2,
	EPaladinGuidProgress__GuideProgressType_LianXie                                  = 3,
	EPaladinGuidProgress__GuideProgressType_KillMonster                              = 4,
	EPaladinGuidProgress__GuideProgressType_Dodge                                    = 5,
	EPaladinGuidProgress__GuideProgressType_Skill                                    = 6,
	EPaladinGuidProgress__GuideProgressType_Max                                      = 7
};

/// Enum /Script/Pal7.EPaladinUIMouseCursor
/// Size: 0x04
enum class EPaladinUIMouseCursor : uint8_t
{
	EPaladinUIMouseCursor__None                                                      = 0,
	EPaladinUIMouseCursor__Default                                                   = 1,
	EPaladinUIMouseCursor__Type1                                                     = 2,
	EPaladinUIMouseCursor__EPaladinUIMouseCursor_MAX                                 = 3
};

/// Enum /Script/Pal7.EChangeNumberType
/// Size: 0x03
enum class EChangeNumberType : uint8_t
{
	EChangeNumberType__Increase                                                      = 0,
	EChangeNumberType__Reduce                                                        = 1,
	EChangeNumberType__EChangeNumberType_MAX                                         = 2
};

/// Enum /Script/Pal7.EPaladinLockChangeState
/// Size: 0x10
enum class EPaladinLockChangeState : uint8_t
{
	EPaladinLockChangeState__PalLock_NoneToPassive                                   = 0,
	EPaladinLockChangeState__PalLock_NoneToInitiative                                = 1,
	EPaladinLockChangeState__PalLock_PassiveToInitiative                             = 2,
	EPaladinLockChangeState__PalLock_PassiveToPassive                                = 3,
	EPaladinLockChangeState__PalLock_PassiveToNone                                   = 4,
	EPaladinLockChangeState__PalLock_InitiativeToPassive                             = 5,
	EPaladinLockChangeState__PalLock_InitiativeToInitiative                          = 6,
	EPaladinLockChangeState__PalLock_InitiativeToNone                                = 7,
	EPaladinLockChangeState__PalHero_None                                            = 10,
	EPaladinLockChangeState__EPaladinLockChangeState_MAX                             = 11
};

/// Enum /Script/Pal7.EQTEUMGType
/// Size: 0x05
enum class EQTEUMGType : uint8_t
{
	EQTEUMGType__SingleKeyPress                                                      = 0,
	EQTEUMGType__QTEWithProgress                                                     = 1,
	EQTEUMGType__CombatKeyPress                                                      = 2,
	EQTEUMGType__QTEUMGTypeMax                                                       = 3,
	EQTEUMGType__EQTEUMGType_MAX                                                     = 4
};

/// Enum /Script/Pal7.ECameraTemplate
/// Size: 0x05
enum class ECameraTemplate : uint8_t
{
	ECameraTemplate__CameraPitch_Low                                                 = 0,
	ECameraTemplate__CameraPitch_Middle                                              = 1,
	ECameraTemplate__CameraPitch_High                                                = 2,
	ECameraTemplate__CameraPitch_Custom                                              = 3,
	ECameraTemplate__CameraPitch_MAX                                                 = 4
};

/// Enum /Script/Pal7.ELightIntensity
/// Size: 0x05
enum class ELightIntensity : uint8_t
{
	ELightIntensity__ELight_Default                                                  = 0,
	ELightIntensity__ELight_Boss                                                     = 1,
	ELightIntensity__ELight_People                                                   = 2,
	ELightIntensity__ELight_Standby                                                  = 3,
	ELightIntensity__ELight_MAX                                                      = 4
};

/// Enum /Script/Pal7.EPaladinHeroWeaponState
/// Size: 0x07
enum class EPaladinHeroWeaponState : uint8_t
{
	EPaladinHeroWeaponState__PHWS_OnBody                                             = 0,
	EPaladinHeroWeaponState__PHWS_PickingUp                                          = 1,
	EPaladinHeroWeaponState__PHWS_InHand                                             = 2,
	EPaladinHeroWeaponState__PHWS_PuttingDown                                        = 3,
	EPaladinHeroWeaponState__PHWS_Null                                               = 4,
	EPaladinHeroWeaponState__PHWS_YuLing                                             = 5,
	EPaladinHeroWeaponState__PHWS_MAX                                                = 6
};

/// Enum /Script/Pal7.EPaladinBossStateType
/// Size: 0x06
enum class EPaladinBossStateType : uint8_t
{
	EPaladinBossStateType__EPalBS_None                                               = 0,
	EPaladinBossStateType__EPalBS_HuaLiu_KuangBao                                    = 1,
	EPaladinBossStateType__EPalBS_DuZhangWeiShu_ZhongDu                              = 2,
	EPaladinBossStateType__EPalBS_JingJianRenOu_HuDun                                = 3,
	EPaladinBossStateType__EPalBS_XiuWu_ZhongDu                                      = 4,
	EPaladinBossStateType__EPalBS_MAX                                                = 5
};

/// Enum /Script/Pal7.EPaladinPhotoMode
/// Size: 0x17
enum class EPaladinPhotoMode : uint8_t
{
	EPaladinPhotoMode__EPalPhoto_FocusLength                                         = 0,
	EPaladinPhotoMode__EPalPhoto_Aperture                                            = 1,
	EPaladinPhotoMode__EPalPhoto_FOV                                                 = 2,
	EPaladinPhotoMode__EPalPhoto_XRotation                                           = 3,
	EPaladinPhotoMode__EPalPhoto_Exposure                                            = 4,
	EPaladinPhotoMode__EPalPhoto_Filter                                              = 5,
	EPaladinPhotoMode__EPalPhoto_Chroma                                              = 6,
	EPaladinPhotoMode__EPalPhoto_Role                                                = 7,
	EPaladinPhotoMode__EPalPhoto_Action                                              = 8,
	EPaladinPhotoMode__EPalPhoto_Face                                                = 9,
	EPaladinPhotoMode__EPalPhoto_Decor                                               = 10,
	EPaladinPhotoMode__EPalPhoto_Frame                                               = 11,
	EPaladinPhotoMode__EPalPhoto_FrameSharpness                                      = 12,
	EPaladinPhotoMode__EPalPhoto_Decals                                              = 13,
	EPaladinPhotoMode__EPalPhoto_DecalsSharpness                                     = 14,
	EPaladinPhotoMode__EPalPhoto_Num                                                 = 15,
	EPaladinPhotoMode__EPalPhoto_MAX                                                 = 16
};

/// Enum /Script/Pal7.EOpenFunctionID
/// Size: 0x17
enum class EOpenFunctionID : uint8_t
{
	EOpenFunctionID__OpenFunctionID_QuickOpen                                        = 0,
	EOpenFunctionID__OpenFunctionID_Pet                                              = 1,
	EOpenFunctionID__OpenFunctionID_Museum                                           = 2,
	EOpenFunctionID__OpenFunctionID_CardGame                                         = 3,
	EOpenFunctionID__OpenFunctionID_Suit                                             = 4,
	EOpenFunctionID__OpenFunctionID_WeaponSkin                                       = 5,
	EOpenFunctionID__OpenFunctionID_HeroAwake                                        = 6,
	EOpenFunctionID__OpenFunctionID_HeroSummon                                       = 7,
	EOpenFunctionID__OpenFunctionID_UseItem                                          = 8,
	EOpenFunctionID__OpenFunctionID_Skill                                            = 9,
	EOpenFunctionID__OpenFunctionID_Overview                                         = 10,
	EOpenFunctionID__OpenFunctionID_Nv1InTeamOpenPet                                 = 11,
	EOpenFunctionID__OpenFunctionID_BigMap                                           = 12,
	EOpenFunctionID__OpenFunctionID_MiddleMap                                        = 13,
	EOpenFunctionID__OpenFunctionID_SQChangeSpeed                                    = 14,
	EOpenFunctionID__OpenFunctionID_None                                             = 15,
	EOpenFunctionID__OpenFunctionID_MAX                                              = 16
};

/// Enum /Script/Pal7.EPaladinBossDebuffType
/// Size: 0x04
enum class EPaladinBossDebuffType : uint8_t
{
	EPaladinBossDebuffType__EDebuff_None                                             = 0,
	EPaladinBossDebuffType__EDebuff_HpLimit                                          = 1,
	EPaladinBossDebuffType__EDebuff_HpMpExchange                                     = 2,
	EPaladinBossDebuffType__EDebuff_MAX                                              = 3
};

/// Enum /Script/Pal7.EFoot
/// Size: 0x04
enum class EFoot : uint8_t
{
	EFoot__E_Null                                                                    = 0,
	EFoot__E_LeftFoot                                                                = 1,
	EFoot__E_RightFoot                                                               = 2,
	EFoot__E_MAX                                                                     = 3
};

/// Enum /Script/Pal7.EPaladinPhotoModeType
/// Size: 0x04
enum class EPaladinPhotoModeType : uint8_t
{
	EPaladinPhotoModeType__EPalPhoto_Camera                                          = 0,
	EPaladinPhotoModeType__EPalPhoto_Hero                                            = 1,
	EPaladinPhotoModeType__EPalPhoto_Its                                             = 2,
	EPaladinPhotoModeType__EPalPhoto_MAX                                             = 3
};

/// Enum /Script/Pal7.EPaladinPhotoStateMode
/// Size: 0x04
enum class EPaladinPhotoStateMode : uint8_t
{
	EPaladinPhotoStateMode__EPhotoState_CurTaking                                    = 0,
	EPaladinPhotoStateMode__EPhotoState_PreviewEdit                                  = 1,
	EPaladinPhotoStateMode__EPhotoState_ExitPhoto                                    = 2,
	EPaladinPhotoStateMode__EPhotoState_MAX                                          = 3
};

/// Enum /Script/Pal7.EMiniMapPinType
/// Size: 0x03
enum class EMiniMapPinType : uint8_t
{
	EMiniMapPinType__PinMapPanel                                                     = 0,
	EMiniMapPinType__PinPlayerForward                                                = 1,
	EMiniMapPinType__EMiniMapPinType_MAX                                             = 2
};

/// Enum /Script/Pal7.ECruiseGameState
/// Size: 0x04
enum class ECruiseGameState : uint8_t
{
	ECruiseGameState__CS_Begine                                                      = 0,
	ECruiseGameState__CS_PrepareEnd                                                  = 1,
	ECruiseGameState__CS_End                                                         = 2,
	ECruiseGameState__CS_MAX                                                         = 3
};

/// Enum /Script/Pal7.EPaladinNPCEnableCompositeMode
/// Size: 0x04
enum class EPaladinNPCEnableCompositeMode : uint8_t
{
	EPaladinNPCEnableCompositeMode__MODE_NORMAL                                      = 0,
	EPaladinNPCEnableCompositeMode__MODE_OTHERFALSE                                  = 1,
	EPaladinNPCEnableCompositeMode__MODE_NONE                                        = 2,
	EPaladinNPCEnableCompositeMode__MODE_MAX                                         = 3
};

/// Enum /Script/Pal7.EAchievementType
/// Size: 0x05
enum class EAchievementType : uint8_t
{
	EAchievementType__BattleAchievement                                              = 0,
	EAchievementType__StoryAchievement                                               = 1,
	EAchievementType__SystemAchievement                                              = 2,
	EAchievementType__SideQuestAchievement                                           = 3,
	EAchievementType__EAchievementType_MAX                                           = 4
};

/// Enum /Script/Pal7.EMedalType
/// Size: 0x05
enum class EMedalType : uint8_t
{
	EMedalType__Bronze                                                               = 0,
	EMedalType__Silver                                                               = 1,
	EMedalType__Gold                                                                 = 2,
	EMedalType__Platinum                                                             = 3,
	EMedalType__EMedalType_MAX                                                       = 4
};

/// Enum /Script/Pal7.EActionRotateMode
/// Size: 0x03
enum class EActionRotateMode : uint8_t
{
	EActionRotateMode__ActionRotate_ToAngle                                          = 0,
	EActionRotateMode__ActionRotate_ToTarget                                         = 1,
	EActionRotateMode__ActionRotate_MAX                                              = 2
};

/// Enum /Script/Pal7.EAddionalMessageCondition
/// Size: 0x07
enum class EAddionalMessageCondition : uint8_t
{
	EAddionalMessageCondition__Equal                                                 = 0,
	EAddionalMessageCondition__NotEqual                                              = 1,
	EAddionalMessageCondition__MoreThan                                              = 2,
	EAddionalMessageCondition__LessThan                                              = 3,
	EAddionalMessageCondition__MoreAndEqual                                          = 4,
	EAddionalMessageCondition__LessAndEqual                                          = 5,
	EAddionalMessageCondition__EAddionalMessageCondition_MAX                         = 6
};

/// Enum /Script/Pal7.EAnimationTargetType
/// Size: 0x04
enum class EAnimationTargetType : uint8_t
{
	EAnimationTargetType__E_AnimationTargetType_None                                 = 0,
	EAnimationTargetType__E_AnimationTargetType_Self                                 = 1,
	EAnimationTargetType__E_AnimationTargetType_Target                               = 2,
	EAnimationTargetType__E_AnimationTargetType_MAX                                  = 3
};

/// Enum /Script/Pal7.ESpecialEnvironment
/// Size: 0x04
enum class ESpecialEnvironment : uint8_t
{
	ESpecialEnvironment__Null                                                        = 0,
	ESpecialEnvironment__Water                                                       = 1,
	ESpecialEnvironment__River                                                       = 2,
	ESpecialEnvironment__ESpecialEnvironment_MAX                                     = 3
};

/// Enum /Script/Pal7.EMovementState
/// Size: 0x07
enum class EMovementState : uint8_t
{
	EMovementState__E_Null                                                           = 0,
	EMovementState__E_Walk                                                           = 1,
	EMovementState__E_Run                                                            = 2,
	EMovementState__E_Rush                                                           = 3,
	EMovementState__E_Jump                                                           = 4,
	EMovementState__E_Dodge                                                          = 5,
	EMovementState__E_MAX                                                            = 6
};

/// Enum /Script/Pal7.AttackableNPCState
/// Size: 0x04
enum class AttackableNPCState : uint8_t
{
	AttackableNPCState__E_AttackAbleNPC_State_Idle                                   = 0,
	AttackableNPCState__E_AttackAbleNPC_State_InFighting                             = 1,
	AttackableNPCState__E_AttackAbleNPC_State_Die                                    = 2,
	AttackableNPCState__E_AttackAbleNPC_State_MAX                                    = 3
};

/// Enum /Script/Pal7.ENPCReceiveAttackedType
/// Size: 0x04
enum class ENPCReceiveAttackedType : uint8_t
{
	ENPCReceiveAttackedType__E_NPCReceiveDamage_From_Monster                         = 0,
	ENPCReceiveAttackedType__E_NPCReceiveDamage_From_Hero                            = 1,
	ENPCReceiveAttackedType__E_NPCReceiveDamage_From_BothMonsterAndHero              = 2,
	ENPCReceiveAttackedType__E_NPCReceiveDamage_From_MAX                             = 3
};

/// Enum /Script/Pal7.EHuoXianShouWeaponType
/// Size: 0x07
enum class EHuoXianShouWeaponType : uint8_t
{
	EHuoXianShouWeaponType__E_WEAPON_TYPE_Non                                        = 0,
	EHuoXianShouWeaponType__E_WEAPON_TYPE_CHANG_DAO                                  = 1,
	EHuoXianShouWeaponType__E_WEAPON_TYPE_CHUI_ZI                                    = 2,
	EHuoXianShouWeaponType__E_WEAPON_TYPE_DAO                                        = 3,
	EHuoXianShouWeaponType__E_WEAPON_TYPE_FUZI                                       = 4,
	EHuoXianShouWeaponType__E_WEAPON_TYPE_QIANG                                      = 5,
	EHuoXianShouWeaponType__E_WEAPON_TYPE_MAX                                        = 6
};

/// Enum /Script/Pal7.ETurnAroundMontageType
/// Size: 0x08
enum class ETurnAroundMontageType : uint8_t
{
	ETurnAroundMontageType__T_Montage_L                                              = 0,
	ETurnAroundMontageType__T_Montage_L2                                             = 1,
	ETurnAroundMontageType__T_Montage_L3                                             = 2,
	ETurnAroundMontageType__T_Montage_R                                              = 3,
	ETurnAroundMontageType__T_Montage_R5                                             = 4,
	ETurnAroundMontageType__T_Montage_R6                                             = 5,
	ETurnAroundMontageType__T_MONTAGE_MAX                                            = 6,
	ETurnAroundMontageType__T_MAX                                                    = 7
};

/// Enum /Script/Pal7.EDataCollectFileVersion
/// Size: 0x05
enum class EDataCollectFileVersion : uint8_t
{
	EDataCollectFileVersion__DC_V                                                    = 0,
	EDataCollectFileVersion__DC_V2                                                   = 1,
	EDataCollectFileVersion__DC_V3                                                   = 2,
	EDataCollectFileVersion__DC_V_CURRENT                                            = 3,
	EDataCollectFileVersion__DC_V_MAX                                                = 4
};

/// Enum /Script/Pal7.EQuestProgressType
/// Size: 0x05
enum class EQuestProgressType : uint8_t
{
	EQuestProgressType__NoAccept                                                     = 0,
	EQuestProgressType__InProgress                                                   = 1,
	EQuestProgressType__Finish                                                       = 2,
	EQuestProgressType__NotFinish                                                    = 3,
	EQuestProgressType__EQuestProgressType_MAX                                       = 4
};

/// Enum /Script/Pal7.EDialogueNodeType
/// Size: 0x08
enum class EDialogueNodeType : uint8_t
{
	EDialogueNodeType__SequenceNode                                                  = 0,
	EDialogueNodeType__PlayerChoiceSetNode                                           = 1,
	EDialogueNodeType__PlayerChoiceNode                                              = 2,
	EDialogueNodeType__BasicNode                                                     = 3,
	EDialogueNodeType__RandomNode                                                    = 4,
	EDialogueNodeType__TaskNode                                                      = 5,
	EDialogueNodeType__ActionNode                                                    = 6,
	EDialogueNodeType__EDialogueNodeType_MAX                                         = 7
};

/// Enum /Script/Pal7.EPaladinInteractionType
/// Size: 0x04
enum class EPaladinInteractionType : uint8_t
{
	EPaladinInteractionType__PalInteraction_Normal                                   = 0,
	EPaladinInteractionType__PalInteraction_LockEnemy                                = 1,
	EPaladinInteractionType__PalInteraction_NONE                                     = 10,
	EPaladinInteractionType__PalInteraction_MAX                                      = 11
};

/// Enum /Script/Pal7.EInteractionType
/// Size: 0x06
enum class EInteractionType : uint8_t
{
	EInteractionType__None                                                           = 0,
	EInteractionType__Dialogue                                                       = 1,
	EInteractionType__Pickup                                                         = 2,
	EInteractionType__ActionTask                                                     = 3,
	EInteractionType__Others                                                         = 4,
	EInteractionType__EInteractionType_MAX                                           = 5
};

/// Enum /Script/Pal7.EGainItemType
/// Size: 0x04
enum class EGainItemType : uint8_t
{
	EGainItemType__GIT_IMMEDIATELY                                                   = 0,
	EGainItemType__GIT_AFTERCUSTOMEVENT                                              = 1,
	EGainItemType__GIT_SPAWNSUBITEMS                                                 = 2,
	EGainItemType__GIT_MAX                                                           = 3
};

/// Enum /Script/Pal7.ELockType
/// Size: 0x04
enum class ELockType : uint8_t
{
	ELockType__E_Lock_State_None                                                     = 0,
	ELockType__E_Lock_State_Passive                                                  = 1,
	ELockType__E_Lock_State_Initiative                                               = 2,
	ELockType__E_Lock_State_MAX                                                      = 3
};

/// Enum /Script/Pal7.EDialogTriggerType
/// Size: 0x03
enum class EDialogTriggerType : uint8_t
{
	EDialogTriggerType__TriggerBattleBegin                                           = 0,
	EDialogTriggerType__TriggerBossHPPercent                                         = 1,
	EDialogTriggerType__EDialogTriggerType_MAX                                       = 2
};

/// Enum /Script/Pal7.EMengZhangAttackAttribute
/// Size: 0x04
enum class EMengZhangAttackAttribute : uint8_t
{
	EMengZhangAttackAttribute__MZ_ATKATTRIBUTE_BING                                  = 0,
	EMengZhangAttackAttribute__MZ_ATKATTRIBUTE_HUO                                   = 1,
	EMengZhangAttackAttribute__MZ_ATKATTRIBUTE_LEI                                   = 2,
	EMengZhangAttackAttribute__MZ_ATKATTRIBUTE_MAX                                   = 3
};

/// Enum /Script/Pal7.EPaladinSkillEffectMontage
/// Size: 0x04
enum class EPaladinSkillEffectMontage : uint8_t
{
	EPaladinSkillEffectMontage__MONTAGE_None                                         = 0,
	EPaladinSkillEffectMontage__MONTAGE_STUN                                         = 1,
	EPaladinSkillEffectMontage__MONTAGE_STUN_AIR                                     = 2,
	EPaladinSkillEffectMontage__MONTAGE_MAX                                          = 3
};

/// Enum /Script/Pal7.EPaladinActionMontage
/// Size: 0x16
enum class EPaladinActionMontage : uint8_t
{
	EPaladinActionMontage__MONTAGE_None                                              = 0,
	EPaladinActionMontage__MONTAGE_ALERT                                             = 1,
	EPaladinActionMontage__MONTAGE_BEATEN_FRONT                                      = 2,
	EPaladinActionMontage__MONTAGE_BEATEN_BACK                                       = 3,
	EPaladinActionMontage__MONTAGE_BEATEN_LEFT                                       = 4,
	EPaladinActionMontage__MONTAGE_BEATEN_RIGHT                                      = 5,
	EPaladinActionMontage__MONTAGE_BEATEN_FRONT2                                     = 6,
	EPaladinActionMontage__MONTAGE_BEATEN_BACK2                                      = 7,
	EPaladinActionMontage__MONTAGE_BEATEN_LEFT2                                      = 8,
	EPaladinActionMontage__MONTAGE_BEATEN_RIGHT2                                     = 9,
	EPaladinActionMontage__MONTAGE_GETUP_FRONT                                       = 10,
	EPaladinActionMontage__MONTAGE_GETUP_BACK                                        = 11,
	EPaladinActionMontage__MONTAGE_ATTACK                                            = 12,
	EPaladinActionMontage__MONTAGE_DEATH                                             = 13,
	EPaladinActionMontage__MONTAGE_Skill1                                            = 14,
	EPaladinActionMontage__MONTAGE_MAX                                               = 15
};

/// Enum /Script/Pal7.EMonsteraAnimStateNormal
/// Size: 0x05
enum class EMonsteraAnimStateNormal : uint8_t
{
	EMonsteraAnimStateNormal__E_MONSTER_ANIM_STATE_NORMAL_MOVEING                    = 0,
	EMonsteraAnimStateNormal__E_MONSTER_ANIM_STATE_NORMAL_IDLE                       = 1,
	EMonsteraAnimStateNormal__E_MONSTER_ANIM_STATE_NORMAL_DIE                        = 2,
	EMonsteraAnimStateNormal__E_MONSTER_ANIM_STATE_NORMAL_FALLDOWN                   = 3,
	EMonsteraAnimStateNormal__E_MONSTER_ANIM_STATE_NORMAL_MAX                        = 4
};

/// Enum /Script/Pal7.EMonsterSpeedMode
/// Size: 0x05
enum class EMonsterSpeedMode : uint8_t
{
	EMonsterSpeedMode__E_MONSTER_SPEED_TYPE_WALK                                     = 0,
	EMonsterSpeedMode__E_MONSTER_SPEED_TYPE_RUN                                      = 1,
	EMonsterSpeedMode__E_MONSTER_SPEED_TYPE_HOVER                                    = 2,
	EMonsterSpeedMode__E_MONSTER_SPEED_TYPE_FLY                                      = 3,
	EMonsterSpeedMode__E_MONSTER_SPEED_TYPE_MAX                                      = 4
};

/// Enum /Script/Pal7.EMonsterAttackType
/// Size: 0x04
enum class EMonsterAttackType : uint8_t
{
	EMonsterAttackType__E_MONSTER_ATK_TYPE_MELEE                                     = 0,
	EMonsterAttackType__E_MONSTER_ATK_TYPE_RANGE                                     = 1,
	EMonsterAttackType__E_MONSTER_ATK_TYPE_MIX                                       = 2,
	EMonsterAttackType__E_MONSTER_ATK_TYPE_MAX                                       = 3
};

/// Enum /Script/Pal7.EAISleepType
/// Size: 0x03
enum class EAISleepType : uint8_t
{
	EAISleepType__T_AISLEEP_NEVER                                                    = 0,
	EAISleepType__T_AISLEEP_BYDISTANCE                                               = 1,
	EAISleepType__T_AISLEEP_MAX                                                      = 2
};

/// Enum /Script/Pal7.EMonsterKind
/// Size: 0x109
enum class EMonsterKind : uint8_t
{
	EMonsterKind__MONSTER_NONE                                                       = 0,
	EMonsterKind__MONSTER_NORMAL_HUAYAO                                              = 1,
	EMonsterKind__MONSTER_NORMAL_YELING                                              = 2,
	EMonsterKind__MONSTER_NORMAL_FENGXIESHOU                                         = 3,
	EMonsterKind__MONSTER_NORMAL_SAIRENSHEN                                          = 4,
	EMonsterKind__MONSTER_NORMAL_WANSHIGUAI                                          = 5,
	EMonsterKind__MONSTER_NORMAL_JINGJIGUAI                                          = 6,
	EMonsterKind__MONSTER_NORMAL_CAIDAOPOPO                                          = 7,
	EMonsterKind__MONSTER_ELITE_MOHUARENSHEN                                         = 8,
	EMonsterKind__MONSTER_PATROLONLY_MOHUARENSHEN                                    = 9,
	EMonsterKind__MONSTER_NORMAL_XIQU                                                = 10,
	EMonsterKind__MONSTER_BOSS_XIUWU_Stage1                                          = 11,
	EMonsterKind__MONSTER_ELITE_GARGOYLE                                             = 12,
	EMonsterKind__MONSTER_NORMAL_JIALOULUO_MAN                                       = 13,
	EMonsterKind__MONSTER_ELITE_JIALOULUO_WOMAN                                      = 14,
	EMonsterKind__MONSTER_ELITE_BINGXUEJINGLING                                      = 15,
	EMonsterKind__MONSTER_ELITE_BINGXUEJINGLING_ELITE                                = 16,
	EMonsterKind__MONSTER_NORMAL_XUETONG                                             = 17,
	EMonsterKind__MONSTER_BOSS_KUIYU_B1_S1                                           = 18,
	EMonsterKind__MONSTER_BOSS_KUIYU_B1_S2                                           = 19,
	EMonsterKind__MONSTER_BOSS_KUIYU_B2                                              = 20,
	EMonsterKind__MONSTER_BOSS_HUALIU                                                = 21,
	EMonsterKind__MONSTER_NORMAL_UNFIGHT                                             = 22,
	EMonsterKind__MONSTER_BOSS_BINGXIANSHOU                                          = 23,
	EMonsterKind__MONSTER_NORMAL_BINGPIXIU                                           = 24,
	EMonsterKind__MONSTER_NORMAL_FENGHU                                              = 25,
	EMonsterKind__MONSTER_NORMAL_HUOPIXIU                                            = 26,
	EMonsterKind__MONSTER_BOSS_MENGZHANG                                             = 27,
	EMonsterKind__MONSTER_BOSS_CHONGLOU                                              = 28,
	EMonsterKind__MONSTER_NORMAL_SHUANGTOUSHE                                        = 29,
	EMonsterKind__MONSTER_NORMAL_SHEPIHUA                                            = 30,
	EMonsterKind__MONSTER_BOSS_QIOU_WUGOU                                            = 31,
	EMonsterKind__MONSTER_BOSS_QIOU_REHAI                                            = 32,
	EMonsterKind__MONSTER_BOSS_QIOU_WUHUN                                            = 33,
	EMonsterKind__MONSTER_BOSS_QIOU_LONGTAN                                          = 34,
	EMonsterKind__MONSTER_BOSS_QIOU_HANSUI                                           = 35,
	EMonsterKind__MONSTER_BOSS_AOQING_BENTI_S1                                       = 36,
	EMonsterKind__MONSTER_BOSS_AOQING_BENTI_S2                                       = 37,
	EMonsterKind__MONSTER_BOSS_AOQING_BENTI_S3                                       = 38,
	EMonsterKind__MONSTER_BOSS_AOQING_XUYING                                         = 39,
	EMonsterKind__MONSTER_NORMAL_SUMMONING_NV1                                       = 40,
	EMonsterKind__MONSTER_NORMAL_SUMMONING_NAN1                                      = 41,
	EMonsterKind__MONSTER_BOSS_JINGRENOU                                             = 42,
	EMonsterKind__MONSTER_BOSS_JIANRENOU                                             = 43,
	EMonsterKind__MONSTER_NORMAL_SHIRENHUA                                           = 44,
	EMonsterKind__MONSTER_BOSS_JIUYING                                               = 45,
	EMonsterKind__MONSTER_NORMAL_GUAIZAICHONG                                        = 46,
	EMonsterKind__MONSTER_NORMAL_HEGULAN                                             = 47,
	EMonsterKind__MONSTER_NORMAL_ANXIANG                                             = 48,
	EMonsterKind__MONSTER_NORMAL_MOLANG                                              = 49,
	EMonsterKind__MONSTER_BOSS_DUZHANGQIOU                                           = 50,
	EMonsterKind__MONSTER_BOSS_DUZHANGQIOU_JIUYING                                   = 51,
	EMonsterKind__MONSTER_BOSS_HUOXIANSHOU                                           = 52,
	EMonsterKind__MONSTER_BOSS_CHIRU                                                 = 53,
	EMonsterKind__MONSTER_BOSS_DUZHANGWEISHU                                         = 54,
	EMonsterKind__MONSTER_NORMAL_MOLONG                                              = 55,
	EMonsterKind__MONSTER_NORMAL_BANBOJIAZHOU                                        = 56,
	EMonsterKind__MONSTER_NORMAL_DengLongCaoJing                                     = 57,
	EMonsterKind__MONSTER_NORMAL_JianShi                                             = 58,
	EMonsterKind__MONSTER_BOSS_MOHUAI                                                = 59,
	EMonsterKind__MONSTER_MOHUAI_CHUSHOU                                             = 60,
	EMonsterKind__MONSTER_MOHUAI_CHUSHOU62                                           = 61,
	EMonsterKind__MONSTER_MOHUAI_CHUSHOU63                                           = 62,
	EMonsterKind__MONSTER_MOHUAI_CHUSHOU64                                           = 63,
	EMonsterKind__MONSTER_BOSS_JIALOULUOWANG                                         = 64,
	EMonsterKind__MONSTER_NORMAL_BAIJIASHIBING_GONG                                  = 65,
	EMonsterKind__MONSTER_NORMAL_BAIJIASHIBING_QIANG                                 = 66,
	EMonsterKind__MONSTER_NORMAL_BAIJIASHIBING_NUCHE                                 = 67,
	EMonsterKind__MONSTER_NORMAL_MOLANGJINAGYING                                     = 68,
	EMonsterKind__MONSTER_NORMAL_FULING                                              = 69,
	EMonsterKind__MONSTER_NORMAL_HUAYAO_LAN                                          = 70,
	EMonsterKind__MONSTER_NORMAL_ZHAOZEYUGUAI                                        = 71,
	EMonsterKind__MONSTER_NORMAL_ZHAOZEYUGUAIELITE                                   = 72,
	EMonsterKind__MONSTER_NORMAL_WANSHIGUAI2                                         = 73,
	EMonsterKind__MONSTER_ELITE_JianShi                                              = 74,
	EMonsterKind__MONSTER_QUEST_JINGJIGUAI_CHAP01                                    = 75,
	EMonsterKind__MONSTER_NORMAL_DIEXIAN                                             = 76,
	EMonsterKind__MONSTER_NORMAL_HUOSHU                                              = 77,
	EMonsterKind__MONSTER_NORMAL_RENMIANZHU                                          = 78,
	EMonsterKind__MONSTER_NORMAL_CAIDAOPOPOELITE                                     = 79,
	EMonsterKind__MONSTER_NORMAL_TONGCAO                                             = 80,
	EMonsterKind__MONSTER_NORMAL_AIZAINIAO                                           = 81,
	EMonsterKind__MONSTER_NORMAL_JINGRENOU_JINGZI                                    = 82,
	EMonsterKind__MONSTER_BOSS_XIUWU_Stage2                                          = 83,
	EMonsterKind__MONSTER_NORMAL_JianYu                                              = 84,
	EMonsterKind__MONSTER_BOSS_JIALOULUOWANGZHUIJI                                   = 85,
	EMonsterKind__MONSTER_NORMAL_SHENGUANXUYING_ZHENFADENGTA                         = 86,
	EMonsterKind__MONSTER_NORMAL_SHENGUANXUYING_GONGJIFULING                         = 87,
	EMonsterKind__MONSTER_NORMAL_SHENGUANXUYING_ZhiLiaoFULING                        = 88,
	EMonsterKind__MONSTER_ELITE_JINGJIGUAI                                           = 89,
	EMonsterKind__MONSTER_NORMAL_SHENGUANXUYING_FangHuZhao                           = 90,
	EMonsterKind__MONSTER_BOSS_CHONGLOUDIYIZHAN                                      = 91,
	EMonsterKind__MONSTER_NORMAL_ANXIANGELITE                                        = 92,
	EMonsterKind__MONSTER_ELITEE_FENGXIESHOU                                         = 93,
	EMonsterKind__MONSTER_NORMAL_XUETONGBLUE                                         = 94,
	EMonsterKind__MONSTER_BOSS_QIOUQUN                                               = 95,
	EMonsterKind__MONSTER_NORMAL_JIALOULUO_WOMAN_ZHUIZHU                             = 97,
	EMonsterKind__MONSTER_JIANSHI_GROUP                                              = 98,
	EMonsterKind__MONSTER_NORMAL_YELING_HAIDAO                                       = 99,
	EMonsterKind__MONSTER_QUEST_CAIDAOPOPO                                           = 100,
	EMonsterKind__MONSTER_QUEST_JINGJIGUAI_MAINQUESTCH01                             = 101,
	EMonsterKind__MONSTER_NORMAL_JIALOULUO_MAN_XUZHANG                               = 102,
	EMonsterKind__MONSTER_NORMAL_JIALOULUO_WOMAN_XUZHANG                             = 103,
	EMonsterKind__MONSTER_QUEST_TIAOZHANRENWU_MOLANG                                 = 104,
	EMonsterKind__MONSTER_UNFIGHT_SHUIWA                                             = 105,
	EMonsterKind__MONSTER_NORMAL_BAIJIASHIBING_GONG_FUMO                             = 106,
	EMonsterKind__MONSTER_NORMAL_BAIJIASHIBING_QIANG_FUMO                            = 107,
	EMonsterKind__MONSTER_NORMAL_BAIJIASHIBING_NUCHE_FUMO                            = 108,
	EMonsterKind__MONSTER_MAX                                                        = 109
};

/// Enum /Script/Pal7.EEnemyState
/// Size: 0x03
enum class EEnemyState : uint8_t
{
	EEnemyState__E_ENEMYSTATE_FIGHTING_READY                                         = 0,
	EEnemyState__E_ENEMYSTATE_FIGHTING_WAIT                                          = 1,
	EEnemyState__E_ENEMYSTATE_FIGHTING_MAX                                           = 2
};

/// Enum /Script/Pal7.ENavigationDirection
/// Size: 0x03
enum class ENavigationDirection : uint8_t
{
	ENavigationDirection__Horizontal                                                 = 0,
	ENavigationDirection__Vertical                                                   = 1,
	ENavigationDirection__ENavigationDirection_MAX                                   = 2
};

/// Enum /Script/Pal7.EPaladinSpecialEffectTargetType
/// Size: 0x05
enum class EPaladinSpecialEffectTargetType : uint8_t
{
	EPaladinSpecialEffectTargetType__Global                                          = 0,
	EPaladinSpecialEffectTargetType__OnlyTarget                                      = 1,
	EPaladinSpecialEffectTargetType__OnlySource                                      = 2,
	EPaladinSpecialEffectTargetType__BothSourceAndTarget                             = 3,
	EPaladinSpecialEffectTargetType__EPaladinSpecialEffectTargetType_MAX             = 4
};

/// Enum /Script/Pal7.ETargetFilterType
/// Size: 0x04
enum class ETargetFilterType : uint8_t
{
	ETargetFilterType__E_Filter_Friend                                               = 0,
	ETargetFilterType__E_Filter_Enemy                                                = 1,
	ETargetFilterType__E_Filter_All                                                  = 2,
	ETargetFilterType__E_Filter_MAX                                                  = 3
};

/// Enum /Script/Pal7.EPaladinAbilityEffectType
/// Size: 0x05
enum class EPaladinAbilityEffectType : uint8_t
{
	EPaladinAbilityEffectType__PAET_None                                             = 0,
	EPaladinAbilityEffectType__PAET_Buff                                             = 1,
	EPaladinAbilityEffectType__PAET_TimeDilatin                                      = 2,
	EPaladinAbilityEffectType__PAET_CameraShake                                      = 3,
	EPaladinAbilityEffectType__PAET_MAX                                              = 4
};

/// Enum /Script/Pal7.EPaladinActionScope
/// Size: 0x04
enum class EPaladinActionScope : uint8_t
{
	EPaladinActionScope__System                                                      = 0,
	EPaladinActionScope__Hero                                                        = 1,
	EPaladinActionScope__Owner                                                       = 2,
	EPaladinActionScope__EPaladinActionScope_MAX                                     = 3
};

/// Enum /Script/Pal7.EAnimalNPCState
/// Size: 0x06
enum class EAnimalNPCState : uint8_t
{
	EAnimalNPCState__Idle                                                            = 0,
	EAnimalNPCState__Walk                                                            = 1,
	EAnimalNPCState__Scared                                                          = 2,
	EAnimalNPCState__Crouch                                                          = 3,
	EAnimalNPCState__Around                                                          = 4,
	EAnimalNPCState__EAnimalNPCState_MAX                                             = 5
};

/// Enum /Script/Pal7.EAudioType
/// Size: 0x04
enum class EAudioType : uint8_t
{
	EAudioType__ENull                                                                = 0,
	EAudioType__ELevelBGM                                                            = 1,
	EAudioType__EEnvironment                                                         = 2,
	EAudioType__EAudioType_MAX                                                       = 3
};

/// Enum /Script/Pal7.EAudioChannelType
/// Size: 0x05
enum class EAudioChannelType : uint8_t
{
	EAudioChannelType__NONE                                                          = 0,
	EAudioChannelType__BGM                                                           = 1,
	EAudioChannelType__Volume                                                        = 2,
	EAudioChannelType__Boss                                                          = 3,
	EAudioChannelType__EAudioChannelType_MAX                                         = 4
};

/// Enum /Script/Pal7.ELoadingType
/// Size: 0x05
enum class ELoadingType : uint8_t
{
	ELoadingType__NotLoading                                                         = 0,
	ELoadingType__UILoading                                                          = 1,
	ELoadingType__LevelLoading                                                       = 2,
	ELoadingType__SequenceLoading                                                    = 3,
	ELoadingType__ELoadingType_MAX                                                   = 4
};

/// Enum /Script/Pal7.ESoundVolumeControlType
/// Size: 0x06
enum class ESoundVolumeControlType : uint8_t
{
	ESoundVolumeControlType__ENull                                                   = 0,
	ESoundVolumeControlType__EGlobalVolume                                           = 1,
	ESoundVolumeControlType__EBGMVolume                                              = 2,
	ESoundVolumeControlType__EEnvironmentVolume                                      = 3,
	ESoundVolumeControlType__EVoice                                                  = 4,
	ESoundVolumeControlType__ESoundVolumeControlType_MAX                             = 5
};

/// Enum /Script/Pal7.EMeshConfigType
/// Size: 0x03
enum class EMeshConfigType : uint8_t
{
	EMeshConfigType__MergeMesh                                                       = 0,
	EMeshConfigType__SetMasterPose                                                   = 1,
	EMeshConfigType__EMeshConfigType_MAX                                             = 2
};

/// Enum /Script/Pal7.EBaseAttr
/// Size: 0x11
enum class EBaseAttr : uint8_t
{
	EBaseAttr__E_Null                                                                = 0,
	EBaseAttr__E_CharacterLevel                                                      = 1,
	EBaseAttr__E_HP                                                                  = 2,
	EBaseAttr__E_MAXHP                                                               = 3,
	EBaseAttr__E_MP                                                                  = 4,
	EBaseAttr__E_MAXMP                                                               = 5,
	EBaseAttr__E_PhysicalAtk                                                         = 6,
	EBaseAttr__E_PhysicalDef                                                         = 7,
	EBaseAttr__E_SpellAtk                                                            = 8,
	EBaseAttr__E_SpellDef                                                            = 9,
	EBaseAttr__E_MAX                                                                 = 10
};

/// Enum /Script/Pal7.EBattleVoiceType
/// Size: 0x09
enum class EBattleVoiceType : uint8_t
{
	EBattleVoiceType__BV_None                                                        = 0,
	EBattleVoiceType__BV_BattleEndPartnerVoice                                       = 1,
	EBattleVoiceType__BV_ChangePlayerVoice                                           = 2,
	EBattleVoiceType__BV_MonsterBegineInBattle                                       = 4,
	EBattleVoiceType__BV_PartnerEncourange                                           = 8,
	EBattleVoiceType__BV_PartnerWorry                                                = 16,
	EBattleVoiceType__BV_DieOrRespawnVoice                                           = 32,
	EBattleVoiceType__BV_All                                                         = 255,
	EBattleVoiceType__BV_MAX                                                         = 256
};

/// Enum /Script/Pal7.AudioType
/// Size: 0x04
enum class AudioType : uint8_t
{
	AudioType__Music                                                                 = 0,
	AudioType__Effects                                                               = 1,
	AudioType__voice                                                                 = 2,
	AudioType__AudioType_MAX                                                         = 3
};

/// Enum /Script/Pal7.EPaladinCameraTransType
/// Size: 0x03
enum class EPaladinCameraTransType : uint8_t
{
	EPaladinCameraTransType__PalCamera_Normal                                        = 0,
	EPaladinCameraTransType__PalCamera_MoreMonster                                   = 1,
	EPaladinCameraTransType__PalCamera_MAX                                           = 2
};

/// Enum /Script/Pal7.ECharacterAttckType
/// Size: 0x04
enum class ECharacterAttckType : uint8_t
{
	ECharacterAttckType__T_DEFAULT                                                   = 0,
	ECharacterAttckType__T_RANGE                                                     = 1,
	ECharacterAttckType__T_MELEE                                                     = 2,
	ECharacterAttckType__T_MAX                                                       = 3
};

/// Enum /Script/Pal7.EBeatenBackDirection
/// Size: 0x06
enum class EBeatenBackDirection : uint8_t
{
	EBeatenBackDirection__BEATE_INVALID                                              = 0,
	EBeatenBackDirection__BEATEN_FRONT                                               = 1,
	EBeatenBackDirection__BEATEN_BACK                                                = 2,
	EBeatenBackDirection__BEATEN_LEFT                                                = 3,
	EBeatenBackDirection__BEATEN_RIGHT                                               = 4,
	EBeatenBackDirection__EBeatenBackDirection_MAX                                   = 5
};

/// Enum /Script/Pal7.EPaladinPassiveMoveMode
/// Size: 0x04
enum class EPaladinPassiveMoveMode : uint8_t
{
	EPaladinPassiveMoveMode__PPM_UseAnimationSpeed                                   = 0,
	EPaladinPassiveMoveMode__PPM_CustomSpeed                                         = 1,
	EPaladinPassiveMoveMode__PPM_UseAnimationVelocity                                = 2,
	EPaladinPassiveMoveMode__PPM_MAX                                                 = 3
};

/// Enum /Script/Pal7.EUseSkillFailErrorCode
/// Size: 0x05
enum class EUseSkillFailErrorCode : uint8_t
{
	EUseSkillFailErrorCode__SFEC_None                                                = 0,
	EUseSkillFailErrorCode__SFEC_NotEnoughMP                                         = 1,
	EUseSkillFailErrorCode__SFEC_CD                                                  = 2,
	EUseSkillFailErrorCode__SFEC_CannotUseWhenNotInFight                             = 3,
	EUseSkillFailErrorCode__SFEC_MAX                                                 = 4
};

/// Enum /Script/Pal7.EPaladinLogicalOperation
/// Size: 0x03
enum class EPaladinLogicalOperation : uint8_t
{
	EPaladinLogicalOperation__AND                                                    = 0,
	EPaladinLogicalOperation__OR                                                     = 1,
	EPaladinLogicalOperation__EPaladinLogicalOperation_MAX                           = 2
};

/// Enum /Script/Pal7.EPaladinCookFailReason
/// Size: 0x07
enum class EPaladinCookFailReason : uint8_t
{
	EPaladinCookFailReason__CFR_Unknown                                              = 0,
	EPaladinCookFailReason__CFR_Empty                                                = 1,
	EPaladinCookFailReason__CFR_Success                                              = 2,
	EPaladinCookFailReason__CST_Money                                                = 3,
	EPaladinCookFailReason__CST_Material                                             = 4,
	EPaladinCookFailReason__CFR_PerfectSuccess                                       = 5,
	EPaladinCookFailReason__EPaladinCookFailReason_MAX                               = 6
};

/// Enum /Script/Pal7.ECanAwakeState
/// Size: 0x04
enum class ECanAwakeState : uint8_t
{
	ECanAwakeState__CAS_None                                                         = 0,
	ECanAwakeState__CAS_Normal                                                       = 1,
	ECanAwakeState__CAS_Super                                                        = 2,
	ECanAwakeState__CAS_MAX                                                          = 3
};

/// Enum /Script/Pal7.EPaladinEngineGameMode
/// Size: 0x04
enum class EPaladinEngineGameMode : uint8_t
{
	EPaladinEngineGameMode__PalEngineGame_Engine                                     = 0,
	EPaladinEngineGameMode__PalEngineGame_PlayInEditor                               = 1,
	EPaladinEngineGameMode__PalEngineGame_StandaloneGame                             = 2,
	EPaladinEngineGameMode__PalEngineGame_MAX                                        = 3
};

/// Enum /Script/Pal7.EPaladinGameMode
/// Size: 0x06
enum class EPaladinGameMode : uint8_t
{
	EPaladinGameMode__PalGameMode_Normal                                             = 0,
	EPaladinGameMode__PalGameMode_Battle                                             = 1,
	EPaladinGameMode__PalGameMode_CardGame                                           = 2,
	EPaladinGameMode__PalGameMode_SplineGame                                         = 3,
	EPaladinGameMode__PalGameMode_PatroleGame                                        = 4,
	EPaladinGameMode__PalGameMode_MAX                                                = 5
};

/// Enum /Script/Pal7.EPaladinGameCulture
/// Size: 0x05
enum class EPaladinGameCulture : uint8_t
{
	EPaladinGameCulture__EPGC_Default                                                = 0,
	EPaladinGameCulture__EPGC_TraditionalChinese                                     = 1,
	EPaladinGameCulture__EPGC_English                                                = 2,
	EPaladinGameCulture__EPGC_Japanese                                               = 3,
	EPaladinGameCulture__EPGC_MAX                                                    = 4
};

/// Enum /Script/Pal7.EPaladinAbilityInputBinds
/// Size: 0x04
enum class EPaladinAbilityInputBinds : uint8_t
{
	EPaladinAbilityInputBinds__UnKnown                                               = 0,
	EPaladinAbilityInputBinds__ComboSkill                                            = 1,
	EPaladinAbilityInputBinds__PassiveAbility                                        = 2,
	EPaladinAbilityInputBinds__EPaladinAbilityInputBinds_MAX                         = 3
};

/// Enum /Script/Pal7.EPaladinCurveType
/// Size: 0x03
enum class EPaladinCurveType : uint8_t
{
	EPaladinCurveType__E_Curve_Type_Scalar                                           = 0,
	EPaladinCurveType__E_Curve_Type_LinearColor                                      = 1,
	EPaladinCurveType__E_Curve_Type_MAX                                              = 2
};

/// Enum /Script/Pal7.ESettingType
/// Size: 0x05
enum class ESettingType : uint8_t
{
	ESettingType__ES_Gameplay                                                        = 0,
	ESettingType__ES_Keys                                                            = 1,
	ESettingType__ES_Graphics                                                        = 2,
	ESettingType__ES_Audio                                                           = 3,
	ESettingType__ES_MAX                                                             = 4
};

/// Enum /Script/Pal7.ENVRTXType
/// Size: 0x06
enum class ENVRTXType : uint8_t
{
	ENVRTXType__EN_NVRTX                                                             = 0,
	ENVRTXType__EN_RTReflex                                                          = 1,
	ENVRTXType__EN_RTShadow                                                          = 2,
	ENVRTXType__EN_RTVRay                                                            = 3,
	ENVRTXType__EN_NVDLSS                                                            = 4,
	ENVRTXType__EN_MAX                                                               = 5
};

/// Enum /Script/Pal7.EHardwareType
/// Size: 0x04
enum class EHardwareType : uint8_t
{
	EHardwareType__Unknown                                                           = 0,
	EHardwareType__PAL_NVRTX                                                         = 1,
	EHardwareType__PAL_AMD                                                           = 2,
	EHardwareType__EHardwareType_MAX                                                 = 3
};

/// Enum /Script/Pal7.EPaladinTravelType
/// Size: 0x04
enum class EPaladinTravelType : uint8_t
{
	EPaladinTravelType__NoMove                                                       = 0,
	EPaladinTravelType__Transform                                                    = 1,
	EPaladinTravelType__PlayerStart                                                  = 2,
	EPaladinTravelType__EPaladinTravelType_MAX                                       = 3
};

/// Enum /Script/Pal7.ECharacterUnInterruptedFlag
/// Size: 0x06
enum class ECharacterUnInterruptedFlag : uint8_t
{
	ECharacterUnInterruptedFlag__UnInterruptedFlag_None                              = 0,
	ECharacterUnInterruptedFlag__UnInterruptedFlag_Buff                              = 1,
	ECharacterUnInterruptedFlag__UnInterruptedFlag_Dodging                           = 2,
	ECharacterUnInterruptedFlag__UnInterruptedFlag_ActionUnInterruptAble             = 4,
	ECharacterUnInterruptedFlag__UnInterruptedFlag_InStruckDown                      = 8,
	ECharacterUnInterruptedFlag__UnInterruptedFlag_MAX                               = 9
};

/// Enum /Script/Pal7.ESkillPreLoadType
/// Size: 0x03
enum class ESkillPreLoadType : uint8_t
{
	ESkillPreLoadType__EPT_SYNC                                                      = 0,
	ESkillPreLoadType__EPT_ASYNC                                                     = 1,
	ESkillPreLoadType__EPT_MAX                                                       = 2
};

/// Enum /Script/Pal7.EPaladinAbilityControlType
/// Size: 0x07
enum class EPaladinAbilityControlType : uint8_t
{
	EPaladinAbilityControlType__PA_NormalAttack                                      = 0,
	EPaladinAbilityControlType__PA_Skill                                             = 1,
	EPaladinAbilityControlType__PA_AwakenTrigger                                     = 2,
	EPaladinAbilityControlType__PA_AwakenSkill                                       = 3,
	EPaladinAbilityControlType__PA_ComboAttack                                       = 4,
	EPaladinAbilityControlType__PAC_MAX                                              = 5,
	EPaladinAbilityControlType__EPaladinAbilityControlType_MAX                       = 6
};

/// Enum /Script/Pal7.EPaladinAbilityType
/// Size: 0x12
enum class EPaladinAbilityType : uint8_t
{
	EPaladinAbilityType__PA_PhysicalDmg                                              = 0,
	EPaladinAbilityType__PA_SpellDmg                                                 = 1,
	EPaladinAbilityType__PA_EarthDmg                                                 = 2,
	EPaladinAbilityType__PA_WaterDmg                                                 = 3,
	EPaladinAbilityType__PA_FireDmg                                                  = 4,
	EPaladinAbilityType__PA_WindDmg                                                  = 5,
	EPaladinAbilityType__PA_LightningDmg                                             = 6,
	EPaladinAbilityType__PA_Heal                                                     = 7,
	EPaladinAbilityType__PA_BUff                                                     = 8,
	EPaladinAbilityType__PA_DeBuff                                                   = 9,
	EPaladinAbilityType__PA_Poison                                                   = 10,
	EPaladinAbilityType__PA_MAX                                                      = 11
};

/// Enum /Script/Pal7.EPaladinCharacterType
/// Size: 0x05
enum class EPaladinCharacterType : uint8_t
{
	EPaladinCharacterType__Hero                                                      = 0,
	EPaladinCharacterType__Mob                                                       = 1,
	EPaladinCharacterType__Elite                                                     = 2,
	EPaladinCharacterType__Boss                                                      = 3,
	EPaladinCharacterType__EPaladinCharacterType_MAX                                 = 4
};

/// Enum /Script/Pal7.EPaladinAbilityActiveTurnWay
/// Size: 0x04
enum class EPaladinAbilityActiveTurnWay : uint8_t
{
	EPaladinAbilityActiveTurnWay__PAATW_None                                         = 0,
	EPaladinAbilityActiveTurnWay__PAATW_TurnToLockTargetInstant                      = 1,
	EPaladinAbilityActiveTurnWay__PAATW_TurnToLockTargetRotation                     = 2,
	EPaladinAbilityActiveTurnWay__PAATW_MAX                                          = 3
};

/// Enum /Script/Pal7.EPaladinKeyEventType
/// Size: 0x03
enum class EPaladinKeyEventType : uint8_t
{
	EPaladinKeyEventType__EPalKeyEventType_SystemCommondKeyMapping                   = 0,
	EPaladinKeyEventType__EPalKeyEventType_SystemCommondKeyAction                    = 1,
	EPaladinKeyEventType__EPalKeyEventType_MAX                                       = 2
};

/// Enum /Script/Pal7.EPaladinKeyEventDeviceType
/// Size: 0x04
enum class EPaladinKeyEventDeviceType : uint8_t
{
	EPaladinKeyEventDeviceType__PKEDT_UnKnow                                         = 0,
	EPaladinKeyEventDeviceType__PKEDT_Keyboard                                       = 1,
	EPaladinKeyEventDeviceType__PKEDT_Gamepad                                        = 2,
	EPaladinKeyEventDeviceType__PKEDT_MAX                                            = 3
};

/// Enum /Script/Pal7.EPaladinKeyPressedType
/// Size: 0x06
enum class EPaladinKeyPressedType : uint8_t
{
	EPaladinKeyPressedType__PKPT_Pressed                                             = 0,
	EPaladinKeyPressedType__PKPT_ShortPressed                                        = 1,
	EPaladinKeyPressedType__PKPT_LongPressed                                         = 2,
	EPaladinKeyPressedType__PKPT_Hold                                                = 3,
	EPaladinKeyPressedType__PKPT_Released                                            = 4,
	EPaladinKeyPressedType__PKPT_MAX                                                 = 5
};

/// Enum /Script/Pal7.EAbilityPhysicalDmgType
/// Size: 0x03
enum class EAbilityPhysicalDmgType : uint8_t
{
	EAbilityPhysicalDmgType__A_Melee                                                 = 0,
	EAbilityPhysicalDmgType__A_Ranged                                                = 1,
	EAbilityPhysicalDmgType__A_MAX                                                   = 2
};

/// Enum /Script/Pal7.EAbilityElementalType
/// Size: 0x07
enum class EAbilityElementalType : uint8_t
{
	EAbilityElementalType__NoElement                                                 = 0,
	EAbilityElementalType__Earth                                                     = 1,
	EAbilityElementalType__Water                                                     = 2,
	EAbilityElementalType__Fire                                                      = 3,
	EAbilityElementalType__Wind                                                      = 4,
	EAbilityElementalType__Lightning                                                 = 5,
	EAbilityElementalType__EAbilityElementalType_MAX                                 = 6
};

/// Enum /Script/Pal7.ECharacterActionStateFlags
/// Size: 0x07
enum class ECharacterActionStateFlags : uint8_t
{
	ECharacterActionStateFlags__CharacterActionState_None                            = 0,
	ECharacterActionStateFlags__CharacterActionState_Move                            = 1,
	ECharacterActionStateFlags__CharacterActionState_Turn                            = 2,
	ECharacterActionStateFlags__CharacterActionState_Dodge                           = 4,
	ECharacterActionStateFlags__CharacterActionState_Attack                          = 8,
	ECharacterActionStateFlags__CharacterActionState_Last                            = 16,
	ECharacterActionStateFlags__CharacterActionState_MAX                             = 17
};

/// Enum /Script/Pal7.EPaladinGameDifficulty
/// Size: 0x06
enum class EPaladinGameDifficulty : uint8_t
{
	EPaladinGameDifficulty__D_Easy                                                   = 0,
	EPaladinGameDifficulty__D_Normal                                                 = 1,
	EPaladinGameDifficulty__D_Hard                                                   = 2,
	EPaladinGameDifficulty__D_Nightmare                                              = 3,
	EPaladinGameDifficulty__D_BossChallenge                                          = 4,
	EPaladinGameDifficulty__D_Max                                                    = 5
};

/// Enum /Script/Pal7.EBreakLevel
/// Size: 0x06
enum class EBreakLevel : uint8_t
{
	EBreakLevel__BREAK_LEVEL_NONE                                                    = 0,
	EBreakLevel__BREAK_LEVEL_ANIMATIONONLY                                           = 1,
	EBreakLevel__BREAK_LEVEL_ANIMATIONANDBEATENBACK                                  = 2,
	EBreakLevel__BREAK_LEVEL_ANIMATIONANDBEATENBACK_STRONG                           = 3,
	EBreakLevel__BREAK_LEVEL_STRUCKDOWNONLY                                          = 4,
	EBreakLevel__BREAK_LEVEL_MAX                                                     = 5
};

/// Enum /Script/Pal7.EAnimUROType
/// Size: 0x03
enum class EAnimUROType : uint8_t
{
	EAnimUROType__URO_ByDistanceFactor                                               = 0,
	EAnimUROType__URO_ByMeshLod                                                      = 1,
	EAnimUROType__URO_MAX                                                            = 2
};

/// Enum /Script/Pal7.EGameEndReason
/// Size: 0x07
enum class EGameEndReason : uint8_t
{
	EGameEndReason__EGameEnd_KilledInNormalMonsterFighting                           = 0,
	EGameEndReason__EGameEnd_KilledInBossFighting                                    = 1,
	EGameEndReason__EGameEnd_KilledInMissionFighting                                 = 2,
	EGameEndReason__EGameEnd_MissionFailed                                           = 3,
	EGameEndReason__EGameEnd_GuidFailed                                              = 4,
	EGameEndReason__EGameEnd_Other                                                   = 5,
	EGameEndReason__EGameEnd_MAX                                                     = 6
};

/// Enum /Script/Pal7.ECardType
/// Size: 0x11
enum class ECardType : uint8_t
{
	ECardType__ECardType_Tian                                                        = 0,
	ECardType__ECardType_Di                                                          = 1,
	ECardType__ECardType_Ren                                                         = 2,
	ECardType__ECardType_All                                                         = 3,
	ECardType__ECardType_Num                                                         = 4,
	ECardType__ECardType_None                                                        = 5,
	ECardType__ECardType_TianDi                                                      = 6,
	ECardType__ECardType_TianRen                                                     = 7,
	ECardType__ECardType_DiRen                                                       = 8,
	ECardType__ECardType_TianDiRen                                                   = 9,
	ECardType__ECardType_MAX                                                         = 10
};

/// Enum /Script/Pal7.EItemRarity
/// Size: 0x07
enum class EItemRarity : uint8_t
{
	EItemRarity__IT_Common                                                           = 0,
	EItemRarity__IT_Uncommon                                                         = 1,
	EItemRarity__IT_Rare                                                             = 2,
	EItemRarity__IT_Epic                                                             = 3,
	EItemRarity__IT_Legendary                                                        = 4,
	EItemRarity__TC_Rarity_MAX                                                       = 5,
	EItemRarity__EItemRarity_MAX                                                     = 6
};

/// Enum /Script/Pal7.EJointStrikeType
/// Size: 0x04
enum class EJointStrikeType : uint8_t
{
	EJointStrikeType__JointStrikeType_None                                           = 0,
	EJointStrikeType__JointStrikeType_Base                                           = 1,
	EJointStrikeType__JointStrikeType_Advance                                        = 2,
	EJointStrikeType__JointStrikeType_MAX                                            = 3
};

/// Enum /Script/Pal7.EPaladinUIOrder
/// Size: 0x06
enum class EPaladinUIOrder : uint8_t
{
	EPaladinUIOrder__MainUI                                                          = 0,
	EPaladinUIOrder__FunctionUI                                                      = 1,
	EPaladinUIOrder__MessageBox                                                      = 2,
	EPaladinUIOrder__SequenceLoading                                                 = 3,
	EPaladinUIOrder__MapLoading                                                      = 4,
	EPaladinUIOrder__EPaladinUIOrder_MAX                                             = 5
};

/// Enum /Script/Pal7.EUIProperty
/// Size: 0x06
enum class EUIProperty : uint8_t
{
	EUIProperty__MainUI                                                              = 0,
	EUIProperty__FunctionUI                                                          = 1,
	EUIProperty__MessageBox                                                          = 2,
	EUIProperty__LoadingAssetUI                                                      = 3,
	EUIProperty__LoadingUI                                                           = 4,
	EUIProperty__EUIProperty_MAX                                                     = 5
};

/// Enum /Script/Pal7.EBeatenBackMode
/// Size: 0x04
enum class EBeatenBackMode : uint8_t
{
	EBeatenBackMode__BeatenBackMode_None                                             = 0,
	EBeatenBackMode__BeatenBackMode_PassiveMove                                      = 1,
	EBeatenBackMode__BeatenBackMode_Physics                                          = 2,
	EBeatenBackMode__BeatenBackMode_MAX                                              = 3
};

/// Enum /Script/Pal7.EPaladinSuperHeroState
/// Size: 0x05
enum class EPaladinSuperHeroState : uint8_t
{
	EPaladinSuperHeroState__None                                                     = 0,
	EPaladinSuperHeroState__AppearanceShow                                           = 1,
	EPaladinSuperHeroState__BeginFight                                               = 2,
	EPaladinSuperHeroState__HeroBack                                                 = 3,
	EPaladinSuperHeroState__EPaladinSuperHeroState_MAX                               = 4
};

/// Enum /Script/Pal7.EDashState
/// Size: 0x05
enum class EDashState : uint8_t
{
	EDashState__DashState_None                                                       = 0,
	EDashState__DashState_Start                                                      = 1,
	EDashState__DashState_MakeEffect                                                 = 2,
	EDashState__DashState_End                                                        = 3,
	EDashState__DashState_MAX                                                        = 4
};

/// Enum /Script/Pal7.EPaladinHeroAttackState
/// Size: 0x04
enum class EPaladinHeroAttackState : uint8_t
{
	EPaladinHeroAttackState__Attack_Normal                                           = 0,
	EPaladinHeroAttackState__Attack_Sprint                                           = 1,
	EPaladinHeroAttackState__Attack_Dodge                                            = 2,
	EPaladinHeroAttackState__Attack_MAX                                              = 3
};

/// Enum /Script/Pal7.EPaladinHeroWalkState
/// Size: 0x05
enum class EPaladinHeroWalkState : uint8_t
{
	EPaladinHeroWalkState__MS_SLOWWALK                                               = 0,
	EPaladinHeroWalkState__MS_WALK                                                   = 1,
	EPaladinHeroWalkState__MS_BATTLEWALK                                             = 2,
	EPaladinHeroWalkState__MS_SPRINT                                                 = 3,
	EPaladinHeroWalkState__MS_MAX                                                    = 4
};

/// Enum /Script/Pal7.EPaladinInteractResult
/// Size: 0x04
enum class EPaladinInteractResult : uint8_t
{
	EPaladinInteractResult__Succeeded                                                = 0,
	EPaladinInteractResult__Failed                                                   = 1,
	EPaladinInteractResult__Aborted                                                  = 2,
	EPaladinInteractResult__EPaladinInteractResult_MAX                               = 3
};

/// Enum /Script/Pal7.EItemForgeResult
/// Size: 0x05
enum class EItemForgeResult : uint8_t
{
	EItemForgeResult__IT_Forge_Success                                               = 0,
	EItemForgeResult__IT_Forge_MoneyNotEnough                                        = 1,
	EItemForgeResult__IT_Forge_MaterialNotEnough                                     = 2,
	EItemForgeResult__IT_Forge_Other                                                 = 3,
	EItemForgeResult__IT_Forge_MAX                                                   = 4
};

/// Enum /Script/Pal7.EItemEnhanceResult
/// Size: 0x07
enum class EItemEnhanceResult : uint8_t
{
	EItemEnhanceResult__IT_Enhance_Success                                           = 0,
	EItemEnhanceResult__IT_Enhance_MaxTimes                                          = 1,
	EItemEnhanceResult__IT_Enhance_MaxLevel                                          = 2,
	EItemEnhanceResult__IT_Enhance_MoneyNotEnough                                    = 3,
	EItemEnhanceResult__IT_Enhance_MaterialNotEnough                                 = 4,
	EItemEnhanceResult__IT_Enhance_Other                                             = 5,
	EItemEnhanceResult__IT_Enhance_MAX                                               = 6
};

/// Enum /Script/Pal7.EMarkInMapType
/// Size: 0x03
enum class EMarkInMapType : uint8_t
{
	EMarkInMapType__MiniMap                                                          = 0,
	EMarkInMapType__BigMap                                                           = 1,
	EMarkInMapType__EMarkInMapType_MAX                                               = 2
};

/// Enum /Script/Pal7.ERelativeZAxisType
/// Size: 0x04
enum class ERelativeZAxisType : uint8_t
{
	ERelativeZAxisType__NearlyHight                                                  = 0,
	ERelativeZAxisType__AbovePlayer                                                  = 1,
	ERelativeZAxisType__UnderPlayer                                                  = 2,
	ERelativeZAxisType__ERelativeZAxisType_MAX                                       = 3
};

/// Enum /Script/Pal7.EPaladinMarkCategory
/// Size: 0x25
enum class EPaladinMarkCategory : uint8_t
{
	EPaladinMarkCategory__PlayerMark                                                 = 0,
	EPaladinMarkCategory__PlayerCustomMark                                           = 1,
	EPaladinMarkCategory__MainQuestTrack                                             = 16,
	EPaladinMarkCategory__BranchQuestTrack                                           = 17,
	EPaladinMarkCategory__QuestPublisher                                             = 18,
	EPaladinMarkCategory__NoActivedQuestTrack                                        = 19,
	EPaladinMarkCategory__InactiveBranchQuest                                        = 20,
	EPaladinMarkCategory__InactiveQuestPublisher                                     = 21,
	EPaladinMarkCategory__InactiveVisiblePublisher                                   = 22,
	EPaladinMarkCategory__Custom                                                     = 32,
	EPaladinMarkCategory__Teammate                                                   = 33,
	EPaladinMarkCategory__Entrance                                                   = 48,
	EPaladinMarkCategory__Exit                                                       = 49,
	EPaladinMarkCategory__Forging                                                    = 50,
	EPaladinMarkCategory__Weapon                                                     = 51,
	EPaladinMarkCategory__Cargo                                                      = 52,
	EPaladinMarkCategory__Herbs                                                      = 53,
	EPaladinMarkCategory__Cook                                                       = 54,
	EPaladinMarkCategory__Jump                                                       = 55,
	EPaladinMarkCategory__Card                                                       = 56,
	EPaladinMarkCategory__Scenic                                                     = 57,
	EPaladinMarkCategory__Collection                                                 = 58,
	EPaladinMarkCategory__Museum                                                     = 59,
	EPaladinMarkCategory__None                                                       = 255,
	EPaladinMarkCategory__EPaladinMarkCategory_MAX                                   = 256
};

/// Enum /Script/Pal7.EDistrictOperate
/// Size: 0x05
enum class EDistrictOperate : uint8_t
{
	EDistrictOperate__OP_UnLock                                                      = 0,
	EDistrictOperate__OP_Enable                                                      = 1,
	EDistrictOperate__OP_Locke                                                       = 2,
	EDistrictOperate__OP_Disable                                                     = 3,
	EDistrictOperate__OP_MAX                                                         = 4
};

/// Enum /Script/Pal7.EDistrictUnLockState
/// Size: 0x04
enum class EDistrictUnLockState : uint8_t
{
	EDistrictUnLockState__ST_Locked                                                  = 0,
	EDistrictUnLockState__ST_UnLockAndEnable                                         = 1,
	EDistrictUnLockState__ST_UnLockedAndDisabled                                     = 2,
	EDistrictUnLockState__ST_MAX                                                     = 3
};

/// Enum /Script/Pal7.EDistrictType
/// Size: 0x03
enum class EDistrictType : uint8_t
{
	EDistrictType__DT_RenJie                                                         = 0,
	EDistrictType__DT_MoJie                                                          = 1,
	EDistrictType__DT_MAX                                                            = 2
};

/// Enum /Script/Pal7.EPaladinLevelType
/// Size: 0x04
enum class EPaladinLevelType : uint8_t
{
	EPaladinLevelType__AlwaysLoaded                                                  = 0,
	EPaladinLevelType__CurrentLevel                                                  = 1,
	EPaladinLevelType__PrepareLevel                                                  = 2,
	EPaladinLevelType__EPaladinLevelType_MAX                                         = 3
};

/// Enum /Script/Pal7.EMathcFaceMaterialResult
/// Size: 0x04
enum class EMathcFaceMaterialResult : uint8_t
{
	EMathcFaceMaterialResult__AddToLockMap                                           = 0,
	EMathcFaceMaterialResult__RemoveFromLockMap                                      = 1,
	EMathcFaceMaterialResult__NoMatch                                                = 2,
	EMathcFaceMaterialResult__EMathcFaceMaterialResult_MAX                           = 3
};

/// Enum /Script/Pal7.EMergeMeshReplaceResult
/// Size: 0x04
enum class EMergeMeshReplaceResult : uint8_t
{
	EMergeMeshReplaceResult__ReplaceWithNew                                          = 0,
	EMergeMeshReplaceResult__SetMeshToNull                                           = 1,
	EMergeMeshReplaceResult__KeepCurrentMesh                                         = 2,
	EMergeMeshReplaceResult__EMergeMeshReplaceResult_MAX                             = 3
};

/// Enum /Script/Pal7.EMuseumItemLockState
/// Size: 0x04
enum class EMuseumItemLockState : uint8_t
{
	EMuseumItemLockState__Unknown                                                    = 0,
	EMuseumItemLockState__Locked                                                     = 1,
	EMuseumItemLockState__Opened                                                     = 2,
	EMuseumItemLockState__EMuseumItemLockState_MAX                                   = 3
};

/// Enum /Script/Pal7.EPaladinUIKeyControlType
/// Size: 0x06
enum class EPaladinUIKeyControlType : uint8_t
{
	EPaladinUIKeyControlType__DirectionNavigation                                    = 0,
	EPaladinUIKeyControlType__ChangePage                                             = 1,
	EPaladinUIKeyControlType__ChangePage2                                            = 2,
	EPaladinUIKeyControlType__ViewActor                                              = 3,
	EPaladinUIKeyControlType__Confirm                                                = 4,
	EPaladinUIKeyControlType__EPaladinUIKeyControlType_MAX                           = 5
};

/// Enum /Script/Pal7.EPaladinNPCCurveMethod
/// Size: 0x03
enum class EPaladinNPCCurveMethod : uint8_t
{
	EPaladinNPCCurveMethod__Approach                                                 = 0,
	EPaladinNPCCurveMethod__Linear                                                   = 1,
	EPaladinNPCCurveMethod__EPaladinNPCCurveMethod_MAX                               = 2
};

/// Enum /Script/Pal7.EBodypartType
/// Size: 0x04
enum class EBodypartType : uint8_t
{
	EBodypartType__E_Bodypart_Type_Body                                              = 0,
	EBodypartType__E_Bodypart_Type_Leg                                               = 1,
	EBodypartType__E_Bodypart_Type_Head                                              = 2,
	EBodypartType__E_Bodypart_Type_MAX                                               = 3
};

/// Enum /Script/Pal7.ESuperHeroType
/// Size: 0x07
enum class ESuperHeroType : uint8_t
{
	ESuperHeroType__SHT_None                                                         = 0,
	ESuperHeroType__SHT_JiuShen                                                      = 1,
	ESuperHeroType__SHT_WuShen                                                       = 2,
	ESuperHeroType__SHT_FaShen                                                       = 3,
	ESuperHeroType__SHT_GuShen                                                       = 4,
	ESuperHeroType__SHT_JianshShen                                                   = 5,
	ESuperHeroType__SHT_MAX                                                          = 6
};

/// Enum /Script/Pal7.ECameraModifierHandleType
/// Size: 0x04
enum class ECameraModifierHandleType : uint8_t
{
	ECameraModifierHandleType__Add                                                   = 0,
	ECameraModifierHandleType__OnlySelf                                              = 1,
	ECameraModifierHandleType__Ignore                                                = 2,
	ECameraModifierHandleType__ECameraModifierHandleType_MAX                         = 3
};

/// Enum /Script/Pal7.EPaladinPreloadLifeCycle
/// Size: 0x04
enum class EPaladinPreloadLifeCycle : uint8_t
{
	EPaladinPreloadLifeCycle__SameWithPlayMode                                       = 0,
	EPaladinPreloadLifeCycle__SameWithInstance                                       = 1,
	EPaladinPreloadLifeCycle__CustomManage                                           = 2,
	EPaladinPreloadLifeCycle__EPaladinPreloadLifeCycle_MAX                           = 3
};

/// Enum /Script/Pal7.EQTEWaveEndType
/// Size: 0x05
enum class EQTEWaveEndType : uint8_t
{
	EQTEWaveEndType__QTEWAVE_IMMEDIATELY_END                                         = 0,
	EQTEWaveEndType__QTEWAVE_IMMEDIATELY_SUCCESS_ONLY_END                            = 1,
	EQTEWaveEndType__QTEWAVE_IMMEDIATELY_FAIL_ONLY_END                               = 2,
	EQTEWaveEndType__QTEWAVE_TIMEOUT_END                                             = 3,
	EQTEWaveEndType__QTEWAVE_MAX                                                     = 4
};

/// Enum /Script/Pal7.EQuestState
/// Size: 0x04
enum class EQuestState : uint8_t
{
	EQuestState__Todo                                                                = 0,
	EQuestState__Open                                                                = 1,
	EQuestState__Complete                                                            = 2,
	EQuestState__EQuestState_MAX                                                     = 3
};

/// Enum /Script/Pal7.EQuestProccessIDCompareResult
/// Size: 0x06
enum class EQuestProccessIDCompareResult : uint8_t
{
	EQuestProccessIDCompareResult__LessThanMin                                       = 0,
	EQuestProccessIDCompareResult__BetweenMinAndMax                                  = 1,
	EQuestProccessIDCompareResult__GreaterThanMax                                    = 2,
	EQuestProccessIDCompareResult__ParamIsInvalid                                    = 3,
	EQuestProccessIDCompareResult__None                                              = 4,
	EQuestProccessIDCompareResult__EQuestProccessIDCompareResult_MAX                 = 5
};

/// Enum /Script/Pal7.EQuestActionExec
/// Size: 0x03
enum class EQuestActionExec : uint8_t
{
	EQuestActionExec__Exec                                                           = 0,
	EQuestActionExec__Skip                                                           = 1,
	EQuestActionExec__EQuestActionExec_MAX                                           = 2
};

/// Enum /Script/Pal7.EQuestInactiveReason
/// Size: 0x03
enum class EQuestInactiveReason : uint8_t
{
	EQuestInactiveReason__PickCondition                                              = 0,
	EQuestInactiveReason__NodeActiveCondition                                        = 1,
	EQuestInactiveReason__EQuestInactiveReason_MAX                                   = 2
};

/// Enum /Script/Pal7.EQuestTrackType
/// Size: 0x03
enum class EQuestTrackType : uint8_t
{
	EQuestTrackType__MainQuest                                                       = 0,
	EQuestTrackType__OtherQuest                                                      = 1,
	EQuestTrackType__EQuestTrackType_MAX                                             = 2
};

/// Enum /Script/Pal7.EPaladinSlotSaveDataType
/// Size: 0x21
enum class EPaladinSlotSaveDataType : uint8_t
{
	EPaladinSlotSaveDataType__MetaData                                               = 0,
	EPaladinSlotSaveDataType__HeroInfo                                               = 1,
	EPaladinSlotSaveDataType__TeamInfo                                               = 2,
	EPaladinSlotSaveDataType__EquipmentInfo                                          = 3,
	EPaladinSlotSaveDataType__EquipmentCategory                                      = 4,
	EPaladinSlotSaveDataType__HeroEquipmentList                                      = 5,
	EPaladinSlotSaveDataType__CardCategory                                           = 6,
	EPaladinSlotSaveDataType__LimitItem                                              = 7,
	EPaladinSlotSaveDataType__BattleDeckList                                         = 8,
	EPaladinSlotSaveDataType__ItemCategory                                           = 9,
	EPaladinSlotSaveDataType__ItemInfo                                               = 10,
	EPaladinSlotSaveDataType__ICardInfo                                              = 11,
	EPaladinSlotSaveDataType__MonsterInfo                                            = 12,
	EPaladinSlotSaveDataType__BattleField                                            = 13,
	EPaladinSlotSaveDataType__PetInfo                                                = 14,
	EPaladinSlotSaveDataType__GuidInfo                                               = 15,
	EPaladinSlotSaveDataType__FoodEffectData                                         = 16,
	EPaladinSlotSaveDataType__CookData                                               = 17,
	EPaladinSlotSaveDataType__QuestData                                              = 18,
	EPaladinSlotSaveDataType__Puzzle                                                 = 19,
	EPaladinSlotSaveDataType__EPaladinSlotSaveDataType_MAX                           = 20
};

/// Enum /Script/Pal7.EPaladinGlobalSaveDataType
/// Size: 0x04
enum class EPaladinGlobalSaveDataType : uint8_t
{
	EPaladinGlobalSaveDataType__Version                                              = 0,
	EPaladinGlobalSaveDataType__HardwareInfo                                         = 1,
	EPaladinGlobalSaveDataType__MemoryUnlockInfo                                     = 2,
	EPaladinGlobalSaveDataType__EPaladinGlobalSaveDataType_MAX                       = 3
};

/// Enum /Script/Pal7.EPaladinSaveGameFileVersion
/// Size: 0x58
enum class EPaladinSaveGameFileVersion : uint8_t
{
	EPaladinSaveGameFileVersion__InitialVersion                                      = 1,
	EPaladinSaveGameFileVersion__Version                                             = 2,
	EPaladinSaveGameFileVersion__Version3                                            = 3,
	EPaladinSaveGameFileVersion__Version_4                                           = 4,
	EPaladinSaveGameFileVersion__Version_45                                          = 5,
	EPaladinSaveGameFileVersion__Version_46                                          = 6,
	EPaladinSaveGameFileVersion__Version_47                                          = 7,
	EPaladinSaveGameFileVersion__Version_48                                          = 8,
	EPaladinSaveGameFileVersion__Version_49                                          = 9,
	EPaladinSaveGameFileVersion__Version_410                                         = 10,
	EPaladinSaveGameFileVersion__Version_411                                         = 11,
	EPaladinSaveGameFileVersion__Version_5                                           = 12,
	EPaladinSaveGameFileVersion__Version_513                                         = 13,
	EPaladinSaveGameFileVersion__Version_514                                         = 14,
	EPaladinSaveGameFileVersion__Version_515                                         = 15,
	EPaladinSaveGameFileVersion__Version_516                                         = 16,
	EPaladinSaveGameFileVersion__Version_517                                         = 17,
	EPaladinSaveGameFileVersion__Version_518                                         = 18,
	EPaladinSaveGameFileVersion__Version_519                                         = 19,
	EPaladinSaveGameFileVersion__Version_520                                         = 20,
	EPaladinSaveGameFileVersion__Version_521                                         = 21,
	EPaladinSaveGameFileVersion__Version_6                                           = 22,
	EPaladinSaveGameFileVersion__Version_1_0                                         = 23,
	EPaladinSaveGameFileVersion__Version_1_024                                       = 24,
	EPaladinSaveGameFileVersion__VersionEnum1                                        = 25,
	EPaladinSaveGameFileVersion__VersionEnum2                                        = 26,
	EPaladinSaveGameFileVersion__VersionEnum3                                        = 27,
	EPaladinSaveGameFileVersion__VersionEnum4                                        = 28,
	EPaladinSaveGameFileVersion__VersionEnum5                                        = 29,
	EPaladinSaveGameFileVersion__VersionEnum6                                        = 30,
	EPaladinSaveGameFileVersion__VersionEnum7                                        = 31,
	EPaladinSaveGameFileVersion__VersionEnum8                                        = 32,
	EPaladinSaveGameFileVersion__VersionEnum9                                        = 33,
	EPaladinSaveGameFileVersion__VersionEnum10                                       = 34,
	EPaladinSaveGameFileVersion__VersionEnum11                                       = 35,
	EPaladinSaveGameFileVersion__VersionEnum12                                       = 36,
	EPaladinSaveGameFileVersion__VersionEnum13                                       = 37,
	EPaladinSaveGameFileVersion__VersionEnum14                                       = 38,
	EPaladinSaveGameFileVersion__VersionEnum15                                       = 39,
	EPaladinSaveGameFileVersion__VersionEnum16                                       = 40,
	EPaladinSaveGameFileVersion__VersionEnum17                                       = 41,
	EPaladinSaveGameFileVersion__VersionEnum18                                       = 42,
	EPaladinSaveGameFileVersion__VersionEnum19                                       = 43,
	EPaladinSaveGameFileVersion__VersionEnum20                                       = 44,
	EPaladinSaveGameFileVersion__VersionEnum21                                       = 45,
	EPaladinSaveGameFileVersion__VersionEnum22                                       = 46,
	EPaladinSaveGameFileVersion__VersionEnum23                                       = 47,
	EPaladinSaveGameFileVersion__VersionEnum24                                       = 48,
	EPaladinSaveGameFileVersion__VersionEnum25                                       = 49,
	EPaladinSaveGameFileVersion__VersionEnum26                                       = 50,
	EPaladinSaveGameFileVersion__VersionEnum27                                       = 51,
	EPaladinSaveGameFileVersion__VersionEnum28                                       = 52,
	EPaladinSaveGameFileVersion__VersionEnum29                                       = 53,
	EPaladinSaveGameFileVersion__VersionEnum30                                       = 54,
	EPaladinSaveGameFileVersion__VersionPlusOne                                      = 55,
	EPaladinSaveGameFileVersion__LatestVersion                                       = 28,
	EPaladinSaveGameFileVersion__VersionEnum457                                      = 28,
	EPaladinSaveGameFileVersion__EPaladinSaveGameFileVersion_MAX                     = 56
};

/// Enum /Script/Pal7.EPaladinAfterSequenceActionType
/// Size: 0x08
enum class EPaladinAfterSequenceActionType : uint8_t
{
	EPaladinAfterSequenceActionType__EACTIONTYPE_RECEIVEQUEST                        = 0,
	EPaladinAfterSequenceActionType__EACTIONTYPE_QUESTUPDATE                         = 1,
	EPaladinAfterSequenceActionType__EACTIONTYPE_NEXTSEQUENCE                        = 2,
	EPaladinAfterSequenceActionType__EACTIONTYPE_SEQUENCECUSTOM                      = 3,
	EPaladinAfterSequenceActionType__EACTIONTYPE_MOVETO                              = 4,
	EPaladinAfterSequenceActionType__EACTIONTYPE_ArchiveHelper                       = 5,
	EPaladinAfterSequenceActionType__EACTIONTYPE_ACTIONWITHBLOCK                     = 6,
	EPaladinAfterSequenceActionType__EACTIONTYPE_MAX                                 = 7
};

/// Enum /Script/Pal7.EPaladinQuestCheckWay
/// Size: 0x04
enum class EPaladinQuestCheckWay : uint8_t
{
	EPaladinQuestCheckWay__QuestProgress                                             = 0,
	EPaladinQuestCheckWay__ReceiveQuest                                              = 1,
	EPaladinQuestCheckWay__CompleteQuest                                             = 2,
	EPaladinQuestCheckWay__EPaladinQuestCheckWay_MAX                                 = 3
};

/// Enum /Script/Pal7.ESequencePauseInitiator
/// Size: 0x03
enum class ESequencePauseInitiator : uint8_t
{
	ESequencePauseInitiator__Player                                                  = 0,
	ESequencePauseInitiator__System                                                  = 1,
	ESequencePauseInitiator__ESequencePauseInitiator_MAX                             = 2
};

/// Enum /Script/Pal7.ESequenceInstanceState
/// Size: 0x11
enum class ESequenceInstanceState : uint8_t
{
	ESequenceInstanceState__Init                                                     = 0,
	ESequenceInstanceState__ExcBeforeAction                                          = 1,
	ESequenceInstanceState__ReadPlay                                                 = 2,
	ESequenceInstanceState__Playing                                                  = 3,
	ESequenceInstanceState__Waiting                                                  = 4,
	ESequenceInstanceState__Pausing                                                  = 5,
	ESequenceInstanceState__ExcAfterAction                                           = 6,
	ESequenceInstanceState__PendingKill                                              = 7,
	ESequenceInstanceState__Skipping                                                 = 8,
	ESequenceInstanceState__None                                                     = 9,
	ESequenceInstanceState__ESequenceInstanceState_MAX                               = 10
};

/// Enum /Script/Pal7.ESequencePlaySpeed
/// Size: 0x05
enum class ESequencePlaySpeed : uint8_t
{
	ESequencePlaySpeed__ESPS_1x                                                      = 0,
	ESequencePlaySpeed__ESPS_1_25x                                                   = 1,
	ESequencePlaySpeed__ESPS_1_5x                                                    = 2,
	ESequencePlaySpeed__ESPS_2x                                                      = 3,
	ESequencePlaySpeed__ESPS_MAX                                                     = 4
};

/// Enum /Script/Pal7.EInstanceHandleState
/// Size: 0x06
enum class EInstanceHandleState : uint8_t
{
	EInstanceHandleState__NeedPlay                                                   = 0,
	EInstanceHandleState__NeedWait                                                   = 1,
	EInstanceHandleState__NeedInterrupt                                              = 2,
	EInstanceHandleState__NeedPause                                                  = 3,
	EInstanceHandleState__None                                                       = 4,
	EInstanceHandleState__EInstanceHandleState_MAX                                   = 5
};

/// Enum /Script/Pal7.ESequencePresetHandleType
/// Size: 0x05
enum class ESequencePresetHandleType : uint8_t
{
	ESequencePresetHandleType__Wait                                                  = 0,
	ESequencePresetHandleType__Replace                                               = 1,
	ESequencePresetHandleType__Ignore                                                = 2,
	ESequencePresetHandleType__Parallel                                              = 3,
	ESequencePresetHandleType__ESequencePresetHandleType_MAX                         = 4
};

/// Enum /Script/Pal7.EPaladinGraphicsLevel
/// Size: 0x05
enum class EPaladinGraphicsLevel : uint8_t
{
	EPaladinGraphicsLevel__Default                                                   = 0,
	EPaladinGraphicsLevel__Low                                                       = 1,
	EPaladinGraphicsLevel__Medium                                                    = 2,
	EPaladinGraphicsLevel__High                                                      = 3,
	EPaladinGraphicsLevel__EPaladinGraphicsLevel_MAX                                 = 4
};

/// Enum /Script/Pal7.EAsycTimeLimitState
/// Size: 0x04
enum class EAsycTimeLimitState : uint8_t
{
	EAsycTimeLimitState__Default                                                     = 0,
	EAsycTimeLimitState__NormalEnterLevel                                            = 1,
	EAsycTimeLimitState__PrepareNextLevel                                            = 2,
	EAsycTimeLimitState__EAsycTimeLimitState_MAX                                     = 3
};

/// Enum /Script/Pal7.EPaladinTipsType
/// Size: 0x05
enum class EPaladinTipsType : uint8_t
{
	EPaladinTipsType__Tips_TrackQuest                                                = 0,
	EPaladinTipsType__Tips_NoviceTeaching                                            = 1,
	EPaladinTipsType__Tips_Illustration                                              = 2,
	EPaladinTipsType__None                                                           = 3,
	EPaladinTipsType__EPaladinTipsType_MAX                                           = 4
};

/// Enum /Script/Pal7.EPaladinUIAnimState
/// Size: 0x05
enum class EPaladinUIAnimState : uint8_t
{
	EPaladinUIAnimState__Opening                                                     = 0,
	EPaladinUIAnimState__Opened                                                      = 1,
	EPaladinUIAnimState__Closing                                                     = 2,
	EPaladinUIAnimState__Closed                                                      = 3,
	EPaladinUIAnimState__EPaladinUIAnimState_MAX                                     = 4
};

/// Enum /Script/Pal7.EPaladinUISelectedState
/// Size: 0x04
enum class EPaladinUISelectedState : uint8_t
{
	EPaladinUISelectedState__None                                                    = 0,
	EPaladinUISelectedState__Selected                                                = 1,
	EPaladinUISelectedState__Locked                                                  = 2,
	EPaladinUISelectedState__EPaladinUISelectedState_MAX                             = 3
};

/// Enum /Script/Pal7.EPaladinUIOpenWay
/// Size: 0x04
enum class EPaladinUIOpenWay : uint8_t
{
	EPaladinUIOpenWay__CoverOnCurrent                                                = 0,
	EPaladinUIOpenWay__JustCloseCurrent                                              = 1,
	EPaladinUIOpenWay__PushCurrentToStack                                            = 2,
	EPaladinUIOpenWay__EPaladinUIOpenWay_MAX                                         = 3
};

/// Enum /Script/Pal7.EZoneType
/// Size: 0x05
enum class EZoneType : uint8_t
{
	EZoneType__None                                                                  = 0,
	EZoneType__Story                                                                 = 1,
	EZoneType__PushQuest                                                             = 2,
	EZoneType__Moveto                                                                = 3,
	EZoneType__EZoneType_MAX                                                         = 4
};

/// Enum /Script/Pal7.EBattleEndGrade
/// Size: 0x04
enum class EBattleEndGrade : uint8_t
{
	EBattleEndGrade__BEG_EASY                                                        = 0,
	EBattleEndGrade__BEG_HARD                                                        = 1,
	EBattleEndGrade__BEG_ESCAPE                                                      = 2,
	EBattleEndGrade__BEG_MAX                                                         = 3
};

/// Class /Script/Pal7.AbilityTask_MySync
/// Size: 0x0010 (0x000080 - 0x000090)
class UAbilityTask_MySync : public UAbilityTask
{ 
public:
	SDK_UNDEFINED(16,1380) /* FMulticastInlineDelegate */ __um(OnSync);                                            // 0x0080   (0x0010)  


	/// Functions
	// Function /Script/Pal7.AbilityTask_MySync.WaitMySyncPoint
	// class UAbilityTask_MySync* WaitMySyncPoint(class UGameplayAbility* OwningAbility);                                    // [0xe2dcd0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AbilityTask_MySync.OnLocalConfirmCallback
	// void OnLocalConfirmCallback();                                                                                        // [0xe2d320] Final|Native|Public  
	// Function /Script/Pal7.AbilityTask_MySync.OnConfirmCallback
	// void OnConfirmCallback();                                                                                             // [0xe2d300] Final|Native|Public  
};

/// Class /Script/Pal7.AbilityTask_PlayMontage_New
/// Size: 0x00A8 (0x000080 - 0x000128)
class UAbilityTask_PlayMontage_New : public UAbilityTask
{ 
public:
	SDK_UNDEFINED(16,1381) /* FMulticastInlineDelegate */ __um(OnCompleted);                                       // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,1382) /* FMulticastInlineDelegate */ __um(OnBlendOut);                                        // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,1383) /* FMulticastInlineDelegate */ __um(OnInterrupted);                                     // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,1384) /* FMulticastInlineDelegate */ __um(OnCancelled);                                       // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,1385) /* FMulticastInlineDelegate */ __um(OnNotifyBegin);                                     // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,1386) /* FMulticastInlineDelegate */ __um(OnNotifyEnd);                                       // 0x00D0   (0x0010)  
	unsigned char                                      UnknownData00_6[0x48];                                      // 0x00E0   (0x0048)  MISSED


	/// Functions
	// Function /Script/Pal7.AbilityTask_PlayMontage_New.OnNotifyEndReceived
	// void OnNotifyEndReceived(FName NotifyName, FBranchingPointNotifyPayload& BranchingPointNotifyPayload);                // [0xe2d5e0] Final|Native|Public|HasOutParms 
	// Function /Script/Pal7.AbilityTask_PlayMontage_New.OnNotifyBeginReceived
	// void OnNotifyBeginReceived(FName NotifyName, FBranchingPointNotifyPayload& BranchingPointNotifyPayload);              // [0xe2d500] Final|Native|Public|HasOutParms 
	// Function /Script/Pal7.AbilityTask_PlayMontage_New.OnMontageInterrupted
	// void OnMontageInterrupted();                                                                                          // [0xe2d4e0] Final|Native|Public  
	// Function /Script/Pal7.AbilityTask_PlayMontage_New.OnMontageEnded
	// void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);                                                  // [0xe2d410] Final|Native|Public  
	// Function /Script/Pal7.AbilityTask_PlayMontage_New.OnMontageBlendingOut
	// void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);                                            // [0xe2d340] Final|Native|Public  
	// Function /Script/Pal7.AbilityTask_PlayMontage_New.CreatePlayMontageAndWaitProxy_New
	// class UAbilityTask_PlayMontage_New* CreatePlayMontageAndWaitProxy_New(class UGameplayAbility* OwningAbility, FName TaskInstanceName, class UAnimMontage* MontageToPlay, float Rate, FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale); // [0xe2cf70] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/Pal7.AbilityTask_WaitAbilityEnd
/// Size: 0x00B8 (0x000080 - 0x000138)
class UAbilityTask_WaitAbilityEnd : public UAbilityTask
{ 
public:
	SDK_UNDEFINED(16,1387) /* FMulticastInlineDelegate */ __um(OnAbilityEnd);                                      // 0x0080   (0x0010)  
	unsigned char                                      UnknownData00_6[0xA8];                                      // 0x0090   (0x00A8)  MISSED


	/// Functions
	// Function /Script/Pal7.AbilityTask_WaitAbilityEnd.WaitForAbilityEndWithTagRequirements
	// class UAbilityTask_WaitAbilityEnd* WaitForAbilityEndWithTagRequirements(class UGameplayAbility* OwningAbility, FGameplayTagRequirements TagRequirements, bool IncludeTriggeredAbilities, bool TriggerOnce); // [0xe2d930] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd_Query
	// class UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd_Query(class UGameplayAbility* OwningAbility, FGameplayTagQuery Query, bool IncludeTriggeredAbilities, bool TriggerOnce); // [0xe2db10] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd
	// class UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd(class UGameplayAbility* OwningAbility, FGameplayTag WithTag, FGameplayTag WithoutTag, bool IncludeTriggeredAbilities, bool TriggerOnce); // [0xe2d7a0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AbilityTask_WaitAbilityEnd.OnAbilityEndCallBack
	// void OnAbilityEndCallBack(FAbilityEndedData& EndedData);                                                              // [0xe2d260] Final|Native|Public|HasOutParms 
};

/// Class /Script/Pal7.AbilityTask_WaitMovementInput
/// Size: 0x0028 (0x000080 - 0x0000A8)
class UAbilityTask_WaitMovementInput : public UAbilityTask
{ 
public:
	SDK_UNDEFINED(16,1388) /* FMulticastInlineDelegate */ __um(OnMovementInput);                                   // 0x0080   (0x0010)  
	class APlayerController*                           CachedPlayerController;                                     // 0x0090   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0098   (0x0010)  MISSED


	/// Functions
	// Function /Script/Pal7.AbilityTask_WaitMovementInput.CreateWaitMovementInput
	// class UAbilityTask_WaitMovementInput* CreateWaitMovementInput(class UGameplayAbility* OwningAbility);                 // [0xe2d160] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/Pal7.AbilityTask_WaitSyncInputDir
/// Size: 0x0010 (0x000080 - 0x000090)
class UAbilityTask_WaitSyncInputDir : public UAbilityTask
{ 
public:
	SDK_UNDEFINED(16,1389) /* FMulticastInlineDelegate */ __um(OnSync);                                            // 0x0080   (0x0010)  


	/// Functions
	// Function /Script/Pal7.AbilityTask_WaitSyncInputDir.WaitSyncInputDir
	// class UAbilityTask_WaitSyncInputDir* WaitSyncInputDir(class UGameplayAbility* OwningAbility);                         // [0xe2dd50] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AbilityTask_WaitSyncInputDir.OnServerReceiveEvent
	// void OnServerReceiveEvent();                                                                                          // [0xe2d6c0] Final|Native|Protected 
};

/// Struct /Script/Pal7.ActionRotateSetting
/// Size: 0x0018 (0x000000 - 0x000018)
struct FActionRotateSetting
{ 
	EActionRotateMode                                  RotateMode;                                                 // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0001   (0x0003)  MISSED
	FName                                              CurveName;                                                  // 0x0004   (0x0008)  
	float                                              RotateAngle;                                                // 0x000C   (0x0004)  
	bool                                               bMovingRotate;                                              // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0011   (0x0003)  MISSED
	float                                              MaxRotateAngle;                                             // 0x0014   (0x0004)  
};

/// Class /Script/Pal7.ActionRotateNotify
/// Size: 0x0018 (0x000038 - 0x000050)
class UActionRotateNotify : public UAnimNotify
{ 
public:
	FActionRotateSetting                               ActionRotateSetting;                                        // 0x0038   (0x0018)  
};

/// Struct /Script/Pal7.SubConditionConfigInfo
/// Size: 0x00C0 (0x000000 - 0x0000C0)
struct FSubConditionConfigInfo
{ 
	int32_t                                            CurNum;                                                     // 0x0000   (0x0004)  
	int32_t                                            TargetNum;                                                  // 0x0004   (0x0004)  
	FName                                              SubgoalKey;                                                 // 0x0008   (0x0008)  
	SDK_UNDEFINED(24,1390) /* FText */                 __um(PreText);                                              // 0x0010   (0x0018)  
	SDK_UNDEFINED(24,1391) /* FText */                 __um(SplitText);                                            // 0x0028   (0x0018)  
	SDK_UNDEFINED(24,1392) /* FText */                 __um(PostText);                                             // 0x0040   (0x0018)  
	SDK_UNDEFINED(80,1393) /* TMap<FString, FText> */  __um(CustomParamMap);                                       // 0x0058   (0x0050)  
	SDK_UNDEFINED(16,1394) /* FString */               __um(FormatString);                                         // 0x00A8   (0x0010)  
	bool                                               bShowInQuestTrack;                                          // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00B9   (0x0007)  MISSED
};

/// Class /Script/Pal7.PaladinCondition
/// Size: 0x0110 (0x000028 - 0x000138)
class UPaladinCondition : public UObject
{ 
public:
	unsigned char                                      UnknownData00_3[0x48];                                      // 0x0000   (0x0048)  MISSED
	SDK_UNDEFINED(16,1395) /* FMulticastInlineDelegate */ __um(OnConditionMeet);                                   // 0x0048   (0x0010)  
	SDK_UNDEFINED(16,1396) /* FMulticastInlineDelegate */ __um(OnSubConditionMeet);                                // 0x0058   (0x0010)  
	bool                                               bIsNot : 1;                                                 // 0x0068:0 (0x0001)  
	unsigned char                                      UnknownData01_4[0x7];                                       // 0x0069   (0x0007)  MISSED
	FSubConditionConfigInfo                            SubgoalConfig;                                              // 0x0070   (0x00C0)  
	EPaladinLogicalOperation                           LogicalOperation;                                           // 0x0130   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0131   (0x0007)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinCondition.UnregisterChangedListener
	// void UnregisterChangedListener(class UWorld* WorldContext);                                                           // [0xe72c90] Native|Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCondition.SetConditonDesc
	// void SetConditonDesc(FName inString);                                                                                 // [0xe72b30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCondition.SetConditionKey
	// void SetConditionKey(FName InKey);                                                                                    // [0xe72ab0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCondition.SetConditionIndex
	// void SetConditionIndex(int32_t InIndex);                                                                              // [0xe72a30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCondition.ReturnInternal
	// bool ReturnInternal(bool bInResult);                                                                                  // [0xe729a0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.PaladinCondition.RegisterChangedListener
	// void RegisterChangedListener(class UWorld* WorldContext);                                                             // [0xe72910] Native|Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCondition.MeetSubgoalCondition
	// void MeetSubgoalCondition();                                                                                          // [0xe71bc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCondition.MeetCondition
	// void MeetCondition(bool bMeetCondition);                                                                              // [0xe71b30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCondition.InitCondition
	// void InitCondition(class UWorld* WorldContext, bool bResetSubgoal);                                                   // [0xe71850] Native|Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCondition.GetConditonDesc
	// FName GetConditonDesc();                                                                                              // [0xe713d0] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinCondition.GetConditionKey
	// FName GetConditionKey();                                                                                              // [0xe713b0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinCondition.GetConditionIndex
	// int32_t GetConditionIndex();                                                                                          // [0xe71390] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinCondition.CheckCondition
	// bool CheckCondition(class UObject* WorldContextObject);                                                               // [0xe70ed0] Native|Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Script/Pal7.DialogConditionBase
/// Size: 0x0000 (0x000138 - 0x000138)
class UDialogConditionBase : public UPaladinCondition
{ 
public:
};

/// Struct /Script/Pal7.AdditionalMessage
/// Size: 0x0020 (0x000000 - 0x000020)
struct FAdditionalMessage
{ 
	FName                                              KeyName;                                                    // 0x0000   (0x0008)  
	SDK_UNDEFINED(16,1397) /* FString */               __um(Option);                                               // 0x0008   (0x0010)  
	bool                                               bNeedOtherValue;                                            // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0019   (0x0003)  MISSED
	int32_t                                            value;                                                      // 0x001C   (0x0004)  
};

/// Struct /Script/Pal7.AdditionMessageCondtion
/// Size: 0x0028 (0x000000 - 0x000028)
struct FAdditionMessageCondtion
{ 
	FName                                              KeyName;                                                    // 0x0000   (0x0008)  
	SDK_UNDEFINED(16,1398) /* FString */               __um(Option);                                               // 0x0008   (0x0010)  
	bool                                               bNeedOtherValue;                                            // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0019   (0x0003)  MISSED
	int32_t                                            value;                                                      // 0x001C   (0x0004)  
	EAddionalMessageCondition                          Condtion;                                                   // 0x0020   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0021   (0x0007)  MISSED
};

/// Class /Script/Pal7.AdditionalMessageCondition_Bp
/// Size: 0x0040 (0x000138 - 0x000178)
class UAdditionalMessageCondition_Bp : public UDialogConditionBase
{ 
public:
	TArray<FAdditionalMessage>                         AdditionMessage;                                            // 0x0138   (0x0010)  
	TArray<FAdditionMessageCondtion>                   HasAllAdditionalMessage;                                    // 0x0148   (0x0010)  
	TArray<FAdditionMessageCondtion>                   HasAnyAdditionalMessage;                                    // 0x0158   (0x0010)  
	TArray<FAdditionMessageCondtion>                   NotAnyAdditionalMessage;                                    // 0x0168   (0x0010)  
};

/// Class /Script/Pal7.AITask_TryActivateAbility
/// Size: 0x0060 (0x000070 - 0x0000D0)
class UAITask_TryActivateAbility : public UAITask
{ 
public:
	bool                                               bAllowRemoteActivation;                                     // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0071   (0x0003)  MISSED
	FGameplayAbilitySpecHandle                         AbilitySpecHandle;                                          // 0x0074   (0x0004)  
	class UClass*                                      AbilityClass;                                               // 0x0078   (0x0008)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0080   (0x0010)  MISSED
	SDK_UNDEFINED(16,1399) /* FMulticastInlineDelegate */ __um(OnAbilityEnd);                                      // 0x0090   (0x0010)  
	SDK_UNDEFINED(16,1400) /* FMulticastInlineDelegate */ __um(OnActiviteFailed);                                  // 0x00A0   (0x0010)  
	SDK_UNDEFINED(16,1401) /* FMulticastInlineDelegate */ __um(OnAbilityCancel);                                   // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,1402) /* FMulticastInlineDelegate */ __um(OnAbilityPostStage);                                // 0x00C0   (0x0010)  


	/// Functions
	// Function /Script/Pal7.AITask_TryActivateAbility.ExternalCancel
	// void ExternalCancel();                                                                                                // [0xe2d1e0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.AITask_TryActivateAbility.AITaskTryActivateAbility
	// class UAITask_TryActivateAbility* AITaskTryActivateAbility(class AAIController* Controller, class UClass* AbilityClass, bool bAllowRemoteActivation); // [0xe2ce70] Final|Native|Static|Public|BlueprintCallable 
};

/// Class /Script/Pal7.AnimNotify_PaladinBase
/// Size: 0x0010 (0x000038 - 0x000048)
class UAnimNotify_PaladinBase : public UAnimNotify
{ 
public:
	SDK_UNDEFINED(16,1403) /* FString */               __um(DisplayString);                                        // 0x0038   (0x0010)  
};

/// Class /Script/Pal7.AnimNotify_GlobalSpecialEffects
/// Size: 0x0010 (0x000048 - 0x000058)
class UAnimNotify_GlobalSpecialEffects : public UAnimNotify_PaladinBase
{ 
public:
	TArray<class UPaladinAbilitySpecialEffect*>        GlobalSpecialEffects;                                       // 0x0048   (0x0010)  
};

/// Class /Script/Pal7.AnimNotify_PlayCameraAnimation
/// Size: 0x0040 (0x000038 - 0x000078)
class UAnimNotify_PlayCameraAnimation : public UAnimNotify
{ 
public:
	float                                              DelayTime;                                                  // 0x0038   (0x0004)  
	EAnimationTargetType                               AnimationTargetType;                                        // 0x003C   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x003D   (0x0003)  MISSED
	class UCameraAnim*                                 CameraAnim;                                                 // 0x0040   (0x0008)  
	class UCurveFloat*                                 CustomCurve;                                                // 0x0048   (0x0008)  
	float                                              BlendOutTime;                                               // 0x0050   (0x0004)  
	float                                              Duration;                                                   // 0x0054   (0x0004)  
	EAlphaBlendOption                                  BlendOption;                                                // 0x0058   (0x0001)  
	ECameraAnimPlaySpace                               PlaySpace;                                                  // 0x0059   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1E];                                      // 0x005A   (0x001E)  MISSED


	/// Functions
	// Function /Script/Pal7.AnimNotify_PlayCameraAnimation.PlayCameraAnimation
	// void PlayCameraAnimation(class APaladinPlayerCameraManager* PaladinPlayerCameraManager, class APaladinCharacterBase* PaladinCharacter); // [0xe2d6e0] Final|Native|Protected|Const 
};

/// Class /Script/Pal7.AnimNotify_PlayFootStepsSound
/// Size: 0x0088 (0x000038 - 0x0000C0)
class UAnimNotify_PlayFootStepsSound : public UAnimNotify
{ 
public:
	EFoot                                              Foot;                                                       // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0039   (0x0007)  MISSED
	class USoundAtomCue*                               AtomSound;                                                  // 0x0040   (0x0008)  
	bool                                               bPlaySoundInAir;                                            // 0x0048   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0049   (0x0007)  MISSED
	class USoundAttenuation*                           AttenuationSettings;                                        // 0x0050   (0x0008)  
	float                                              VolumeMultiplier;                                           // 0x0058   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x005C   (0x0004)  MISSED
	float                                              PitchMultiplier;                                            // 0x0060   (0x0004)  
	bool                                               bSoundAttach;                                               // 0x0064   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0065   (0x0003)  MISSED
	FName                                              SoundAttachName;                                            // 0x0068   (0x0008)  
	class UParticleSystem*                             FootStepsParticle;                                          // 0x0070   (0x0008)  
	EMovementState                                     MovementState;                                              // 0x0078   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0079   (0x0003)  MISSED
	FVector                                            LocationOffset;                                             // 0x007C   (0x000C)  
	FRotator                                           RotationOffset;                                             // 0x0088   (0x000C)  
	FVector                                            Scale;                                                      // 0x0094   (0x000C)  
	bool                                               bParticleAttach;                                            // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x00A1   (0x0003)  MISSED
	FName                                              ParticleAttachName;                                         // 0x00A4   (0x0008)  
	unsigned char                                      UnknownData06_6[0x14];                                      // 0x00AC   (0x0014)  MISSED
};

/// Class /Script/Pal7.AnimNotify_PlayGhostMesh
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_PlayGhostMesh : public UAnimNotify
{ 
public:
	class UPaladinGhostMeshData*                       GhostMeshData;                                              // 0x0038   (0x0008)  
};

/// Class /Script/Pal7.AnimNotify_PlaySoundEx
/// Size: 0x0050 (0x000058 - 0x0000A8)
class UAnimNotify_PlaySoundEx : public UAnimNotify_PlaySound
{ 
public:
	bool                                               CanBlockBySpeechManager;                                    // 0x0058   (0x0001)  
	bool                                               PlayOnlyWhenBeHero;                                         // 0x0059   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x005A   (0x0006)  MISSED
	TArray<EBossBattleName>                            BlockWhenInTheseBattles;                                    // 0x0060   (0x0010)  
	class USoundAtomCue*                               AtomSound;                                                  // 0x0070   (0x0008)  
	SDK_UNDEFINED(16,1404) /* FString */               __um(Selector);                                             // 0x0078   (0x0010)  
	SDK_UNDEFINED(16,1405) /* FString */               __um(Label);                                                // 0x0088   (0x0010)  
	bool                                               bStopWhenAttachedToDestroyed;                               // 0x0098   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0099   (0x0007)  MISSED
	class USoundAttenuation*                           AttenuationSettings;                                        // 0x00A0   (0x0008)  
};

/// Class /Script/Pal7.AnimNotify_SimpleCameraAnim
/// Size: 0x0008 (0x000038 - 0x000040)
class UAnimNotify_SimpleCameraAnim : public UAnimNotify
{ 
public:
	class UPaladinSimpleCameraAnimData*                SimpleCameraAnimData;                                       // 0x0038   (0x0008)  
};

/// Class /Script/Pal7.AnimNotifyState_PlaySoundEx
/// Size: 0x0058 (0x000030 - 0x000088)
class UAnimNotifyState_PlaySoundEx : public UAnimNotifyState
{ 
public:
	class USoundAtomCue*                               AtomSound;                                                  // 0x0030   (0x0008)  
	SDK_UNDEFINED(16,1406) /* FString */               __um(Selector);                                             // 0x0038   (0x0010)  
	SDK_UNDEFINED(16,1407) /* FString */               __um(Label);                                                // 0x0048   (0x0010)  
	bool                                               DestroyOnNotifyEnd;                                         // 0x0058   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0059   (0x0003)  MISSED
	float                                              VolumeMultiplier;                                           // 0x005C   (0x0004)  
	float                                              PitchMultiplier;                                            // 0x0060   (0x0004)  
	bool                                               bFollow : 1;                                                // 0x0064:0 (0x0001)  
	unsigned char                                      UnknownData01_4[0x3];                                       // 0x0065   (0x0003)  MISSED
	FName                                              AttachName;                                                 // 0x0068   (0x0008)  
	class USoundAttenuation*                           AttenuationSettings;                                        // 0x0070   (0x0008)  
	class UAtomComponent*                              AtomComponent;                                              // 0x0078   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0080   (0x0008)  MISSED
};

/// Class /Script/Pal7.PaladinAntiAddictionComponent
/// Size: 0x0090 (0x0000B0 - 0x000140)
class UPaladinAntiAddictionComponent : public UActorComponent
{ 
public:
	SDK_UNDEFINED(16,1408) /* FMulticastInlineDelegate */ __um(ReceiveSystemTips);                                 // 0x00B0   (0x0010)  
	unsigned char                                      UnknownData00_6[0x80];                                      // 0x00C0   (0x0080)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinAntiAddictionComponent.GetPaladinAntiAddictionComponent
	// class UPaladinAntiAddictionComponent* GetPaladinAntiAddictionComponent();                                             // [0xe2d200] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Pal7.PaladinEquipment
/// Size: 0x0070 (0x000220 - 0x000290)
class APaladinEquipment : public AActor
{ 
public:
	unsigned char                                      UnknownData00_1[0x70];                                      // 0x0220   (0x0070)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinEquipment.TryReMoveEquip
	// void TryReMoveEquip(EItemMainType Type);                                                                              // [0xe7b1d0] Final|Native|Public  
	// Function /Script/Pal7.PaladinEquipment.SetPaladinHidden
	// void SetPaladinHidden(FName InLockCertificate, bool bInHidden);                                                       // [0xe7add0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEquipment.GetOwingHero
	// class APaladinHero* GetOwingHero();                                                                                   // [0xe79900] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEquipment.GetItemId
	// int32_t GetItemId();                                                                                                  // [0xe797f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Pal7.APaladinWeaponSkin
/// Size: 0x0038 (0x000290 - 0x0002C8)
class AAPaladinWeaponSkin : public APaladinEquipment
{ 
public:
	class USkeletalMeshComponent*                      SkinSK0Com;                                                 // 0x0290   (0x0008)  
	class USkeletalMeshComponent*                      SkinCoverSk0Com;                                            // 0x0298   (0x0008)  
	bool                                               bHaveWeaponCover : 1;                                       // 0x02A0:0 (0x0001)  
	bool                                               bIsDefault : 1;                                             // 0x02A0:1 (0x0001)  
	unsigned char                                      UnknownData00_4[0x7];                                       // 0x02A1   (0x0007)  MISSED
	TArray<class UMaterialInstanceDynamic*>            WeaponMeshDynamicMaterials;                                 // 0x02A8   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            WeaponCoverMeshDynamicMaterials;                            // 0x02B8   (0x0010)  


	/// Functions
	// Function /Script/Pal7.APaladinWeaponSkin.OnWeaponEquip
	// void OnWeaponEquip();                                                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.APaladinWeaponSkin.GetWeaponSkCom
	// class USkeletalMeshComponent* GetWeaponSkCom();                                                                       // [0xe2d230] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.APaladinWeaponSkin.GetWeaponCoverSkCom
	// class USkeletalMeshComponent* GetWeaponCoverSkCom();                                                                  // [0x7dfb50] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Pal7.AsyncTaskAttributeChanged
/// Size: 0x0060 (0x000030 - 0x000090)
class UAsyncTaskAttributeChanged : public UBlueprintAsyncActionBase
{ 
public:
	SDK_UNDEFINED(16,1409) /* FMulticastInlineDelegate */ __um(OnAttributeChanged);                                // 0x0030   (0x0010)  
	class UAbilitySystemComponent*                     ASC;                                                        // 0x0040   (0x0008)  
	unsigned char                                      UnknownData00_6[0x48];                                      // 0x0048   (0x0048)  MISSED


	/// Functions
	// Function /Script/Pal7.AsyncTaskAttributeChanged.ListenForAttributesChange
	// class UAsyncTaskAttributeChanged* ListenForAttributesChange(class UAbilitySystemComponent* AbilitySystemComponent, TArray<FGameplayAttribute> Attributes); // [0xe32a30] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AsyncTaskAttributeChanged.ListenForAttributeChange
	// class UAsyncTaskAttributeChanged* ListenForAttributeChange(class UAbilitySystemComponent* AbilitySystemComponent, FGameplayAttribute Attribute); // [0xe32830] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AsyncTaskAttributeChanged.EndTask
	// void EndTask();                                                                                                       // [0xe31fd0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Pal7.AsyncTaskCooldownChanged
/// Size: 0x0050 (0x000030 - 0x000080)
class UAsyncTaskCooldownChanged : public UBlueprintAsyncActionBase
{ 
public:
	SDK_UNDEFINED(16,1410) /* FMulticastInlineDelegate */ __um(OnCooldownBegin);                                   // 0x0030   (0x0010)  
	SDK_UNDEFINED(16,1411) /* FMulticastInlineDelegate */ __um(OnCooldownEnd);                                     // 0x0040   (0x0010)  
	class UAbilitySystemComponent*                     ASC;                                                        // 0x0050   (0x0008)  
	unsigned char                                      UnknownData00_6[0x28];                                      // 0x0058   (0x0028)  MISSED


	/// Functions
	// Function /Script/Pal7.AsyncTaskCooldownChanged.ListenForCooldownChange
	// class UAsyncTaskCooldownChanged* ListenForCooldownChange(class UAbilitySystemComponent* AbilitySystemComponent, FGameplayTagContainer CooldownTags, bool UseServerCooldown); // [0xe32b60] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/Pal7.AsyncTaskCooldownChanged.EndTask
	// void EndTask();                                                                                                       // [0xe31ff0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Pal7.AsyncTaskEffectStackChanged
/// Size: 0x0020 (0x000030 - 0x000050)
class UAsyncTaskEffectStackChanged : public UBlueprintAsyncActionBase
{ 
public:
	SDK_UNDEFINED(16,1412) /* FMulticastInlineDelegate */ __um(OnGameplayEffectStackChange);                       // 0x0030   (0x0010)  
	class UAbilitySystemComponent*                     ASC;                                                        // 0x0040   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0048   (0x0008)  MISSED


	/// Functions
	// Function /Script/Pal7.AsyncTaskEffectStackChanged.ListenForGameplayEffectStackChange
	// class UAsyncTaskEffectStackChanged* ListenForGameplayEffectStackChange(class UAbilitySystemComponent* AbilitySystemComponent, FGameplayTag EffectGameplayTag); // [0xe32cb0] Final|Native|Static|Private|BlueprintCallable 
	// Function /Script/Pal7.AsyncTaskEffectStackChanged.EndTask
	// void EndTask();                                                                                                       // [0xe32010] Final|Native|Private|BlueprintCallable 
};

/// Class /Script/Pal7.AtomSoundDistanceControl
/// Size: 0x0050 (0x0000B0 - 0x000100)
class UAtomSoundDistanceControl : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x50];                                      // 0x00B0   (0x0050)  MISSED


	/// Functions
	// Function /Script/Pal7.AtomSoundDistanceControl.ReceiveSwitchHeroEvent
	// void ReceiveSwitchHeroEvent(class APaladinHero* From, class APaladinHero* to);                                        // [0xe32fb0] Final|Native|Protected 
	// Function /Script/Pal7.AtomSoundDistanceControl.EndOverlap
	// void EndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // [0xe31e90] Final|Native|Protected 
	// Function /Script/Pal7.AtomSoundDistanceControl.BeginOverlap
	// void BeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0xe31c00] Final|Native|Protected|HasOutParms 
};

/// Struct /Script/Pal7.PaladinNPCEnableInfo
/// Size: 0x0002 (0x000000 - 0x000002)
struct FPaladinNPCEnableInfo
{ 
	EPaladinNPCEnableFactor                            Factor;                                                     // 0x0000   (0x0001)  
	bool                                               bValue : 1;                                                 // 0x0001:0 (0x0001)  
};

/// Struct /Script/Pal7.PaladinNPCEnableComposite
/// Size: 0x0018 (0x000000 - 0x000018)
struct FPaladinNPCEnableComposite
{ 
	EPaladinNPCEnableLord                              Lord;                                                       // 0x0000   (0x0001)  
	EPaladinNPCEnableCompositeMode                     CompositeMode;                                              // 0x0001   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0002   (0x0006)  MISSED
	TArray<FPaladinNPCEnableInfo>                      Infos;                                                      // 0x0008   (0x0010)  
};

/// Class /Script/Pal7.PaladinNPC
/// Size: 0x0090 (0x0004C0 - 0x000550)
#pragma pack(push, 0x1)
class alignas(0x10) APaladinNPC : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_3[0x10];                                      // 0x04B8   (0x0010)  MISSED
	SDK_UNDEFINED(16,1413) /* FMulticastInlineDelegate */ __um(OnMoveActiveDelegate);                              // 0x04C8   (0x0010)  
	SDK_UNDEFINED(16,1414) /* FMulticastInlineDelegate */ __um(OnEnableFactorChangedDelegate);                     // 0x04D8   (0x0010)  
	bool                                               IsAlwaysExist;                                              // 0x04E8   (0x0001)  
	bool                                               bAutoActiveMove : 1;                                        // 0x04E9:0 (0x0001)  
	bool                                               bEnableCharMove : 1;                                        // 0x04E9:1 (0x0001)  
	FGenericTeamId                                     TeamID;                                                     // 0x04EA   (0x0001)  
	bool                                               bEnableAI : 1;                                              // 0x04EB:0 (0x0001)  
	unsigned char                                      UnknownData01_4[0x4];                                       // 0x04EC   (0x0004)  MISSED
	class UBehaviorTree*                               BehaviorTree;                                               // 0x04F0   (0x0008)  
	bool                                               bEnableTurn : 1;                                            // 0x04F8:0 (0x0001)  
	bool                                               bIgnoreOnPS4 : 1;                                           // 0x04F8:1 (0x0001)  
	unsigned char                                      UnknownData02_4[0x7];                                       // 0x04F9   (0x0007)  MISSED
	class UInteractionComponent*                       InteractionComponent;                                       // 0x0500   (0x0008)  
	class UPaladinDynamicMonitorComponent*             DynamicMonitor;                                             // 0x0508   (0x0008)  
	class UPaladinActorInfoComponent*                  ActorInfoComponent;                                         // 0x0510   (0x0008)  
	class UPFPathFollowerComponent*                    PathFollowerComponent;                                      // 0x0518   (0x0008)  
	class UPaladinAISleepComponent*                    SleepComponent;                                             // 0x0520   (0x0008)  
	class UPaladinNPCAIPerceptionComponent*            PerceptionComponent;                                        // 0x0528   (0x0008)  
	unsigned char                                      UnknownData03_5[0x8];                                       // 0x0530   (0x0008)  MISSED
	TArray<FPaladinNPCEnableComposite>                 EnableComposites;                                           // 0x0538   (0x0010)  


	/// Functions
	// Function /Script/Pal7.PaladinNPC.SetSleepEnable
	// void SetSleepEnable(bool bEnable);                                                                                    // [0xeb2940] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinNPC.SetQuestEnable
	// void SetQuestEnable(bool bIsEnable);                                                                                  // [0xeb28b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinNPC.SetEnable
	// void SetEnable(FPaladinNPCEnableComposite& Composite);                                                                // [0xeb25d0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinNPC.RefreshEnable
	// void RefreshEnable();                                                                                                 // [0xeb24b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinNPC.Monitor_QuestTagChanged
	// void Monitor_QuestTagChanged();                                                                                       // [0xeb2250] Native|Protected     
	// Function /Script/Pal7.PaladinNPC.Monitor_QuestInvalidTagChanged
	// void Monitor_QuestInvalidTagChanged();                                                                                // [0xeb2230] Native|Protected     
	// Function /Script/Pal7.PaladinNPC.Monitor_QuestEnd
	// void Monitor_QuestEnd(FName InQuestInstanceID, FName InQuestID, EQuestCategory InQuestCategory);                      // [0xeb2130] Native|Protected     
	// Function /Script/Pal7.PaladinNPC.Monitor_PIDChanged
	// void Monitor_PIDChanged(int32_t PIDJudge, FName InQuestInstanceID, FName InQuestID, EQuestCategory InCategory);       // [0xeb1ff0] Native|Protected     
	// Function /Script/Pal7.PaladinNPC.Monitor_Init
	// void Monitor_Init(bool EnvTagExist, bool QuestTagExist, bool QuestInvalidTagExist, int32_t PIDJudge, bool ReceiveQuest, bool CompleteQuest); // [0xeb1e10] Native|Protected     
	// Function /Script/Pal7.PaladinNPC.IsNPCHidden
	// bool IsNPCHidden();                                                                                                   // [0xeb1a70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinNPC.IsMoveActive
	// bool IsMoveActive();                                                                                                  // [0xeb1a40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinNPC.IsFactorEnable
	// bool IsFactorEnable(EPaladinNPCEnableFactor Factor);                                                                  // [0xeb18c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinNPC.GetShowTurnDebugInfo
	// bool GetShowTurnDebugInfo();                                                                                          // [0xe7fdc0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinNPC.GetEnableList
	// TArray<FPaladinNPCEnableComposite> GetEnableList();                                                                   // [0xeb1430] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinNPC.ClearEnable
	// void ClearEnable(EPaladinNPCEnableLord InLord, bool bApplyLord);                                                      // [0xeb1260] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinNPC.CanEnablePerception
	// bool CanEnablePerception();                                                                                           // [0xeb1230] Native|Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinNPC.ActiveMove
	// void ActiveMove(bool Inactive, bool bReset);                                                                          // [0xeb0f10] Native|Public|BlueprintCallable 
};
#pragma pack(pop)

/// Class /Script/Pal7.PaladinAvatarNPC
/// Size: 0x0250 (0x000550 - 0x0007A0)
class APaladinAvatarNPC : public APaladinNPC
{ 
public:
	unsigned char                                      UnknownData00_3[0x78];                                      // 0x0548   (0x0078)  MISSED
	class UPhysicsAsset*                               MeshPhysicsAsset;                                           // 0x05C0   (0x0008)  
	TArray<class USkeletalMesh*>                       LoadedMergeMeshes;                                          // 0x05C8   (0x0010)  
	SDK_UNDEFINED(16,1415) /* TArray<TWeakObjectPtr<USkeletalMesh*>> */ __um(AsyncLoadMergeMesheQueues);           // 0x05D8   (0x0010)  
	SDK_UNDEFINED(80,1416) /* TMap<USkeletalMeshComponent*, TWeakObjectPtr<USkeletalMesh*>> */ __um(MasterMeshRuntimeMaps); // 0x05E8   (0x0050)  
	SDK_UNDEFINED(40,1417) /* TWeakObjectPtr<USkeletalMesh*> */ __um(HeadMeshSoftPtr);                             // 0x0638   (0x0028)  
	class USkeletalMeshComponent*                      Head;                                                       // 0x0660   (0x0008)  
	class USkeletalMeshComponent*                      Clothes;                                                    // 0x0668   (0x0008)  
	class USkeletalMeshComponent*                      Pants;                                                      // 0x0670   (0x0008)  
	SDK_UNDEFINED(16,1418) /* FMulticastInlineDelegate */ __um(OnMeshMergeDoneSignature);                          // 0x0678   (0x0010)  
	bool                                               bAllowMergeBodyParts;                                       // 0x0688   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0689   (0x0007)  MISSED
	SDK_UNDEFINED(16,1419) /* TArray<TWeakObjectPtr<USkeletalMesh*>> */ __um(MergeMeshes);                         // 0x0690   (0x0010)  
	TArray<FSkeletalMaterial>                          MergeOverrideMaterials;                                     // 0x06A0   (0x0010)  
	bool                                               bUseFinalMergeRule : 1;                                     // 0x06B0:0 (0x0001)  
	bool                                               bLockMergeMaterial : 1;                                     // 0x06B0:1 (0x0001)  
	bool                                               bDestoryTmpMeshComps : 1;                                   // 0x06B0:2 (0x0001)  
	unsigned char                                      UnknownData02_4[0x7];                                       // 0x06B1   (0x0007)  MISSED
	SDK_UNDEFINED(80,1420) /* TMap<TWeakObjectPtr<UMaterialInterface*>, TWeakObjectPtr<UMaterialInterface*>> */ __um(LockedMaterialMap); // 0x06B8   (0x0050)  
	SDK_UNDEFINED(16,1421) /* TArray<TWeakObjectPtr<USkeletalMesh*>> */ __um(MainMergeMeshes);                     // 0x0708   (0x0010)  
	SDK_UNDEFINED(1,1422) /* TEnumAsByte<EAnimationMode> */ __um(AnimationMode_NPC);                               // 0x0718   (0x0001)  
	unsigned char                                      UnknownData03_5[0x7];                                       // 0x0719   (0x0007)  MISSED
	SDK_UNDEFINED(40,1423) /* TWeakObjectPtr<UAnimationAsset*> */ __um(AnimToPlay_NPC);                            // 0x0720   (0x0028)  
	SDK_UNDEFINED(40,1424) /* TWeakObjectPtr<UClass*> */ __um(AnimInstClass_NPC);                                  // 0x0748   (0x0028)  
	SDK_UNDEFINED(40,1425) /* TWeakObjectPtr<UPhysicsAsset*> */ __um(DynamicPhysicsAsset);                         // 0x0770   (0x0028)  
	bool                                               bDynamicShowMesh : 1;                                       // 0x0798:0 (0x0001)  
	bool                                               bSuperNNNNNNNNNNNPC;                                        // 0x0799   (0x0001)  
	bool                                               bResetAnim_NPC;                                             // 0x079A   (0x0001)  
	bool                                               bReplaceMergeOldMesh_NPC;                                   // 0x079B   (0x0001)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x079C   (0x0004)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinAvatarNPC.UnloadMergedMesh
	// void UnloadMergedMesh();                                                                                              // [0xe5e610] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinAvatarNPC.RefreshFaceAnimInEditor
	// void RefreshFaceAnimInEditor(class UAnimSequenceBase*& FaceAnim);                                                     // [0xe5bdb0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinAvatarNPC.OnMergeMeshLoadDone
	// void OnMergeMeshLoadDone();                                                                                           // [0xe5a5e0] Final|Native|Private 
	// Function /Script/Pal7.PaladinAvatarNPC.OnMergeMeshDone
	// void OnMergeMeshDone(class USkeletalMesh* NewMesh);                                                                   // [0xe5a560] Final|Native|Private 
	// Function /Script/Pal7.PaladinAvatarNPC.LockOrRandomMergeMaterial
	// void LockOrRandomMergeMaterial(class USkeletalMeshComponent* MergeMeshComp);                                          // [0xe59ce0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinAvatarNPC.K2_SetFaceAnimationEnable
	// void K2_SetFaceAnimationEnable(bool Enable);                                                                          // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinAvatarNPC.DynamicUnloadMergedMesh
	// void DynamicUnloadMergedMesh();                                                                                       // [0xe53710] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinAvatarNPC.DynamicMergedMesh
	// void DynamicMergedMesh();                                                                                             // [0xe536f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinAvatarNPC.BuildMergePreviewMesh
	// void BuildMergePreviewMesh(bool bReBuild);                                                                            // [0xe52350] Final|Native|Public|BlueprintCallable 
};

/// Struct /Script/Pal7.SimpleAttackableNPCAttr
/// Size: 0x000C (0x000000 - 0x00000C)
struct FSimpleAttackableNPCAttr
{ 
	float                                              MaxHP;                                                      // 0x0000   (0x0004)  
	float                                              CurrentHP;                                                  // 0x0004   (0x0004)  
	float                                              DamagePerAttacked;                                          // 0x0008   (0x0004)  
};

/// Class /Script/Pal7.AttackableAvatarNPC
/// Size: 0x0030 (0x0007A0 - 0x0007D0)
class AAttackableAvatarNPC : public APaladinAvatarNPC
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x07A0   (0x0008)  MISSED
	FSimpleAttackableNPCAttr                           NPCAttribulte;                                              // 0x07A8   (0x000C)  
	bool                                               bImmediatelyGameEndIfDead;                                  // 0x07B4   (0x0001)  
	ENPCReceiveAttackedType                            CanReceiveDamageFrom;                                       // 0x07B5   (0x0001)  
	AttackableNPCState                                 CurrentState;                                               // 0x07B6   (0x0001)  
	unsigned char                                      UnknownData01_5[0x1];                                       // 0x07B7   (0x0001)  MISSED
	FGameplayTag                                       DieTriggerTag;                                              // 0x07B8   (0x0008)  
	unsigned char                                      UnknownData02_6[0x10];                                      // 0x07C0   (0x0010)  MISSED


	/// Functions
	// Function /Script/Pal7.AttackableAvatarNPC.RestAttribuilte
	// void RestAttribuilte();                                                                                               // [0xe33070] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.AttackableAvatarNPC.K2_ReceiveAttackedEvent
	// void K2_ReceiveAttackedEvent(class APaladinCharacterBase* Attacker);                                                  // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.AttackableAvatarNPC.K2_OnStateChange
	// void K2_OnStateChange(AttackableNPCState NewState);                                                                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.AttackableAvatarNPC.K2_OnDie
	// void K2_OnDie();                                                                                                      // [0x15dd8c0] Event|Public|BlueprintEvent 
};

/// Class /Script/Pal7.BaseCameraModifier
/// Size: 0x0068 (0x000048 - 0x0000B0)
class UBaseCameraModifier : public UCameraModifier
{ 
public:
	float                                              CooldownAfterPlayerInput;                                   // 0x0048   (0x0004)  
	unsigned char                                      UnknownData00_6[0x64];                                      // 0x004C   (0x0064)  MISSED
};

/// Class /Script/Pal7.BaseSceneAtmosphereModifier
/// Size: 0x0020 (0x000028 - 0x000048)
class UBaseSceneAtmosphereModifier : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0000   (0x0048)  MISSED


	/// Functions
	// Function /Script/Pal7.BaseSceneAtmosphereModifier.ReceiveRevertModify
	// void ReceiveRevertModify();                                                                                           // [0xe32f90] Native|Event|Public|BlueprintEvent 
	// Function /Script/Pal7.BaseSceneAtmosphereModifier.ReceiveApplyModify
	// void ReceiveApplyModify();                                                                                            // [0xe32f70] Native|Event|Public|BlueprintEvent 
	// Function /Script/Pal7.BaseSceneAtmosphereModifier.FinishModify
	// void FinishModify();                                                                                                  // [0xe32030] Final|Native|Public|BlueprintCallable 
};

/// Struct /Script/Pal7.BeatenEffectConfig
/// Size: 0x0018 (0x000000 - 0x000018)
struct FBeatenEffectConfig
{ 
	class UParticleSystem*                             Effect;                                                     // 0x0000   (0x0008)  
	float                                              Delay;                                                      // 0x0008   (0x0004)  
	FName                                              SocketName;                                                 // 0x000C   (0x0008)  
	bool                                               bAttach;                                                    // 0x0014   (0x0001)  
	bool                                               bPlayerHitEffect;                                           // 0x0015   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0016   (0x0002)  MISSED
};

/// Struct /Script/Pal7.CanLockPart
/// Size: 0x0010 (0x000000 - 0x000010)
struct FCanLockPart
{ 
	FName                                              SocketName;                                                 // 0x0000   (0x0008)  
	bool                                               bCanbeLock;                                                 // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              LockOffset;                                                 // 0x000C   (0x0004)  
};

/// Struct /Script/Pal7.LockTargetSet
/// Size: 0x001C (0x000000 - 0x00001C)
struct FLockTargetSet
{ 
	SDK_UNDEFINED(8,1426) /* TWeakObjectPtr<APaladinCharacterBase*> */ __um(LockTargetObj);                        // 0x0000   (0x0008)  
	ELockType                                          LockType;                                                   // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	FCanLockPart                                       CanLockPart;                                                // 0x000C   (0x0010)  
};

/// Class /Script/Pal7.PaladinCharacterBase
/// Size: 0x07C0 (0x0004C0 - 0x000C80)
#pragma pack(push, 0x1)
class alignas(0x10) APaladinCharacterBase : public ACharacter
{ 
public:
	unsigned char                                      UnknownData00_3[0x20];                                      // 0x04B8   (0x0020)  MISSED
	class UPaladinAbilitySystemComponent*              AbilitySystemComponent;                                     // 0x04D8   (0x0008)  
	class UPaladinCustomSpecialEffect_TimeDilation*    CustomSpecialEffect_TimeDilation;                           // 0x04E0   (0x0008)  
	class UPaladinPostprocessManager*                  PalPostProcessManager;                                      // 0x04E8   (0x0008)  
	class UPaladinBaseAttrSet*                         BaseAttrSet;                                                // 0x04F0   (0x0008)  
	class UPaladinSecondaryAttrSet*                    SecondaryAttrSet;                                           // 0x04F8   (0x0008)  
	class UPaladinActionAttrSet*                       ActionAttrSet;                                              // 0x0500   (0x0008)  
	FName                                              PaladinName;                                                // 0x0508   (0x0008)  
	class UAnimMontage*                                Montage_BeatenBack;                                         // 0x0510   (0x0008)  
	class UAnimMontage*                                Montage_BeatenFront;                                        // 0x0518   (0x0008)  
	class UAnimMontage*                                Montage_BeatenLeft;                                         // 0x0520   (0x0008)  
	class UAnimMontage*                                Montage_BeatenRight;                                        // 0x0528   (0x0008)  
	class UAnimMontage*                                Montage_BeatenBack2;                                        // 0x0530   (0x0008)  
	class UAnimMontage*                                Montage_BeatenFront2;                                       // 0x0538   (0x0008)  
	class UAnimMontage*                                Montage_BeatenLeft2;                                        // 0x0540   (0x0008)  
	class UAnimMontage*                                Montage_BeatenRight2;                                       // 0x0548   (0x0008)  
	class UAnimMontage*                                Montage_GetUpFront;                                         // 0x0550   (0x0008)  
	class UAnimMontage*                                Montage_GetUpBack;                                          // 0x0558   (0x0008)  
	class UAnimMontage*                                Montage_Death;                                              // 0x0560   (0x0008)  
	class UAnimMontage*                                Montage_Dodge;                                              // 0x0568   (0x0008)  
	class UAnimMontage*                                Montage_StrongBeatenBack;                                   // 0x0570   (0x0008)  
	class UAnimMontage*                                Montage_Stand;                                              // 0x0578   (0x0008)  
	class UDataTable*                                  _AbilityDataTable;                                          // 0x0580   (0x0008)  
	class UDataTable*                                  _BaseAttrDataTable;                                         // 0x0588   (0x0008)  
	TArray<class UClass*>                              EventAbilityList;                                           // 0x0590   (0x0010)  
	TArray<FBeatenEffectConfig>                        BeatenEffects;                                              // 0x05A0   (0x0010)  
	bool                                               _bInBattle;                                                 // 0x05B0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x05B1   (0x0003)  MISSED
	FLockTargetSet                                     LockTarget;                                                 // 0x05B4   (0x001C)  
	bool                                               bCanbeLock;                                                 // 0x05D0   (0x0001)  
	bool                                               bOcclusionCheck;                                            // 0x05D1   (0x0001)  
	bool                                               bShowInCreaseUINotControl;                                  // 0x05D2   (0x0001)  
	unsigned char                                      UnknownData02_5[0x5];                                       // 0x05D3   (0x0005)  MISSED
	SDK_UNDEFINED(16,1427) /* FMulticastInlineDelegate */ __um(OnReceiveGameplayEffectAppliedToSelf);              // 0x05D8   (0x0010)  
	SDK_UNDEFINED(16,1428) /* FMulticastInlineDelegate */ __um(OnHitByHostileDamage);                              // 0x05E8   (0x0010)  
	SDK_UNDEFINED(16,1429) /* FMulticastInlineDelegate */ __um(OnHPChanged);                                       // 0x05F8   (0x0010)  
	unsigned char                                      UnknownData03_5[0x30];                                      // 0x0608   (0x0030)  MISSED
	SDK_UNDEFINED(16,1430) /* FMulticastInlineDelegate */ __um(OnInOutFighting);                                   // 0x0638   (0x0010)  
	SDK_UNDEFINED(16,1431) /* FMulticastInlineDelegate */ __um(OnPaladinCharacterRespawn);                         // 0x0648   (0x0010)  
	SDK_UNDEFINED(16,1432) /* FMulticastInlineDelegate */ __um(OnPaladinCharacterDie);                             // 0x0658   (0x0010)  
	SDK_UNDEFINED(16,1433) /* FMulticastInlineDelegate */ __um(OnPaladinLandedEnd);                                // 0x0668   (0x0010)  
	unsigned char                                      UnknownData04_5[0x30];                                      // 0x0678   (0x0030)  MISSED
	SDK_UNDEFINED(16,1434) /* FMulticastInlineDelegate */ __um(OnDodgeDelegate);                                   // 0x06A8   (0x0010)  
	SDK_UNDEFINED(16,1435) /* FMulticastInlineDelegate */ __um(BeHitDelegate);                                     // 0x06B8   (0x0010)  
	float                                              BeHitCustomTimeDilationFactor;                              // 0x06C8   (0x0004)  
	unsigned char                                      UnknownData05_5[0x4];                                       // 0x06CC   (0x0004)  MISSED
	SDK_UNDEFINED(80,1436) /* TMap<EPhysicalSurface, USoundAtomCue*> */ __um(BeHitAtomSounds);                     // 0x06D0   (0x0050)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x0720   (0x0004)  MISSED
	float                                              SoundVolume;                                                // 0x0724   (0x0004)  
	class USoundAttenuation*                           AttenuationSettings;                                        // 0x0728   (0x0008)  
	SDK_UNDEFINED(80,1437) /* TMap<EPhysicalSurface, FAtomSelectorParam> */ __um(AtomSoundSelectorMap);            // 0x0730   (0x0050)  
	unsigned char                                      UnknownData07_5[0xC];                                       // 0x0780   (0x000C)  MISSED
	float                                              BodyDisappearTime;                                          // 0x078C   (0x0004)  
	bool                                               IsConfigAbilityNoBeatBack;                                  // 0x0790   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x0791   (0x0003)  MISSED
	float                                              StiffTime;                                                  // 0x0794   (0x0004)  
	TArray<FCanLockPart>                               CanLockParts;                                               // 0x0798   (0x0010)  
	float                                              BaseMoveSpeed;                                              // 0x07A8   (0x0004)  
	unsigned char                                      UnknownData09_5[0x4];                                       // 0x07AC   (0x0004)  MISSED
	class UClass*                                      BreakGE;                                                    // 0x07B0   (0x0008)  
	TArray<class UClass*>                              NativeBuffs;                                                // 0x07B8   (0x0010)  
	TArray<FGameplayAttribute>                         CharAttribute;                                              // 0x07C8   (0x0010)  
	bool                                               bCanAirBeatenBack;                                          // 0x07D8   (0x0001)  
	bool                                               bDebugASC;                                                  // 0x07D9   (0x0001)  
	bool                                               bOnlyOneDirectionStrukDown;                                 // 0x07DA   (0x0001)  
	bool                                               bDrawStruckDownArrow;                                       // 0x07DB   (0x0001)  
	unsigned char                                      UnknownData10_5[0x4];                                       // 0x07DC   (0x0004)  MISSED
	FTimerHandle                                       HBodyDisapear;                                              // 0x07E0   (0x0008)  
	bool                                               bDestroyDeathBody;                                          // 0x07E8   (0x0001)  
	unsigned char                                      UnknownData11_5[0x7];                                       // 0x07E9   (0x0007)  MISSED
	SDK_UNDEFINED(16,1438) /* FMulticastInlineDelegate */ __um(OnUpdateBuff);                                      // 0x07F0   (0x0010)  
	SDK_UNDEFINED(16,1439) /* FMulticastInlineDelegate */ __um(OnbilityActiveEvent);                               // 0x0800   (0x0010)  
	SDK_UNDEFINED(16,1440) /* FMulticastInlineDelegate */ __um(OnAbilityActiveEndEvent);                           // 0x0810   (0x0010)  
	bool                                               bCustomCanJump;                                             // 0x0820   (0x0001)  
	bool                                               bCanPushbyLeaderHero;                                       // 0x0821   (0x0001)  
	bool                                               bCanPushDamagebyHurt;                                       // 0x0822   (0x0001)  
	bool                                               bCanStruckDown;                                             // 0x0823   (0x0001)  
	bool                                               bIgnorePressure;                                            // 0x0824   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x0825   (0x0003)  MISSED
	SDK_UNDEFINED(16,1441) /* FMulticastInlineDelegate */ __um(OnCharacterSkillLoaded);                            // 0x0828   (0x0010)  
	bool                                               bNotPlayDeathMontage;                                       // 0x0838   (0x0001)  
	unsigned char                                      UnknownData13_5[0x13];                                      // 0x0839   (0x0013)  MISSED
	float                                              BeatenBackCD;                                               // 0x084C   (0x0004)  
	unsigned char                                      UnknownData14_5[0x383];                                     // 0x0850   (0x0383)  MISSED
	bool                                               bAntiStun;                                                  // 0x0BD3   (0x0001)  
	bool                                               bCanDie;                                                    // 0x0BD4   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x0BD5   (0x0003)  MISSED
	SDK_UNDEFINED(80,1442) /* TMap<FName, FGameplayAbilitySpecHandle> */ __um(CacheComboAbilitySpecHandles);       // 0x0BD8   (0x0050)  
	unsigned char                                      UnknownData16_6[0x50];                                      // 0x0C28   (0x0050)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinCharacterBase.UpdateTagMap
	// void UpdateTagMap(FGameplayTag& BaseTag, int32_t CountDelta);                                                         // [0xe678b0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.UnLockAllAction
	// void UnLockAllAction();                                                                                               // [0xe67890] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.TryTurnToLockEnemy
	// void TryTurnToLockEnemy(bool IsInstant);                                                                              // [0xe67800] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.TryExcuteAbilityByKey
	// bool TryExcuteAbilityByKey(FName Key);                                                                                // [0xe67770] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.TryExcuteAbility
	// bool TryExcuteAbility(class UClass* AbilityClass);                                                                    // [0xe676d0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.TryDoJump
	// void TryDoJump();                                                                                                     // [0xe676b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.TryDoDodge
	// bool TryDoDodge();                                                                                                    // [0xe67680] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.TryCancelCurrentAttackAbility
	// void TryCancelCurrentAttackAbility();                                                                                 // [0xe67660] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.ToggleSprintState
	// void ToggleSprintState(bool bOpen);                                                                                   // [0xe675d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.ToggleLockPartState
	// void ToggleLockPartState(FName SocketName, bool bCanLock);                                                            // [0xe67500] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.ToggleHasBeaternMove
	// void ToggleHasBeaternMove(bool bHasMove);                                                                             // [0xe67480] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.StartStruckDown
	// void StartStruckDown();                                                                                               // [0xe67460] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.StartFighting
	// void StartFighting();                                                                                                 // [0xe67440] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.ShowWidgetComp
	// void ShowWidgetComp();                                                                                                // [0xe67420] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetWidgetCompASCRef
	// void SetWidgetCompASCRef();                                                                                           // [0xe67400] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetScalarParameterToMID
	// void SetScalarParameterToMID(FName Param, float value);                                                               // [0xe67330] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetPaladinHidden
	// void SetPaladinHidden(FName InLockCertificate, bool bInHidden);                                                       // [0xe67260] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetNewBaseMoveSpeed
	// void SetNewBaseMoveSpeed(float NewSpeed);                                                                             // [0xe671e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetMovementEnabled
	// void SetMovementEnabled(bool IsEnabled);                                                                              // [0xe67150] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetIsFloating
	// void SetIsFloating(bool B);                                                                                           // [0xe670c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetInterruptedFlag
	// void SetInterruptedFlag(ECharacterUnInterruptedFlag UnInterruptedReason, bool bAdd);                                  // [0xe66ff0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetCurrentBreakLevelAndDir
	// void SetCurrentBreakLevelAndDir(EBreakLevel Level, FVector Dir);                                                      // [0xe66f20] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetAttribute
	// void SetAttribute(FGameplayAttribute Attribute, float NewValue);                                                      // [0xe66d20] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetAntiStun
	// void SetAntiStun(bool bValue);                                                                                        // [0xe66c90] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.SetActionStateFlag
	// void SetActionStateFlag(ECharacterActionStateFlags flag, bool B);                                                     // [0xe66bc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.RespawnPlayer
	// void RespawnPlayer(float HPPercent, bool bPlayMontage);                                                               // [0xe66af0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.ResetLockTarget
	// void ResetLockTarget();                                                                                               // [0xe66ad0] Native|Public        
	// Function /Script/Pal7.PaladinCharacterBase.RemoveBeatenBackQueue
	// void RemoveBeatenBackQueue();                                                                                         // [0xe66ab0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.RemoveAllDebuffWhenEndFigthing
	// void RemoveAllDebuffWhenEndFigthing();                                                                                // [0xe66a90] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.RemoveAllDebuffWhenDead
	// void RemoveAllDebuffWhenDead();                                                                                       // [0xe66a70] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.PrintAbilityDebugInfo
	// void PrintAbilityDebugInfo();                                                                                         // [0xe66a50] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.PlayJumpEndAnim
	// void PlayJumpEndAnim();                                                                                               // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.PerformBeatenRootMotion
	// void PerformBeatenRootMotion(FVector& WorldDirection, float& Strength, class UCurveFloat* PhysicsBeatenCureve, float Duration); // [0xe668d0] Final|Native|Private|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.PerfomrBeatenBack
	// void PerfomrBeatenBack(class UPaladinComboAbility* HitAbility, FVector& BeatenLocation, FVector& BeatenNormal, FBeatenBackParam& BeatenBackParam); // [0xe66740] Final|Native|Private|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.PalMovementComp
	// class UPaladinCharMovementComponent* PalMovementComp();                                                               // [0xe66710] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.OpenPassiveMove
	// void OpenPassiveMove(bool bSweep, EPaladinPassiveMoveMode MoveMode);                                                  // [0xe66650] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.OnSummonSuperHeroState
	// void OnSummonSuperHeroState(EPaladinSuperHeroState SuperHeroState);                                                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.OnStartStun
	// void OnStartStun();                                                                                                   // [0xe66630] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.OnMoveSpeedChange
	// void OnMoveSpeedChange();                                                                                             // [0xe66610] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.OnEndStun
	// void OnEndStun();                                                                                                     // [0xe665f0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.OnCharacterBreak
	// void OnCharacterBreak();                                                                                              // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.MarkUpdateCurrentCanUseAbilitiesDirty
	// void MarkUpdateCurrentCanUseAbilitiesDirty();                                                                         // [0xe665d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.MarkCanDodgeEnd
	// void MarkCanDodgeEnd();                                                                                               // [0xe665b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.LockAllAction
	// void LockAllAction();                                                                                                 // [0xe66590] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.K2_PostApplyDamage
	// void K2_PostApplyDamage(float& DamageAmount);                                                                         // [0x15dd8c0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnToggleAirBeatern
	// void K2_OnToggleAirBeatern(EBeatenBackDirection BeaternDirT, bool Open);                                              // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnStartStun
	// void K2_OnStartStun();                                                                                                // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnStartStruckDown
	// void K2_OnStartStruckDown(bool bFrontHit);                                                                            // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnStartFighting
	// void K2_OnStartFighting();                                                                                            // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnReceiveDamage
	// void K2_OnReceiveDamage(class AActor* Attacker, float& DamageAmount);                                                 // [0x15dd8c0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnReceiveCured
	// void K2_OnReceiveCured(class AActor* Curer, float& CureAmount);                                                       // [0x15dd8c0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnPushByLeaderHero
	// void K2_OnPushByLeaderHero(FVector PushDir);                                                                          // [0x15dd8c0] Event|Public|HasDefaults|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnGERemoved
	// void K2_OnGERemoved(class UGameplayEffect* GE);                                                                       // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnGamePlayCue
	// void K2_OnGamePlayCue(TEnumAsByte<EGameplayCueEvent> EventType, FGameplayCueParameters Parameters);                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnEndStun
	// void K2_OnEndStun();                                                                                                  // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnEndStruckDown
	// void K2_OnEndStruckDown(bool bFrontHit, bool bSkipedGetUp);                                                           // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnEndFighting
	// void K2_OnEndFighting();                                                                                              // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_OnDestructTarget
	// void K2_OnDestructTarget(class AActor* Target, FVector& HitLoc, FVector& HitNormal);                                  // [0x15dd8c0] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_EndDead
	// void K2_EndDead();                                                                                                    // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_CauseStruckDown
	// void K2_CauseStruckDown(class AActor* Attacker);                                                                      // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_CanNotDie
	// bool K2_CanNotDie();                                                                                                  // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_BeginRespawn
	// void K2_BeginRespawn(bool bPlayMontage);                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_BeginDie
	// void K2_BeginDie();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_AbilityEndedEvent
	// void K2_AbilityEndedEvent(class UPaladinComboAbility* Ability);                                                       // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.K2_AbilityActiveEvent
	// void K2_AbilityActiveEvent(class UPaladinComboAbility* Ability);                                                      // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.IsUnInterruptable
	// bool IsUnInterruptable();                                                                                             // [0xe66560] Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.IsInvincible
	// bool IsInvincible(bool bDodgeUseful);                                                                                 // [0xe664d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.IsinStrukDown
	// bool IsinStrukDown();                                                                                                 // [0xe66080] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.IsInAir
	// bool IsInAir();                                                                                                       // [0xe664a0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.IsDodging
	// bool IsDodging();                                                                                                     // [0xe66470] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.IsAlive
	// bool IsAlive();                                                                                                       // [0xe66440] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinCharacterBase.HideWidgetComp
	// void HideWidgetComp();                                                                                                // [0xe66420] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.HasAnyBeaternBack
	// bool HasAnyBeaternBack();                                                                                             // [0xe663f0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetUnLockAbilitys
	// void GetUnLockAbilitys(TArray<FText>& OutAbilities);                                                                  // [0xe662f0] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetUnLockAbilityRowNames
	// void GetUnLockAbilityRowNames(TArray<FName>& OutAbilities);                                                           // [0xe66240] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetOwnedGameplayTags
	// void GetOwnedGameplayTags(FGameplayTagContainer& TagContainer);                                                       // [0xe66180] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetLockTargetDirection
	// FVector GetLockTargetDirection(bool NoTargetReturnMyForward);                                                         // [0xe660d0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetLevel
	// int32_t GetLevel();                                                                                                   // [0xe660a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetInStruckDown
	// bool GetInStruckDown();                                                                                               // [0xe66080] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetInBattle
	// bool GetInBattle();                                                                                                   // [0xe66060] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetHealingAblitys
	// bool GetHealingAblitys(TArray<FName>& SelfAbilities, TArray<FName>& GroupHealingAbilities);                           // [0xe65f40] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetEnableCollision
	// bool GetEnableCollision();                                                                                            // [0xe65f10] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetCurrentCanUseAbilityNames
	// void GetCurrentCanUseAbilityNames(TArray<FName>& OutAbilities);                                                       // [0xe65e60] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetCurrentActiveAbilities
	// void GetCurrentActiveAbilities(TArray<FText>& OutAbilities);                                                          // [0xe65d60] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinCharacterBase.GetCharacterComboAbilityByKey
	// class UPaladinComboAbility* GetCharacterComboAbilityByKey(FName Key);                                                 // [0xe65cd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetCharacterComboAbilityByClass
	// class UPaladinComboAbility* GetCharacterComboAbilityByClass(class UClass* AbilityClass);                              // [0xe65c40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetBaseAttr
	// void GetBaseAttr(TArray<FGameplayAttribute>& AttriArray);                                                             // [0xe65b60] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetActiveComboAbilitySpec
	// bool GetActiveComboAbilitySpec(FGameplayAbilitySpec& OutAbilitySpec);                                                 // [0xe65940] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetActiveComboAbilityRow
	// bool GetActiveComboAbilityRow(FPaladinAbilityDataRow& OutAbilityDataRow);                                             // [0xe65870] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetActiveAbilityByClass
	// bool GetActiveAbilityByClass(class UClass* InClass, FGameplayAbilitySpec& OutAbility);                                // [0xe65610] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetActionStateFlag
	// bool GetActionStateFlag(ECharacterActionStateFlags flag);                                                             // [0xe65580] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.GetAbilityControlType
	// EPaladinAbilityControlType GetAbilityControlType(class UGameplayAbility* Ability);                                    // [0xe654f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.EndStruckDown
	// void EndStruckDown(bool bSkipGetup);                                                                                  // [0xe65460] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.EndPassiveMove
	// void EndPassiveMove();                                                                                                // [0xe65440] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.EndFighting
	// void EndFighting();                                                                                                   // [0xe65420] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.DoDodge
	// void DoDodge();                                                                                                       // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.DodgeEnd
	// void DodgeEnd();                                                                                                      // [0xe65400] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.Die_LandDisableMovement
	// void Die_LandDisableMovement();                                                                                       // [0xe653e0] Final|Native|Public  
	// Function /Script/Pal7.PaladinCharacterBase.Die
	// void Die(class AActor* InInstigator);                                                                                 // [0xe65360] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.DealSimpleCameraNotify
	// void DealSimpleCameraNotify(class UPaladinSimpleCameraAnimData* CameraAnimData);                                      // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.DealPaladinAnimNotify
	// void DealPaladinAnimNotify(FGameplayEventData& Payload, FString DisplayString);                                       // [0x15dd8c0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.CustomPerfromBeatenEffects
	// bool CustomPerfromBeatenEffects(class UPaladinComboAbility* HitAbility, int32_t HitIdx, FVector& BeatenLocation, FVector& BeatenNormal, class AActor* Attacker); // [0xe65190] Native|Event|Protected|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Pal7.PaladinCharacterBase.ComboAbilityIsActive
	// bool ComboAbilityIsActive(class UClass* AbilityClass);                                                                // [0xe65100] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.ClearBeatenBackTimer
	// void ClearBeatenBackTimer();                                                                                          // [0xe650e0] Final|Native|Private|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CanTurn
	// bool CanTurn();                                                                                                       // [0xe65000] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CanFreeMove
	// bool CanFreeMove();                                                                                                   // [0xe64fd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CanExcuteAbilityByKey
	// bool CanExcuteAbilityByKey(FName Key);                                                                                // [0xe64f40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CanDodge
	// bool CanDodge();                                                                                                      // [0xe64f10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CancelAllAbilities
	// void CancelAllAbilities();                                                                                            // [0xe650c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CancelAbilityByClass
	// bool CancelAbilityByClass(class UClass* InClass);                                                                     // [0xe65030] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CanAttack
	// bool CanAttack();                                                                                                     // [0xe64ee0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.CalcDodgeDirectionDegree
	// float CalcDodgeDirectionDegree();                                                                                     // [0xe64eb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.AddOrRemoveGameplayTag
	// void AddOrRemoveGameplayTag(FGameplayTag Tag, bool isAdd);                                                            // [0xe64de0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.AddOrRemoveDebuf_StrukDown
	// void AddOrRemoveDebuf_StrukDown(bool bAdd);                                                                           // [0xe64d50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.AddOrRemoveDebuf_Move
	// void AddOrRemoveDebuf_Move(bool B);                                                                                   // [0xe64cc0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinCharacterBase.AddOrRemoveDebuf_Attack
	// void AddOrRemoveDebuf_Attack(bool B);                                                                                 // [0xe64c30] Final|Native|Public|BlueprintCallable 
};
#pragma pack(pop)

/// Struct /Script/Pal7.PaladinAttrDataRow
/// Size: 0x0020 (0x000008 - 0x000028)
struct FPaladinAttrDataRow : FTableRowBase
{ 
	float                                              HPMAX;                                                      // 0x0008   (0x0004)  
	float                                              MPMAX;                                                      // 0x000C   (0x0004)  
	float                                              PhysicalAtk;                                                // 0x0010   (0x0004)  
	float                                              PhysicalDef;                                                // 0x0014   (0x0004)  
	float                                              SpellAtk;                                                   // 0x0018   (0x0004)  
	float                                              SpellDef;                                                   // 0x001C   (0x0004)  
	float                                              LevelGainManaRateByNormalAttack;                            // 0x0020   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0024   (0x0004)  MISSED
};

/// Struct /Script/Pal7.MonsterInfo
/// Size: 0x02A8 (0x000008 - 0x0002B0)
struct FMonsterInfo : FTableRowBase
{ 
	FGameplayTag                                       Tag;                                                        // 0x0008   (0x0008)  
	EMonsterKind                                       MonsterKind;                                                // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0011   (0x0007)  MISSED
	SDK_UNDEFINED(24,1443) /* FText */                 __um(PaladinName);                                          // 0x0018   (0x0018)  
	SDK_UNDEFINED(40,1444) /* TWeakObjectPtr<UClass*> */ __um(MonsterClass);                                       // 0x0030   (0x0028)  
	FName                                              AttributeGroupName;                                         // 0x0058   (0x0008)  
	int32_t                                            Level;                                                      // 0x0060   (0x0004)  
	FName                                              HateConfigName;                                             // 0x0064   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x006C   (0x0004)  MISSED
	SDK_UNDEFINED(40,1445) /* TWeakObjectPtr<UBehaviorTree*> */ __um(BotBehavior);                                 // 0x0070   (0x0028)  
	SDK_UNDEFINED(80,1446) /* TMap<EPaladinActionMontage, TWeakObjectPtr<UAnimMontage*>> */ __um(FightMontageGroup); // 0x0098   (0x0050)  
	SDK_UNDEFINED(80,1447) /* TMap<EPaladinSkillEffectMontage, TWeakObjectPtr<UAnimMontage*>> */ __um(EffectMontageGroup); // 0x00E8   (0x0050)  
	float                                              AttackInterval;                                             // 0x0138   (0x0004)  
	float                                              AttackDistance;                                             // 0x013C   (0x0004)  
	float                                              MinAttackDistanceRatio;                                     // 0x0140   (0x0004)  
	float                                              MaxAttackAngle;                                             // 0x0144   (0x0004)  
	EMonsterAttackType                                 AttackType;                                                 // 0x0148   (0x0001)  
	bool                                               IsInitiative;                                               // 0x0149   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x014A   (0x0006)  MISSED
	SDK_UNDEFINED(40,1448) /* TWeakObjectPtr<UDataTable*> */ __um(MonsterAbilityDataTable);                        // 0x0150   (0x0028)  
	SDK_UNDEFINED(80,1449) /* TMap<EMonsterSpeedMode, float> */ __um(MonsterSpeedConfig);                          // 0x0178   (0x0050)  
	float                                              BackToSpwanPointSpeedRatio;                                 // 0x01C8   (0x0004)  
	FName                                              DeadEffectAttachedBoneName;                                 // 0x01CC   (0x0008)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x01D4   (0x0004)  MISSED
	SDK_UNDEFINED(80,1450) /* TMap<TWeakObjectPtr<UAnimMontage*>, FRange_Angle> */ __um(AnimTurnMap);              // 0x01D8   (0x0050)  
	EBossBattleName                                    BossBattleName;                                             // 0x0228   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x0229   (0x0007)  MISSED
	SDK_UNDEFINED(80,1451) /* TMap<EPaladinGameDifficulty, FMonsterDifficultyOverrideData> */ __um(DifficultyOverrideData); // 0x0230   (0x0050)  
	bool                                               IsEnemyGroup;                                               // 0x0280   (0x0001)  
	unsigned char                                      UnknownData05_5[0x7];                                       // 0x0281   (0x0007)  MISSED
	SDK_UNDEFINED(40,1452) /* TWeakObjectPtr<UClass*> */ __um(GroupAttributeMonsterClass);                         // 0x0288   (0x0028)  
};

/// Struct /Script/Pal7.PaladinCameraInfo
/// Size: 0x002C (0x000000 - 0x00002C)
struct FPaladinCameraInfo
{ 
	float                                              FOV;                                                        // 0x0000   (0x0004)  
	float                                              SpringArmLength;                                            // 0x0004   (0x0004)  
	FVector                                            SpringArmSocketOffset;                                      // 0x0008   (0x000C)  
	float                                              DepthOfFieldFocalDistance;                                  // 0x0014   (0x0004)  
	float                                              DepthOfFieldFocalRegion;                                    // 0x0018   (0x0004)  
	float                                              DepthOfFieldNearTransitionRegion;                           // 0x001C   (0x0004)  
	float                                              DepthOfFieldFarTransitionRegion;                            // 0x0020   (0x0004)  
	float                                              DepthOfFieldNearBlurSize;                                   // 0x0024   (0x0004)  
	float                                              DepthOfFieldFarBlurSize;                                    // 0x0028   (0x0004)  
};

/// Struct /Script/Pal7.PaladinTransCameraInfo
/// Size: 0x0030 (0x000000 - 0x000030)
struct FPaladinTransCameraInfo
{ 
	FPaladinCameraInfo                                 CameraInfo;                                                 // 0x0000   (0x002C)  
	float                                              TransitionTime;                                             // 0x002C   (0x0004)  
};

/// Class /Script/Pal7.PaladinEnemy
/// Size: 0x0490 (0x000C80 - 0x001110)
#pragma pack(push, 0x1)
class alignas(0x10) APaladinEnemy : public APaladinCharacterBase
{ 
public:
	EEnemyState                                        EnemyFightingState;                                         // 0x0C78   (0x0001)  
	EMonsterKind                                       MonsterKind;                                                // 0x0C79   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0C7A   (0x0006)  MISSED
	FPaladinAttrDataRow                                EnemyTypeBaseAttrRatio;                                     // 0x0C80   (0x0028)  
	float                                              EnemyDeathExpRatio;                                         // 0x0CA8   (0x0004)  
	bool                                               InitWithDataTable;                                          // 0x0CAC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0CAD   (0x0003)  MISSED
	FMonsterInfo                                       MonsterInfo;                                                // 0x0CB0   (0x02B0)  
	SDK_UNDEFINED(16,1453) /* FMulticastInlineDelegate */ __um(SkillPerfromFinished);                              // 0x0F60   (0x0010)  
	bool                                               bIgnoreSummonSuperHeroHidden;                               // 0x0F70   (0x0001)  
	unsigned char                                      UnknownData02_5[0x2B];                                      // 0x0F71   (0x002B)  MISSED
	FName                                              GroupName;                                                  // 0x0F9C   (0x0008)  
	FVector                                            SpawnPoint;                                                 // 0x0FA4   (0x000C)  
	class UPaladinEnemyAttrSet*                        EnemyAttrSet;                                               // 0x0FB0   (0x0008)  
	SDK_UNDEFINED(16,1454) /* FMulticastInlineDelegate */ __um(OnSetAttackTarget);                                 // 0x0FB8   (0x0010)  
	bool                                               bNeverEndFightingByDistance;                                // 0x0FC8   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0FC9   (0x0003)  MISSED
	float                                              MaxDistanceAwayFromSpawnPoint;                              // 0x0FCC   (0x0004)  
	float                                              MaxCatchupDistance;                                         // 0x0FD0   (0x0004)  
	bool                                               bCanAffectHeroCamera;                                       // 0x0FD4   (0x0001)  
	unsigned char                                      UnknownData04_5[0x3];                                       // 0x0FD5   (0x0003)  MISSED
	FPaladinTransCameraInfo                            TransCameraInfo;                                            // 0x0FD8   (0x0030)  
	float                                              LockOffset;                                                 // 0x1008   (0x0004)  
	bool                                               bHoldInitiativeLock;                                        // 0x100C   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x100D   (0x0003)  MISSED
	class UInteractionComponent*                       InteractComp;                                               // 0x1010   (0x0008)  
	bool                                               bEnableBattleCourange;                                      // 0x1018   (0x0001)  
	bool                                               bEnableBattleWorried;                                       // 0x1019   (0x0001)  
	bool                                               bNeedHover;                                                 // 0x101A   (0x0001)  
	bool                                               bForceHiideHP;                                              // 0x101B   (0x0001)  
	bool                                               bGiveExp;                                                   // 0x101C   (0x0001)  
	bool                                               bSeqModeBackSpawnPoint;                                     // 0x101D   (0x0001)  
	bool                                               bInitMeshRenderConfig;                                      // 0x101E   (0x0001)  
	bool                                               bAutoRunBotBehavior;                                        // 0x101F   (0x0001)  
	bool                                               bDebugPrintRotate;                                          // 0x1020   (0x0001)  
	bool                                               bSingleRotateDirection;                                     // 0x1021   (0x0001)  
	unsigned char                                      UnknownData06_5[0x6];                                       // 0x1022   (0x0006)  MISSED
	class APaladinHero*                                AttackTarget;                                               // 0x1028   (0x0008)  
	bool                                               IsLookingAtTarget;                                          // 0x1030   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x1031   (0x0007)  MISSED
	SDK_UNDEFINED(80,1455) /* TMap<UAnimMontage*, FRange_Angle> */ __um(AnimTurnMap);                              // 0x1038   (0x0050)  
	class ULevelSequence*                              HeroUltimateHitLevelSequence;                               // 0x1088   (0x0008)  
	bool                                               IsInTurning;                                                // 0x1090   (0x0001)  
	EMonsterSpeedMode                                  SpeedMode;                                                  // 0x1091   (0x0001)  
	unsigned char                                      UnknownData08_5[0x56];                                      // 0x1092   (0x0056)  MISSED
	TArray<class UObject*>                             AssetsHolder;                                               // 0x10E8   (0x0010)  
	unsigned char                                      UnknownData09_6[0x10];                                      // 0x10F8   (0x0010)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinEnemy.UpdateLevel
	// void UpdateLevel(int32_t NewLevel);                                                                                   // [0xe77190] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.UnbindHeroAbilityActive
	// void UnbindHeroAbilityActive();                                                                                       // [0xe77170] Final|Native|Public  
	// Function /Script/Pal7.PaladinEnemy.TurnToTarget
	// class UAnimMontage* TurnToTarget(class AActor* TargetActor);                                                          // [0xe770e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.TurnToLocation
	// class UAnimMontage* TurnToLocation(FVector TargetLoc);                                                                // [0xe77040] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.ToggleSpeedMode
	// void ToggleSpeedMode(EMonsterSpeedMode& NewMode);                                                                     // [0xe76fb0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.ToggleMeshVisible
	// void ToggleMeshVisible(bool Visible);                                                                                 // [0xe76f20] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.ToggleEnemyState
	// void ToggleEnemyState(EEnemyState& EnemyState);                                                                       // [0xe76e90] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.StopLookAtTarget
	// void StopLookAtTarget();                                                                                              // [0xe76e70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.StopActionRotate
	// void StopActionRotate();                                                                                              // [0xe76e50] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.StartMoveToActorMode
	// void StartMoveToActorMode();                                                                                          // [0xe76e30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.StartLookAtTarget
	// void StartLookAtTarget(class AActor* Target, float RotateRate, float MaxAttackAngle);                                 // [0xe76d30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.StartFightingWithDelay
	// void StartFightingWithDelay(float MaxDelayTime);                                                                      // [0xe76cb0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.StartActionRotateToTarget
	// void StartActionRotateToTarget(FName CurveName, bool bMoingWhenRotate, float MaxRotateAngle);                         // [0xe76ba0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.StartActionRotate
	// void StartActionRotate(FName CurveName, float TargetAngle);                                                           // [0xe76ad0] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.ResetLevelConfig
	// void ResetLevelConfig(int32_t NewLevel);                                                                              // [0xe767a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.PassiveMove
	// void PassiveMove(float PushCharacterRecoverTime, FVector ImpactNormal, float PassiveMoveSpeed);                       // [0xe762a0] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.OutHover
	// void OutHover();                                                                                                      // [0xe76280] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.OnTurnMontageEnded
	// void OnTurnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);                                              // [0xe761b0] Final|Native|Public  
	// Function /Script/Pal7.PaladinEnemy.OnSpeedModeChanged
	// void OnSpeedModeChanged(EMonsterSpeedMode& NewMode);                                                                  // [0x15dd8c0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.OnPerformAttack
	// void OnPerformAttack();                                                                                               // [0xe75df0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.OnHeroAblityActive
	// void OnHeroAblityActive(class APaladinCharacterBase* Character, class UPaladinComboAbility* Ability);                 // [0xe759e0] Final|Native|Public  
	// Function /Script/Pal7.PaladinEnemy.LookAtTargetYawDifference
	// float LookAtTargetYawDifference();                                                                                    // [0xe758e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.LoadMonsterInfo
	// void LoadMonsterInfo(FSaveMonsterInfo& MonsterInfo);                                                                  // [0xe75750] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.K2_UpdateAttrUI
	// void K2_UpdateAttrUI();                                                                                               // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_ToggleEnemyState
	// void K2_ToggleEnemyState(EEnemyState& EnemyState);                                                                    // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_SetRandomParolNode
	// void K2_SetRandomParolNode(FRandomPatrolNode RndPatrolNode);                                                          // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_SetPatrolNode
	// void K2_SetPatrolNode(class APatrolNode* PatrolNode);                                                                 // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_OutHover
	// void K2_OutHover();                                                                                                   // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_OnStartAI
	// void K2_OnStartAI(class AAIController* AIController);                                                                 // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_OnHeroAblityActive
	// void K2_OnHeroAblityActive(class APaladinCharacterBase* Character, class UPaladinComboAbility* Ability);              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_OnDie
	// void K2_OnDie(class AActor* OtherActor);                                                                              // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.K2_MonsterPreInit
	// void K2_MonsterPreInit(EPaladinGameDifficulty GameDifficulty);                                                        // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinEnemy.IsLookAtTarget
	// bool IsLookAtTarget();                                                                                                // [0xe75700] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.InitEnemyAttribute
	// void InitEnemyAttribute(EPaladinGameDifficulty GameDifficulty);                                                       // [0xe75680] Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.GetSpeedMode
	// EMonsterSpeedMode GetSpeedMode();                                                                                     // [0xe75630] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.GetRandomSuggestSkill
	// void GetRandomSuggestSkill(class UClass*& SuggestSkill);                                                              // [0xe326f0] Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinEnemy.GetDeathExp
	// float GetDeathExp();                                                                                                  // [0xe755e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.FindEffectMontage
	// class UAnimMontage* FindEffectMontage(EPaladinSkillEffectMontage Action);                                             // [0xe75350] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.EndMoveToActorMode
	// void EndMoveToActorMode();                                                                                            // [0xe75330] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinEnemy.BindHeroAbilityActive
	// void BindHeroAbilityActive();                                                                                         // [0xe752f0] Final|Native|Public  
};
#pragma pack(pop)

/// Struct /Script/Pal7.PaladinLevelSequence
/// Size: 0x0008 (0x000000 - 0x000008)
struct FPaladinLevelSequence
{ 
	class UPaladinSequenceInfo*                        SequenceInfo;                                               // 0x0000   (0x0008)  
};

/// Struct /Script/Pal7.BattleDialog
/// Size: 0x0010 (0x000000 - 0x000010)
struct FBattleDialog
{ 
	FPaladinLevelSequence                              DialogAssets;                                               // 0x0000   (0x0008)  
	EDialogTriggerType                                 TriggerType;                                                // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              HPPercent;                                                  // 0x000C   (0x0004)  
};

/// Class /Script/Pal7.PaladinBossMonsterBase
/// Size: 0x0230 (0x001110 - 0x001340)
#pragma pack(push, 0x1)
class alignas(0x10) APaladinBossMonsterBase : public APaladinEnemy
{ 
public:
	unsigned char                                      UnknownData00_3[0x8];                                       // 0x1108   (0x0008)  MISSED
	int32_t                                            BossStage;                                                  // 0x1110   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x1114   (0x0004)  MISSED
	SDK_UNDEFINED(16,1456) /* FMulticastInlineDelegate */ __um(TurnToTargetFinish);                                // 0x1118   (0x0010)  
	SDK_UNDEFINED(16,1457) /* FMulticastInlineDelegate */ __um(EndFightingDelegate);                               // 0x1128   (0x0010)  
	unsigned char                                      UnknownData02_5[0x28];                                      // 0x1138   (0x0028)  MISSED
	class USoundAtomCue*                               SoundAtomCue;                                               // 0x1160   (0x0008)  
	class APaladinAtomSound*                           AgentSound;                                                 // 0x1168   (0x0008)  
	float                                              AgentSoundVolume;                                           // 0x1170   (0x0004)  
	int32_t                                            EndBlock;                                                   // 0x1174   (0x0004)  
	bool                                               bBossAutoToggleAttackTarget;                                // 0x1178   (0x0001)  
	EBossBattleName                                    BossBattleName;                                             // 0x1179   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x117A   (0x0006)  MISSED
	SDK_UNDEFINED(80,1458) /* TMap<int32_t, int32_t> */ __um(StageAndSoundBlock);                                  // 0x1180   (0x0050)  
	float                                              MeleeHeroMaxLockDisfactor;                                  // 0x11D0   (0x0004)  
	bool                                               bStaticHpBarInScreen;                                       // 0x11D4   (0x0001)  
	bool                                               EffectCameraArmLength;                                      // 0x11D5   (0x0001)  
	unsigned char                                      UnknownData04_5[0x2];                                       // 0x11D6   (0x0002)  MISSED
	float                                              CameraLenghtAddOffset;                                      // 0x11D8   (0x0004)  
	float                                              StartModifyDistance;                                        // 0x11DC   (0x0004)  
	float                                              MaxModifyDIstance;                                          // 0x11E0   (0x0004)  
	bool                                               bEnabledSwitchingLeader;                                    // 0x11E4   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x11E5   (0x0003)  MISSED
	float                                              ProbabilityToDodge;                                         // 0x11E8   (0x0004)  
	bool                                               bAutoPlayBossBattleBGM;                                     // 0x11EC   (0x0001)  
	unsigned char                                      UnknownData06_5[0x3];                                       // 0x11ED   (0x0003)  MISSED
	float                                              LeadPartnerColdDownInterval;                                // 0x11F0   (0x0004)  
	bool                                               bResetHeroToggleWhenEndFightig;                             // 0x11F4   (0x0001)  
	unsigned char                                      UnknownData07_5[0x3];                                       // 0x11F5   (0x0003)  MISSED
	TArray<FGameplayTag>                               DefaultGamePlayTagAddtoBoss;                                // 0x11F8   (0x0010)  
	bool                                               bBossChallengeFinalBoss;                                    // 0x1208   (0x0001)  
	unsigned char                                      UnknownData08_5[0x3];                                       // 0x1209   (0x0003)  MISSED
	int32_t                                            StageMax;                                                   // 0x120C   (0x0004)  
	TArray<FBattleDialog>                              BattleDialogs;                                              // 0x1210   (0x0010)  
	bool                                               bReleaseWhenEndFighint;                                     // 0x1220   (0x0001)  
	unsigned char                                      UnknownData09_5[0x7];                                       // 0x1221   (0x0007)  MISSED
	class UGiveItemComponent*                          GiveItemComponent;                                          // 0x1228   (0x0008)  
	SDK_UNDEFINED(16,1459) /* TArray<TWeakObjectPtr<UObject*>> */ __um(PreloadAssets);                             // 0x1230   (0x0010)  
	SDK_UNDEFINED(16,1460) /* TArray<TWeakObjectPtr<ULevelSequence*>> */ __um(PreloadSequencesAssets);             // 0x1240   (0x0010)  
	float                                              BeginFightDelay;                                            // 0x1250   (0x0004)  
	bool                                               bDestroyBodyWhenSQStart;                                    // 0x1254   (0x0001)  
	unsigned char                                      UnknownData10_6[0xE3];                                      // 0x1255   (0x00E3)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinBossMonsterBase.ToggleFightingState
	// void ToggleFightingState(bool InFighting);                                                                            // [0xe625c0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.ToggleCanBeAttackTarget
	// void ToggleCanBeAttackTarget(bool bCanBeAttack);                                                                      // [0xe62540] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.SetNewStage
	// void SetNewStage(int32_t NewStage);                                                                                   // [0xe62400] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.SetCanToggleAttackTarget
	// void SetCanToggleAttackTarget(bool bCanToggleTarget);                                                                 // [0xe622b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.SetAttackTarget
	// void SetAttackTarget(class APaladinHero* NewTarget);                                                                  // [0xe4bc50] Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.ReceivePlaymodeChanged
	// void ReceivePlaymodeChanged(FName NewPM);                                                                             // [0xe621a0] Final|Native|Private 
	// Function /Script/Pal7.PaladinBossMonsterBase.PrintDebugeBossAIData
	// void PrintDebugeBossAIData();                                                                                         // [0xe62180] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.K2_SetAttackTarget
	// void K2_SetAttackTarget(class APaladinHero* NewTarget);                                                               // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinBossMonsterBase.K2_OnStageChange
	// void K2_OnStageChange(int32_t NewStage);                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.PaladinBossMonsterBase.GetNewAttackTarget
	// class APaladinHero* GetNewAttackTarget();                                                                             // [0xe61f40] Native|Protected|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinBossMonsterBase.GetAngleToTarget
	// bool GetAngleToTarget(float& Angle);                                                                                  // [0xe61a10] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.ForceLockToggleAttackTarget
	// void ForceLockToggleAttackTarget(bool bLock);                                                                         // [0xe61980] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinBossMonsterBase.ForceEndFighting
	// void ForceEndFighting();                                                                                              // [0xe61960] Final|Native|Public|BlueprintCallable 
};
#pragma pack(pop)

/// Class /Script/Pal7.Boss_DuZhangQiOu
/// Size: 0x0000 (0x001340 - 0x001340)
class ABoss_DuZhangQiOu : public APaladinBossMonsterBase
{ 
public:


	/// Functions
	// Function /Script/Pal7.Boss_DuZhangQiOu.SetAttackTargetWithoutRegist
	// void SetAttackTargetWithoutRegist(class APaladinHero* NewTarget);                                                     // [0xe33090] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/Pal7.Boss_HuoXianShou
/// Size: 0x0030 (0x001340 - 0x001370)
class ABoss_HuoXianShou : public APaladinBossMonsterBase
{ 
public:
	class UPaladinPawnSensingComponent*                PawnSensing;                                                // 0x1338   (0x0008)  
	EHuoXianShouWeaponType                             CurrWeaponType;                                             // 0x1340   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x1341   (0x0003)  MISSED
	FName                                              RWeaponSocket;                                              // 0x1344   (0x0008)  
	FName                                              LWeaponSocket;                                              // 0x134C   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x1354   (0x0004)  MISSED
	class AActor*                                      RHandCurrWeapon;                                            // 0x1358   (0x0008)  
	class AActor*                                      LHandCurrWeapon;                                            // 0x1360   (0x0008)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x1368   (0x0008)  MISSED
};

/// Class /Script/Pal7.BossAoqingBenti
/// Size: 0x0040 (0x001340 - 0x001380)
class ABossAoqingBenti : public APaladinBossMonsterBase
{ 
public:
	int32_t                                            nMaxRecordSize;                                             // 0x1338   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x133C   (0x0004)  MISSED
	SDK_UNDEFINED(16,1461) /* TArray<FText> */         __um(PerformedSkillRecord);                                 // 0x1340   (0x0010)  
	SDK_UNDEFINED(16,1462) /* TArray<FText> */         __um(FilterRecordSkill);                                    // 0x1350   (0x0010)  
	bool                                               bOpenDamageRecord;                                          // 0x1360   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x1361   (0x0003)  MISSED
	float                                              RecordDamage;                                               // 0x1364   (0x0004)  
	TArray<class ATriggerBox*>                         PitFallVolums;                                              // 0x1368   (0x0010)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x1378   (0x0008)  MISSED


	/// Functions
	// Function /Script/Pal7.BossAoqingBenti.SortPitfallPointsByPlayerPose
	// void SortPitfallPointsByPlayerPose(TArray<FVector>& PointsIn, TArray<FVector>& PointsOut);                            // [0xe331a0] Final|Native|Protected|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.BossAoqingBenti.RandomSortCrossDataArray
	// void RandomSortCrossDataArray(TArray<FCrossSkillData>& VecArray, TArray<FCrossSkillData>& VecArrayRef);               // [0xe32e60] Final|Native|Static|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossAoqingBenti.GetSuggestSkill
	// void GetSuggestSkill(class UClass*& SuggestSkill);                                                                    // [0xe326f0] Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossAoqingBenti.GetPitfallAllSpawnablePoints
	// void GetPitfallAllSpawnablePoints(TArray<FVector>& Points, FPitfallArea& PitfallArea);                                // [0xe325f0] Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossAoqingBenti.GetLastPerfromedSkill
	// void GetLastPerfromedSkill(FText& LastPerfromedSkill);                                                                // [0xe32520] Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossAoqingBenti.GetFlickerPoint
	// bool GetFlickerPoint(FVector& FlickerPoint, class APaladinHero* FlickerTo, float& RadiusOut, float& RadiusIn);        // [0xe32200] Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossAoqingBenti.GetContinusePerfromedSkillsTimes
	// int32_t GetContinusePerfromedSkillsTimes();                                                                           // [0xe32050] Native|Protected|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Pal7.BossChongLou
/// Size: 0x0040 (0x001340 - 0x001380)
class ABossChongLou : public APaladinBossMonsterBase
{ 
public:
	int32_t                                            nMaxRecordSize;                                             // 0x1338   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x133C   (0x0004)  MISSED
	SDK_UNDEFINED(16,1463) /* TArray<FText> */         __um(PerformedSkillRecord);                                 // 0x1340   (0x0010)  
	SDK_UNDEFINED(16,1464) /* TArray<FText> */         __um(FilterRecordSkill);                                    // 0x1350   (0x0010)  
	float                                              BeatenTime_BombTrigger;                                     // 0x1360   (0x0004)  
	float                                              BeatenTime_ReduceValue;                                     // 0x1364   (0x0004)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x1368   (0x0018)  MISSED


	/// Functions
	// Function /Script/Pal7.BossChongLou.GetLastPerfromedSkill
	// void GetLastPerfromedSkill(FText& LastPerfromedSkill);                                                                // [0xe32520] Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossChongLou.GetFlickerPoint
	// bool GetFlickerPoint(FVector& FlickerPoint, class APaladinHero* FlickerTo, float& RadiusOut, float& RadiusIn);        // [0xe32200] Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossChongLou.GetContinusePerfromedSkillsTimes
	// int32_t GetContinusePerfromedSkillsTimes(TArray<FText>& QuarySkills);                                                 // [0xe32080] Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossChongLou.ClearCurrentBeaternRecord
	// void ClearCurrentBeaternRecord();                                                                                     // [0xe31e40] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.BossChongLou.CanTriggerBomb
	// bool CanTriggerBomb();                                                                                                // [0xe31e10] Final|Native|Protected|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Pal7.BossJiuYing
/// Size: 0x0020 (0x001340 - 0x001360)
class ABossJiuYing : public APaladinBossMonsterBase
{ 
public:
	int32_t                                            nMaxRecordSize;                                             // 0x1338   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x133C   (0x0004)  MISSED
	SDK_UNDEFINED(16,1465) /* TArray<FText> */         __um(PerformedSkillRecord);                                 // 0x1340   (0x0010)  
	SDK_UNDEFINED(16,1466) /* TArray<FText> */         __um(FilterRecordSkill);                                    // 0x1350   (0x0010)  


	/// Functions
	// Function /Script/Pal7.BossJiuYing.K2_ShieldDecrease
	// void K2_ShieldDecrease(float& DamageAmount);                                                                          // [0x15dd8c0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.BossJiuYing.GetLastPerfromedSkill
	// void GetLastPerfromedSkill(FText& LastPerfromedSkill);                                                                // [0xe32520] Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossJiuYing.GetCurrentShieldValue
	// float GetCurrentShieldValue();                                                                                        // [0xe32190] Final|Native|Protected|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Pal7.BossKuiYu
/// Size: 0x0020 (0x001340 - 0x001360)
class ABossKuiYu : public APaladinBossMonsterBase
{ 
public:
	int32_t                                            nMaxRecordSize;                                             // 0x1338   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x133C   (0x0004)  MISSED
	SDK_UNDEFINED(16,1467) /* TArray<FText> */         __um(PerformedSkillRecord);                                 // 0x1340   (0x0010)  
	SDK_UNDEFINED(16,1468) /* TArray<FText> */         __um(FilterRecordSkill);                                    // 0x1350   (0x0010)  


	/// Functions
	// Function /Script/Pal7.BossKuiYu.K2_OnSkillPerfromStart
	// void K2_OnSkillPerfromStart();                                                                                        // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Script/Pal7.BossKuiYu.K2_OnSkillPerfromEnd
	// void K2_OnSkillPerfromEnd();                                                                                          // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Script/Pal7.BossKuiYu.GetLastPerfromedSkill
	// void GetLastPerfromedSkill(FText& LastPerfromedSkill);                                                                // [0xe32520] Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossKuiYu.GetFlickerPoint
	// bool GetFlickerPoint(FVector& FlickerPoint, class APaladinHero* FlickerTo, float& RadiusOut, float& RadiusIn);        // [0xe32390] Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossKuiYu.GetContinusePerfromedSkillsTimes
	// int32_t GetContinusePerfromedSkillsTimes(TArray<FText>& QuarySkills);                                                 // [0xe32080] Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Pal7.BossMonsterInterface
/// Size: 0x0000 (0x000028 - 0x000028)
class UBossMonsterInterface : public UInterface
{ 
public:


	/// Functions
	// Function /Script/Pal7.BossMonsterInterface.BeginBossBattle
	// void BeginBossBattle();                                                                                               // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Script/Pal7.BossXiQuBase
/// Size: 0x0130 (0x001340 - 0x001470)
class ABossXiQuBase : public APaladinBossMonsterBase
{ 
public:
	bool                                               IsTurning;                                                  // 0x1338   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x1339   (0x0003)  MISSED
	FName                                              Stage1RashSkill;                                            // 0x133C   (0x0008)  
	FName                                              Stage2RashSkill;                                            // 0x1344   (0x0008)  
	FName                                              TailAttackSkill;                                            // 0x134C   (0x0008)  
	FName                                              StompAttackSkill;                                           // 0x1354   (0x0008)  
	float                                              TailAttackAbleAngleThreadhold;                              // 0x135C   (0x0004)  
	float                                              MeleeAttackRange;                                           // 0x1360   (0x0004)  
	float                                              RushAttackRange;                                            // 0x1364   (0x0004)  
	float                                              RushValidAngle;                                             // 0x1368   (0x0004)  
	float                                              RushAimRotateSpeed;                                         // 0x136C   (0x0004)  
	SDK_UNDEFINED(80,1469) /* TMap<FName, FStageProperty> */ __um(MeleeSkillStageProperty);                        // 0x1370   (0x0050)  
	SDK_UNDEFINED(80,1470) /* TMap<ETurnAroundMontageType, UAnimMontage*> */ __um(TurnAroundMontages);             // 0x13C0   (0x0050)  
	class UAnimMontage*                                DashTurnLeftMontage;                                        // 0x1410   (0x0008)  
	class UAnimMontage*                                DashTurnRightMontage;                                       // 0x1418   (0x0008)  
	float                                              Stage2HPExistPercentThreshold;                              // 0x1420   (0x0004)  
	float                                              MusthInterval;                                              // 0x1424   (0x0004)  
	float                                              MusthEffectTime;                                            // 0x1428   (0x0004)  
	bool                                               bMusth;                                                     // 0x142C   (0x0001)  
	bool                                               bInRushSkill;                                               // 0x142D   (0x0001)  
	bool                                               bEnableEndFighting;                                         // 0x142E   (0x0001)  
	bool                                               bEnableQuiteMust;                                           // 0x142F   (0x0001)  
	unsigned char                                      UnknownData01_6[0x40];                                      // 0x1430   (0x0040)  MISSED


	/// Functions
	// Function /Script/Pal7.BossXiQuBase.TurnToTargetPoint
	// bool TurnToTargetPoint(FVector TargetPoint);                                                                          // [0xe33380] Final|Native|Public|HasDefaults|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.TurnToAttackTarget
	// bool TurnToAttackTarget();                                                                                            // [0xe33350] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.ToggleRushAim
	// void ToggleRushAim(bool Open);                                                                                        // [0xe332c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.ShowHideUIWhenQTEPerfrom
	// void ShowHideUIWhenQTEPerfrom(bool bHide);                                                                            // [0xe33110] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.QuiteMusthState
	// void QuiteMusthState();                                                                                               // [0xe32e40] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.PerformSkillByName
	// bool PerformSkillByName(FName& SkillName);                                                                            // [0xe32da0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.PerformRushSkill
	// bool PerformRushSkill();                                                                                              // [0xe32d70] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.K2_UpdateRushAim
	// void K2_UpdateRushAim();                                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.BossXiQuBase.K2_QuiteMusthState
	// void K2_QuiteMusthState();                                                                                            // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.BossXiQuBase.K2_OnStartRushAim
	// void K2_OnStartRushAim();                                                                                             // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.BossXiQuBase.K2_OnEndRushAim
	// void K2_OnEndRushAim();                                                                                               // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.BossXiQuBase.K2_InMusthState
	// void K2_InMusthState();                                                                                               // [0x15dd8c0] Event|Public|BlueprintEvent 
	// Function /Script/Pal7.BossXiQuBase.IsInTailAttackRange
	// bool IsInTailAttackRange();                                                                                           // [0xe32800] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossXiQuBase.IsInRushRange
	// bool IsInRushRange();                                                                                                 // [0xe327d0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossXiQuBase.IsInRushAngle
	// bool IsInRushAngle();                                                                                                 // [0xe327a0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.BossXiQuBase.InMusthState
	// void InMusthState();                                                                                                  // [0xe32780] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.GetCurrentValidMeleeSkill
	// FName GetCurrentValidMeleeSkill();                                                                                    // [0xe321c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.BossXiQuBase.ClearMeleeRecord
	// void ClearMeleeRecord();                                                                                              // [0xe31e60] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/Pal7.BossXiuWuBase
/// Size: 0x0000 (0x001340 - 0x001340)
class ABossXiuWuBase : public APaladinBossMonsterBase
{ 
public:


	/// Functions
	// Function /Script/Pal7.BossXiuWuBase.TryPerfomSkills
	// bool TryPerfomSkills();                                                                                               // [0xe38910] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Pal7.CameraModifier_PostProcess
/// Size: 0x0018 (0x000048 - 0x000060)
class UCameraModifier_PostProcess : public UCameraModifier
{ 
public:
	TArray<class UPaladinPostProcess*>                 ActivePPBlends;                                             // 0x0048   (0x0010)  
	float                                              SplitScreenShakeScale;                                      // 0x0058   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x005C   (0x0004)  MISSED
};

/// Class /Script/Pal7.CameraModifierFocusLockActor
/// Size: 0x0068 (0x0000B0 - 0x000118)
class UCameraModifierFocusLockActor : public UBaseCameraModifier
{ 
public:
	float                                              SwingCameraSpeed;                                           // 0x00B0   (0x0004)  
	float                                              LockTargetRadioInScreen;                                    // 0x00B4   (0x0004)  
	bool                                               bEnableKeepInScreen;                                        // 0x00B8   (0x0001)  
	bool                                               bEnableLockingOn;                                           // 0x00B9   (0x0001)  
	bool                                               bEnableKeepFarFromCharacter;                                // 0x00BA   (0x0001)  
	bool                                               bConstraintDistance;                                        // 0x00BB   (0x0001)  
	float                                              OriginConstraintDistanceFromCharacter;                      // 0x00BC   (0x0004)  
	float                                              RotateSpeed;                                                // 0x00C0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x54];                                      // 0x00C4   (0x0054)  MISSED


	/// Functions
	// Function /Script/Pal7.CameraModifierFocusLockActor.DrawDebugRect
	// void DrawDebugRect();                                                                                                 // [0xbf6f60] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Pal7.CanvasPanelWithNavigation
/// Size: 0x0020 (0x000150 - 0x000170)
class UCanvasPanelWithNavigation : public UCanvasPanel
{ 
public:
	unsigned char                                      UnknownData00_3[0x18];                                      // 0x0150   (0x0018)  MISSED
	EPaladinUIKeyControlType                           ControlType;                                                // 0x0168   (0x0001)  
	SDK_UNDEFINED(1,1471) /* TEnumAsByte<EOrientation> */ __um(Orientation);                                       // 0x0169   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x016A   (0x0006)  MISSED


	/// Functions
	// Function /Script/Pal7.CanvasPanelWithNavigation.SetOrientation
	// void SetOrientation(TEnumAsByte<EOrientation> NewOrientation);                                                        // [0xe38890] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.CanvasPanelWithNavigation.SetControlType
	// void SetControlType(EPaladinUIKeyControlType NewControlType);                                                         // [0xe38810] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Pal7.CDModifierCalculation
/// Size: 0x0000 (0x000040 - 0x000040)
class UCDModifierCalculation : public UGameplayModMagnitudeCalculation
{ 
public:
};

/// Class /Script/Pal7.DebuffApplicationChance
/// Size: 0x0000 (0x000028 - 0x000028)
class UDebuffApplicationChance : public UGameplayEffectCustomApplicationRequirement
{ 
public:
};

/// Class /Script/Pal7.QuestProgressCondition
/// Size: 0x0018 (0x000138 - 0x000150)
class UQuestProgressCondition : public UDialogConditionBase
{ 
public:
	EQuestProgressType                                 QuestType;                                                  // 0x0138   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0139   (0x0003)  MISSED
	int32_t                                            MinStep;                                                    // 0x013C   (0x0004)  
	int32_t                                            MaxStep;                                                    // 0x0140   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0144   (0x0004)  MISSED
	class UPaladinQuestAsset*                          QuestAsset;                                                 // 0x0148   (0x0008)  
};

/// Struct /Script/Pal7.SaveGameItemHandle_GlobalTag
/// Size: 0x0008 (0x000000 - 0x000008)
struct FSaveGameItemHandle_GlobalTag
{ 
	FGameplayTag                                       OwnerNodeTag;                                               // 0x0000   (0x0008)  
};

/// Class /Script/Pal7.DialogueGameTagCondition
/// Size: 0x0008 (0x000138 - 0x000140)
class UDialogueGameTagCondition : public UDialogConditionBase
{ 
public:
	FSaveGameItemHandle_GlobalTag                      BindingTag;                                                 // 0x0138   (0x0008)  
};

/// Class /Script/Pal7.DialogueItemCountCondition
/// Size: 0x0050 (0x000138 - 0x000188)
class UDialogueItemCountCondition : public UDialogConditionBase
{ 
public:
	SDK_UNDEFINED(80,1472) /* TMap<int32_t, int32_t> */ __um(needItemCountMap);                                    // 0x0138   (0x0050)  
};

/// Class /Script/Pal7.DialogQuestCondition_Bp
/// Size: 0x0000 (0x000138 - 0x000138)
class UDialogQuestCondition_Bp : public UDialogConditionBase
{ 
public:
};

/// Struct /Script/Pal7.DialogueConditions
/// Size: 0x0010 (0x000000 - 0x000010)
struct FDialogueConditions
{ 
	TArray<class UPaladinCondition*>                   DialogueNodeConditions;                                     // 0x0000   (0x0010)  
};

/// Struct /Script/Pal7.DialogueAnimation
/// Size: 0x0028 (0x000000 - 0x000028)
struct FDialogueAnimation
{ 
	class UAnimSequenceBase*                           Animation;                                                  // 0x0000   (0x0008)  
	FName                                              PlayerID;                                                   // 0x0008   (0x0008)  
	FName                                              SlotName;                                                   // 0x0010   (0x0008)  
	bool                                               Loop;                                                       // 0x0018   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0019   (0x0003)  MISSED
	float                                              BlendInTime;                                                // 0x001C   (0x0004)  
	float                                              BlendOutTime;                                               // 0x0020   (0x0004)  
	float                                              PlayRate;                                                   // 0x0024   (0x0004)  
};

/// Struct /Script/Pal7.DialogueNode
/// Size: 0x00F0 (0x000000 - 0x0000F0)
struct FDialogueNode
{ 
	int32_t                                            ID;                                                         // 0x0000   (0x0004)  
	EDialogueNodeType                                  nodeType;                                                   // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0005   (0x0003)  MISSED
	SDK_UNDEFINED(24,1473) /* FText */                 __um(Text);                                                 // 0x0008   (0x0018)  
	TArray<int32_t>                                    Links;                                                      // 0x0020   (0x0010)  
	FVector2D                                          Coordinates;                                                // 0x0030   (0x0008)  
	bool                                               bHasEvents;                                                 // 0x0038   (0x0001)  
	bool                                               bHasConditions;                                             // 0x0039   (0x0001)  
	unsigned char                                      UnknownData01_5[0x6];                                       // 0x003A   (0x0006)  MISSED
	TArray<class UDialogueEvent*>                      Events;                                                     // 0x0040   (0x0010)  
	FDialogueConditions                                Conditions;                                                 // 0x0050   (0x0010)  
	class USoundAtomCue*                               DialogueSound;                                              // 0x0060   (0x0008)  
	class UDialogueWave*                               DialogueWave;                                               // 0x0068   (0x0008)  
	float                                              extraSeconds;                                               // 0x0070   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0074   (0x0004)  MISSED
	class UPaladinSequenceInfo*                        Sequence;                                                   // 0x0078   (0x0008)  
	FName                                              PlayerID;                                                   // 0x0080   (0x0008)  
	class UClass*                                      Camera;                                                     // 0x0088   (0x0008)  
	class UCameraAnim*                                 CameraAnim;                                                 // 0x0090   (0x0008)  
	TArray<FDialogueAnimation>                         AnimationArr;                                               // 0x0098   (0x0010)  
	SDK_UNDEFINED(24,1474) /* FText */                 __um(SpeakerName);                                          // 0x00A8   (0x0018)  
	bool                                               AllSubNodeDirectShow;                                       // 0x00C0   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x00C1   (0x0003)  MISSED
	int32_t                                            Weight;                                                     // 0x00C4   (0x0004)  
	SDK_UNDEFINED(16,1475) /* FString */               __um(NodeComment);                                          // 0x00C8   (0x0010)  
	TArray<class UPaladinAction*>                      Actions;                                                    // 0x00D8   (0x0010)  
	FGameplayTag                                       ActiveTag;                                                  // 0x00E8   (0x0008)  
};

/// Class /Script/Pal7.Dialogue
/// Size: 0x0070 (0x000030 - 0x0000A0)
class UDialogue : public UDataAsset
{ 
public:
	bool                                               DisplayIdleSplines;                                         // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	SDK_UNDEFINED(24,1476) /* FText */                 __um(Name);                                                 // 0x0038   (0x0018)  
	TArray<FDialogueNode>                              Data;                                                       // 0x0050   (0x0010)  
	int32_t                                            NextNodeId;                                                 // 0x0060   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0064   (0x0004)  MISSED
	class UClass*                                      DefaultPlayerCamera;                                        // 0x0068   (0x0008)  
	class UClass*                                      PlayerTransformsTemplate;                                   // 0x0070   (0x0008)  
	TArray<FName>                                      PlayersList;                                                // 0x0078   (0x0010)  
	unsigned char                                      UnknownData02_6[0x18];                                      // 0x0088   (0x0018)  MISSED


	/// Functions
	// Function /Script/Pal7.Dialogue.CollectQuestConditions
	// void CollectQuestConditions();                                                                                        // [0xbf6f60] Final|Native|Public  
	// Function /Script/Pal7.Dialogue.CallFunctionByName
	// void CallFunctionByName(class UObject* Object, FString FunctionName);                                                 // [0xe384f0] Final|Native|Static|Public 
};

/// Class /Script/Pal7.DialogueEvent
/// Size: 0x0010 (0x000028 - 0x000038)
class UDialogueEvent : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x38];                                      // 0x0000   (0x0038)  MISSED
};

/// Class /Script/Pal7.DialogueEvent_BP
/// Size: 0x0000 (0x000038 - 0x000038)
class UDialogueEvent_BP : public UDialogueEvent
{ 
public:


	/// Functions
	// Function /Script/Pal7.DialogueEvent_BP.K2_ActivateEvent
	// void K2_ActivateEvent();                                                                                              // [0x15dd8c0] Event|Public|BlueprintEvent 
};

/// Class /Script/Pal7.PushQuestEvent
/// Size: 0x0008 (0x000038 - 0x000040)
class UPushQuestEvent : public UDialogueEvent
{ 
public:
	FName                                              QuestID;                                                    // 0x0038   (0x0008)  
};

/// Class /Script/Pal7.TriggerGameTagEvent
/// Size: 0x0008 (0x000038 - 0x000040)
class UTriggerGameTagEvent : public UDialogueEvent
{ 
public:
	FGameplayTag                                       BindingTag;                                                 // 0x0038   (0x0008)  
};

/// Class /Script/Pal7.ModifyItemCountEvent
/// Size: 0x0058 (0x000038 - 0x000090)
class UModifyItemCountEvent : public UDialogueEvent
{ 
public:
	SDK_UNDEFINED(80,1477) /* TMap<int32_t, int32_t> */ __um(ItemCountMap);                                        // 0x0038   (0x0050)  
	int32_t                                            Money;                                                      // 0x0088   (0x0004)  
	int32_t                                            Exp;                                                        // 0x008C   (0x0004)  
};

/// Class /Script/Pal7.CustomEvent
/// Size: 0x0010 (0x000038 - 0x000048)
class UCustomEvent : public UDialogueEvent
{ 
public:
	FName                                              ReceiveActorID;                                             // 0x0038   (0x0008)  
	FName                                              FunctionName;                                               // 0x0040   (0x0008)  
};

/// Class /Script/Pal7.DialogueWidget
/// Size: 0x0000 (0x000230 - 0x000230)
class UDialogueWidget : public UUserWidget
{ 
public:


	/// Functions
	// Function /Script/Pal7.DialogueWidget.SetTitleInfo
	// void SetTitleInfo(FText& TitleInfo);                                                                                  // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.DialogueWidget.SetSpeakerAndInfo
	// void SetSpeakerAndInfo(FText& SpeakerName, FText& speakInfo);                                                         // [0x15dd8c0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.DialogueWidget.Clear
	// void Clear();                                                                                                         // [0x15dd8c0] Event|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Script/Pal7.PaladinDLCManager
/// Size: 0x0080 (0x0000B0 - 0x000130)
class UPaladinDLCManager : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x80];                                      // 0x00B0   (0x0080)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinDLCManager.MarkDLCUnlockDisplayed
	// void MarkDLCUnlockDisplayed(FName DLCRow);                                                                            // [0xe38790] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinDLCManager.IsDLCDateUpdated
	// bool IsDLCDateUpdated();                                                                                              // [0xe38770] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinDLCManager.GetUnlockedDLC
	// TArray<FName> GetUnlockedDLC();                                                                                       // [0xe386b0] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinDLCManager.GetPaladinDLCManager
	// class UPaladinDLCManager* GetPaladinDLCManager();                                                                     // [0xe38680] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Pal7.PaladinDLCManager.GetNeedDisplayUnlockedDLC
	// TArray<FName> GetNeedDisplayUnlockedDLC();                                                                            // [0xe38600] Final|Native|Public|BlueprintCallable|BlueprintPure 
};

/// Class /Script/Pal7.DynamicSpawnActorComponent
/// Size: 0x0000 (0x000220 - 0x000220)
class UDynamicSpawnActorComponent : public UChildActorComponent
{ 
public:
};

/// Class /Script/Pal7.PaladinUIBase
/// Size: 0x0040 (0x000230 - 0x000270)
class UPaladinUIBase : public UUserWidget
{ 
public:
	EPaladinUIMouseCursor                              ForceMouseCursor;                                           // 0x0230   (0x0001)  
	bool                                               bHaveOpenUISound;                                           // 0x0231   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x0232   (0x0006)  MISSED
	class USoundAtomCue*                               CustomOpenUISound;                                          // 0x0238   (0x0008)  
	bool                                               bHaveCloseUISound;                                          // 0x0240   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0241   (0x0007)  MISSED
	class USoundAtomCue*                               CustomCloseUISound;                                         // 0x0248   (0x0008)  
	SDK_UNDEFINED(16,1478) /* FString */               __um(UIOptions);                                            // 0x0250   (0x0010)  
	unsigned char                                      UnknownData02_6[0x10];                                      // 0x0260   (0x0010)  MISSED


	/// Functions
	// Function /Script/Pal7.PaladinUIBase.SetUIOptions
	// void SetUIOptions(FString InOptions);                                                                                 // [0xee4e20] Final|Native|Protected 
	// Function /Script/Pal7.PaladinUIBase.PaladinConstruct
	// void PaladinConstruct();                                                                                              // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Script/Pal7.PaladinUIBase.OpenUIAnim
	// class UWidgetAnimation* OpenUIAnim(class UUserWidget*& AnimWidget);                                                   // [0x15dd8c0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.PaladinUIBase.OnPaladinUIEvent
	// bool OnPaladinUIEvent(EPaladinUIKeyControlType UIKeyControlType, EUINavigation UINavigation);                         // [0x15dd8c0] BlueprintCosmetic|Event|Protected|BlueprintCallable|BlueprintEvent 
	// Function /Script/Pal7.PaladinUIBase.OnOpenUIAnimEndCall
	// void OnOpenUIAnimEndCall();                                                                                           // [0xee4880] Final|Native|Protected 
	// Function /Script/Pal7.PaladinUIBase.OnCloseUIAnimEndCall
	// void OnCloseUIAnimEndCall();                                                                                          // [0xee4860] Final|Native|Protected 
	// Function /Script/Pal7.PaladinUIBase.K2_PaladinUIKeyDown
	// bool K2_PaladinUIKeyDown(FKey Key);                                                                                   // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Script/Pal7.PaladinUIBase.K2_OnClosed
	// void K2_OnClosed();                                                                                                   // [0x15dd8c0] Event|Protected|BlueprintEvent 
	// Function /Script/Pal7.PaladinUIBase.GetUIOptions
	// FString GetUIOptions();                                                                                               // [0xee45d0] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Pal7.PaladinUIBase.GetForceMouseCursor
	// EPaladinUIMouseCursor GetForceMouseCursor();                                                                          // [0xeb8700] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinUIBase.CloseUIAnim
	// class UWidgetAnimation* CloseUIAnim(class UUserWidget*& AnimWidget);                                                  // [0x15dd8c0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/Pal7.PaladinUIBase.CloseUI
	// void CloseUI();                                                                                                       // [0xee44a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Pal7.PaladinUIBase.ClearUIOptions
	// void ClearUIOptions();                                                                                                // [0xee4480] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/Pal7.FocusLostUI
/// Size: 0x0000 (0x000270 - 0x000270)
class UFocusLostUI : public UPaladinUIBase
{ 
public:
};

/// Class /Script/Pal7.GhostMeshActor
/// Size: 0x0010 (0x000220 - 0x000230)
class AGhostMeshActor : public AActor
{ 
public:
	class USkeletalMeshComponent*                      SpawnFromSkeletalMeshComp;                                  // 0x0220   (0x0008)  
	class UPoseableMeshComponent*                      GhostMeshComponent;                                         // 0x0228   (0x0008)  


	/// Functions
	// Function /Script/Pal7.GhostMeshActor.PostInitGhostMeshComp
	// void PostInitGhostMeshComp();                                                                                         // [0x15dd8c0] Event|Public|BlueprintEvent 
};

/// Struct /Script/Pal7.WeightItemUnit
/// Size: 0x0014 (0x000000 - 0x000014)
struct FWeightItemUnit
{ 
	int32_t                                            ItemId;                                                     // 0x0000   (0x0004)  
	int32_t                                            MinCount;                                                   // 0x0004   (0x0004)  
	int32_t                                            MaxCount;                                                   // 0x0008   (0x0004)  
	float                                              Weight;                                                     // 0x000C   (0x0004)  
	bool                                               AffectedByDropRate;                                         // 0x0010   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0011   (0x0003)  MISSED
};

/// Struct /Script/Pal7.WeightItemTable
/// Size: 0x0010 (0x000000 - 0x000010)
struct FWeightItemTable
{ 
	TArray<FWeightItemUnit>                            WeightItemTable;                                            // 0x0000   (0x0010)  
};

/// Struct /Script/Pal7.QuestItemUnit
/// Size: 0x0028 (0x000000 - 0x000028)
struct FQuestItemUnit
{ 
	int32_t                                            ItemId;                                                     // 0x0000   (0x0004)  
	int32_t                                            MinCount;                                                   // 0x0004   (0x0004)  
	int32_t                                            MaxCount;                                                   // 0x0008   (0x0004)  
	float                                              DropChance;                                                 // 0x000C   (0x0004)  
	FName                                              QuestInstanceID;                                            // 0x0010   (0x0008)  
	FName                                              MinPID;                                                     // 0x0018   (0x0008)  
	FName                                              MaxPID;                                                     // 0x0020   (0x0008)  
};

/// Class /Script/Pal7.GiveItemComponent
/// Size: 0x00A0 (0x0000B0 - 0x000150)
class UGiveItemComponent : public UActorComponent
{ 
public:
	TArray<FWeightItemTable>                           ItemDropTable;                                              // 0x00B0   (0x0010)  
	TArray<FQuestItemUnit>                             QuestDropTable;                                             // 0x00C0   (0x0010)  
	SDK_UNDEFINED(80,1479) /* TMap<int32_t, int32_t> */ __um(ResultItemTable);                                     // 0x00D0   (0x0050)  
	int32_t                                            MoneyMin;                                                   // 0x0120   (0x0004)  
	int32_t                                            MoneyMax;                                                   // 0x0124   (0x0004)  
